tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
    struct {
      __IOM uint32_t IPREFETCH  : 1;            /*!< [0..0] When set, instruction accesses to the SRAM banks will
                                                     be prefetched (normally 2 cycle read access). Generally,
                                                     this mode bit should be set for improved performance when
                                                     executing instructions from SRAM.                                         */
      __IOM uint32_t IPREFETCH_CACHE : 1;       /*!< [1..1] Secondary prefetch feature that will cache prefetched
                                                     data across bus waitstates (requires IPREFETCH to be set).                */
      __IM  uint32_t            : 2;
      __IOM uint32_t DPREFETCH  : 1;            /*!< [4..4] When set, data bus accesses to the SRAM banks will be
                                                     prefetched (normally 2 cycle read access). Use of this
                                                     mode bit is only recommended if the work flow has a large
                                                     number of sequential accesses.                                            */
      __IOM uint32_t DPREFETCH_CACHE : 1;       /*!< [5..5] Secondary prefetch feature that will cache prefetched
                                                     data across bus waitstates (requires DPREFETCH to be set).                */
    } SRAMMODE_b;
  } ;
  __IM  uint32_t  RESERVED13[48];

  union {
    __IOM uint32_t KEXTCLKSEL;                  /*!< (@ 0x00000348) Key Register to enable the use of external clock
                                                                    selects via the EXTCLKSEL reg                              */

    struct {
      __IOM uint32_t KEXTCLKSEL : 32;           /*!< [31..0] Key register value.                                               */
    } KEXTCLKSEL_b;
  } ;
  __IM  uint32_t  RESERVED14[4];

  union {
    __IOM uint32_t SIMOBUCK4;                   /*!< (@ 0x0000035C) SIMO Buck Control Reg1                                     */

    struct {
      __IOM uint32_t SIMOBUCKMEMLPLOWTONTRIM : 4;/*!< [3..0] simobuck_mem_lp_low_ton_trim                                      */
      __IOM uint32_t SIMOBUCKMEMACTDRVSTRTRIM : 2;/*!< [5..4] simobuck_mem_act_drvstr_trim                                     */
      __IOM uint32_t SIMOBUCKMEMLPDRVSTRTRIM : 2;/*!< [7..6] simobuck_mem_lp_drvstr_trim                                       */
      __IOM uint32_t SIMOBUCKMEMLEAKAGETRIM : 2;/*!< [9..8] simobuck_mem_leakage_trim                                          */
      __IOM uint32_t SIMOBUCKZXTRIM : 4;        /*!< [13..10] simobuck_zx_trim                                                 */
      __IOM uint32_t SIMOBUCKUVLOCNTRTRIM : 3;  /*!< [16..14] simobuck_uvlo_cntr_trim                                          */
      __IOM uint32_t SIMOBUCKUVLODRVSTRTRIM : 3;/*!< [19..17] simobuck_uvlo_drvstr_trim                                        */
      __IOM uint32_t SIMOBUCKEXTCLKSEL : 1;     /*!< [20..20] simobuck_extclk_sel                                              */
      __IOM uint32_t SIMOBUCKCLKDIVSEL : 2;     /*!< [22..21] simobuck_clkdiv_sel                                              */
      __IOM uint32_t SIMOBUCKCOMP2LPEN : 1;     /*!< [23..23] simobuck_comp2_lp_en                                             */
      __IOM uint32_t SIMOBUCKCOMP2TIMEOUTEN : 1;/*!< [24..24] simobuck_comp2_timeout_en                                        */
      __IOM uint32_t SIMOBUCKPRIORITYSEL : 1;   /*!< [25..25] simobuck_priority_sel                                            */
      __IOM uint32_t SIMOBUCKUVLOMODE : 2;      /*!< [27..26] simobuck_uvlo_mode                                               */
      __IOM uint32_t SIMOBUCKIBIASTRIM : 4;     /*!< [31..28] simobuck_bias_trim                                               */
    } SIMOBUCK4_b;
  } ;
  __IM  uint32_t  RESERVED15[2];

  union {
    __IOM uint32_t BLEBUCK2;                    /*!< (@ 0x00000368) BLEBUCK2 Control Reg                                       */

    struct {
      __IOM uint32_t BLEBUCKTONLOWTRIM : 6;     /*!< [5..0] blebuck_ton_low_trim                                               */
      __IOM uint32_t BLEBUCKTONHITRIM : 6;      /*!< [11..6] blebuck_ton_hi_trim                                               */
      __IOM uint32_t BLEBUCKTOND2ATRIM : 6;     /*!< [17..12] blebuck_ton_trim                                                 */
    } BLEBUCK2_b;
  } ;
  __IM  uint32_t  RESERVED16[13];

  union {
    __IOM uint32_t FLASHWPROT0;                 /*!< (@ 0x000003A0) Flash Write Protection Bits                                */

    struct {
      __IOM uint32_t FW0BITS    : 32;           /*!< [31..0] Write protect flash 0x00000000 - 0x0007FFFF. Each bit
                                                     provides write protection for 16KB chunks of flash data
                                                     space. Bits are cleared by writing a 1 to the bit. When
                                                     read, 0 indicates the region is protected. Bits are sticky
                                                     (can be set when PROTLOCK is 1, but only cleared by reset)                */
    } FLASHWPROT0_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT1;                 /*!< (@ 0x000003A4) Flash Write Protection Bits                                */

    struct {
      __IOM uint32_t FW1BITS    : 32;           /*!< [31..0] Write protect flash 0x00080000 - 0x000FFFFF. Each bit
                                                     provides write protection for 16KB chunks of flash data
                                                     space. Bits are cleared by writing a 1 to the bit. When
                                                     read, 0 indicates the region is protected. Bits are sticky
                                                     (can be set when PROTLOCK is 1, but only cleared by reset)                */
    } FLASHWPROT1_b;
  } ;
  __IM  uint32_t  RESERVED17[2];

  union {
    __IOM uint32_t FLASHRPROT0;                 /*!< (@ 0x000003B0) Flash Read Protection Bits                                 */

