tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
#define ADC_INTSTAT_CNVCMP_Msk            (0x1UL)                   /*!< ADC INTSTAT: CNVCMP (Bitfield-Mask: 0x01)             */
/* ========================================================  INTCLR  ========================================================= */
#define ADC_INTCLR_DERR_Pos               (7UL)                     /*!< ADC INTCLR: DERR (Bit 7)                              */
#define ADC_INTCLR_DERR_Msk               (0x80UL)                  /*!< ADC INTCLR: DERR (Bitfield-Mask: 0x01)                */
#define ADC_INTCLR_DCMP_Pos               (6UL)                     /*!< ADC INTCLR: DCMP (Bit 6)                              */
#define ADC_INTCLR_DCMP_Msk               (0x40UL)                  /*!< ADC INTCLR: DCMP (Bitfield-Mask: 0x01)                */
#define ADC_INTCLR_WCINC_Pos              (5UL)                     /*!< ADC INTCLR: WCINC (Bit 5)                             */
#define ADC_INTCLR_WCINC_Msk              (0x20UL)                  /*!< ADC INTCLR: WCINC (Bitfield-Mask: 0x01)               */
#define ADC_INTCLR_WCEXC_Pos              (4UL)                     /*!< ADC INTCLR: WCEXC (Bit 4)                             */
#define ADC_INTCLR_WCEXC_Msk              (0x10UL)                  /*!< ADC INTCLR: WCEXC (Bitfield-Mask: 0x01)               */
#define ADC_INTCLR_FIFOOVR2_Pos           (3UL)                     /*!< ADC INTCLR: FIFOOVR2 (Bit 3)                          */
#define ADC_INTCLR_FIFOOVR2_Msk           (0x8UL)                   /*!< ADC INTCLR: FIFOOVR2 (Bitfield-Mask: 0x01)            */
#define ADC_INTCLR_FIFOOVR1_Pos           (2UL)                     /*!< ADC INTCLR: FIFOOVR1 (Bit 2)                          */
#define ADC_INTCLR_FIFOOVR1_Msk           (0x4UL)                   /*!< ADC INTCLR: FIFOOVR1 (Bitfield-Mask: 0x01)            */
#define ADC_INTCLR_SCNCMP_Pos             (1UL)                     /*!< ADC INTCLR: SCNCMP (Bit 1)                            */
#define ADC_INTCLR_SCNCMP_Msk             (0x2UL)                   /*!< ADC INTCLR: SCNCMP (Bitfield-Mask: 0x01)              */
#define ADC_INTCLR_CNVCMP_Pos             (0UL)                     /*!< ADC INTCLR: CNVCMP (Bit 0)                            */
#define ADC_INTCLR_CNVCMP_Msk             (0x1UL)                   /*!< ADC INTCLR: CNVCMP (Bitfield-Mask: 0x01)              */
/* ========================================================  INTSET  ========================================================= */
#define ADC_INTSET_DERR_Pos               (7UL)                     /*!< ADC INTSET: DERR (Bit 7)                              */
#define ADC_INTSET_DERR_Msk               (0x80UL)                  /*!< ADC INTSET: DERR (Bitfield-Mask: 0x01)                */
#define ADC_INTSET_DCMP_Pos               (6UL)                     /*!< ADC INTSET: DCMP (Bit 6)                              */
#define ADC_INTSET_DCMP_Msk               (0x40UL)                  /*!< ADC INTSET: DCMP (Bitfield-Mask: 0x01)                */
#define ADC_INTSET_WCINC_Pos              (5UL)                     /*!< ADC INTSET: WCINC (Bit 5)                             */
#define ADC_INTSET_WCINC_Msk              (0x20UL)                  /*!< ADC INTSET: WCINC (Bitfield-Mask: 0x01)               */
#define ADC_INTSET_WCEXC_Pos              (4UL)                     /*!< ADC INTSET: WCEXC (Bit 4)                             */
#define ADC_INTSET_WCEXC_Msk              (0x10UL)                  /*!< ADC INTSET: WCEXC (Bitfield-Mask: 0x01)               */
#define ADC_INTSET_FIFOOVR2_Pos           (3UL)                     /*!< ADC INTSET: FIFOOVR2 (Bit 3)                          */
#define ADC_INTSET_FIFOOVR2_Msk           (0x8UL)                   /*!< ADC INTSET: FIFOOVR2 (Bitfield-Mask: 0x01)            */
#define ADC_INTSET_FIFOOVR1_Pos           (2UL)                     /*!< ADC INTSET: FIFOOVR1 (Bit 2)                          */
#define ADC_INTSET_FIFOOVR1_Msk           (0x4UL)                   /*!< ADC INTSET: FIFOOVR1 (Bitfield-Mask: 0x01)            */
#define ADC_INTSET_SCNCMP_Pos             (1UL)                     /*!< ADC INTSET: SCNCMP (Bit 1)                            */
#define ADC_INTSET_SCNCMP_Msk             (0x2UL)                   /*!< ADC INTSET: SCNCMP (Bitfield-Mask: 0x01)              */
#define ADC_INTSET_CNVCMP_Pos             (0UL)                     /*!< ADC INTSET: CNVCMP (Bit 0)                            */
#define ADC_INTSET_CNVCMP_Msk             (0x1UL)                   /*!< ADC INTSET: CNVCMP (Bitfield-Mask: 0x01)              */
/* =======================================================  DMATRIGEN  ======================================================= */
#define ADC_DMATRIGEN_DFIFOFULL_Pos       (1UL)                     /*!< ADC DMATRIGEN: DFIFOFULL (Bit 1)                      */
#define ADC_DMATRIGEN_DFIFOFULL_Msk       (0x2UL)                   /*!< ADC DMATRIGEN: DFIFOFULL (Bitfield-Mask: 0x01)        */
#define ADC_DMATRIGEN_DFIFO75_Pos         (0UL)                     /*!< ADC DMATRIGEN: DFIFO75 (Bit 0)                        */
#define ADC_DMATRIGEN_DFIFO75_Msk         (0x1UL)                   /*!< ADC DMATRIGEN: DFIFO75 (Bitfield-Mask: 0x01)          */
/* ======================================================  DMATRIGSTAT  ====================================================== */
#define ADC_DMATRIGSTAT_DFULLSTAT_Pos     (1UL)                     /*!< ADC DMATRIGSTAT: DFULLSTAT (Bit 1)                    */
#define ADC_DMATRIGSTAT_DFULLSTAT_Msk     (0x2UL)                   /*!< ADC DMATRIGSTAT: DFULLSTAT (Bitfield-Mask: 0x01)      */
#define ADC_DMATRIGSTAT_D75STAT_Pos       (0UL)                     /*!< ADC DMATRIGSTAT: D75STAT (Bit 0)                      */
#define ADC_DMATRIGSTAT_D75STAT_Msk       (0x1UL)                   /*!< ADC DMATRIGSTAT: D75STAT (Bitfield-Mask: 0x01)        */
/* ========================================================  DMACFG  ========================================================= */
#define ADC_DMACFG_DPWROFF_Pos            (18UL)                    /*!< ADC DMACFG: DPWROFF (Bit 18)                          */
#define ADC_DMACFG_DPWROFF_Msk            (0x40000UL)               /*!< ADC DMACFG: DPWROFF (Bitfield-Mask: 0x01)             */
#define ADC_DMACFG_DMAMSK_Pos             (17UL)                    /*!< ADC DMACFG: DMAMSK (Bit 17)                           */
#define ADC_DMACFG_DMAMSK_Msk             (0x20000UL)               /*!< ADC DMACFG: DMAMSK (Bitfield-Mask: 0x01)              */
#define ADC_DMACFG_DMAHONSTAT_Pos         (16UL)                    /*!< ADC DMACFG: DMAHONSTAT (Bit 16)                       */
#define ADC_DMACFG_DMAHONSTAT_Msk         (0x10000UL)               /*!< ADC DMACFG: DMAHONSTAT (Bitfield-Mask: 0x01)          */
#define ADC_DMACFG_DMADYNPRI_Pos          (9UL)                     /*!< ADC DMACFG: DMADYNPRI (Bit 9)                         */
#define ADC_DMACFG_DMADYNPRI_Msk          (0x200UL)                 /*!< ADC DMACFG: DMADYNPRI (Bitfield-Mask: 0x01)           */
#define ADC_DMACFG_DMAPRI_Pos             (8UL)                     /*!< ADC DMACFG: DMAPRI (Bit 8)                            */
#define ADC_DMACFG_DMAPRI_Msk             (0x100UL)                 /*!< ADC DMACFG: DMAPRI (Bitfield-Mask: 0x01)              */
#define ADC_DMACFG_DMADIR_Pos             (2UL)                     /*!< ADC DMACFG: DMADIR (Bit 2)                            */
#define ADC_DMACFG_DMADIR_Msk             (0x4UL)                   /*!< ADC DMACFG: DMADIR (Bitfield-Mask: 0x01)              */
#define ADC_DMACFG_DMAEN_Pos              (0UL)                     /*!< ADC DMACFG: DMAEN (Bit 0)                             */
#define ADC_DMACFG_DMAEN_Msk              (0x1UL)                   /*!< ADC DMACFG: DMAEN (Bitfield-Mask: 0x01)               */
/* ======================================================  DMATOTCOUNT  ====================================================== */
#define ADC_DMATOTCOUNT_TOTCOUNT_Pos      (2UL)                     /*!< ADC DMATOTCOUNT: TOTCOUNT (Bit 2)                     */
#define ADC_DMATOTCOUNT_TOTCOUNT_Msk      (0x3fffcUL)               /*!< ADC DMATOTCOUNT: TOTCOUNT (Bitfield-Mask: 0xffff)     */
/* ======================================================  DMATARGADDR  ====================================================== */
#define ADC_DMATARGADDR_UTARGADDR_Pos     (19UL)                    /*!< ADC DMATARGADDR: UTARGADDR (Bit 19)                   */
#define ADC_DMATARGADDR_UTARGADDR_Msk     (0xfff80000UL)            /*!< ADC DMATARGADDR: UTARGADDR (Bitfield-Mask: 0x1fff)    */
#define ADC_DMATARGADDR_LTARGADDR_Pos     (0UL)                     /*!< ADC DMATARGADDR: LTARGADDR (Bit 0)                    */
#define ADC_DMATARGADDR_LTARGADDR_Msk     (0x7ffffUL)               /*!< ADC DMATARGADDR: LTARGADDR (Bitfield-Mask: 0x7ffff)   */
/* ========================================================  DMASTAT  ======================================================== */
#define ADC_DMASTAT_DMAERR_Pos            (2UL)                     /*!< ADC DMASTAT: DMAERR (Bit 2)                           */
#define ADC_DMASTAT_DMAERR_Msk            (0x4UL)                   /*!< ADC DMASTAT: DMAERR (Bitfield-Mask: 0x01)             */
#define ADC_DMASTAT_DMACPL_Pos            (1UL)                     /*!< ADC DMASTAT: DMACPL (Bit 1)                           */
#define ADC_DMASTAT_DMACPL_Msk            (0x2UL)                   /*!< ADC DMASTAT: DMACPL (Bitfield-Mask: 0x01)             */
#define ADC_DMASTAT_DMATIP_Pos            (0UL)                     /*!< ADC DMASTAT: DMATIP (Bit 0)                           */
#define ADC_DMASTAT_DMATIP_Msk            (0x1UL)                   /*!< ADC DMASTAT: DMATIP (Bitfield-Mask: 0x01)             */


/* =========================================================================================================================== */
/* ================                                          APBDMA                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  BBVALUE  ======================================================== */
#define APBDMA_BBVALUE_PIN_Pos            (16UL)                    /*!< APBDMA BBVALUE: PIN (Bit 16)                          */
#define APBDMA_BBVALUE_PIN_Msk            (0xff0000UL)              /*!< APBDMA BBVALUE: PIN (Bitfield-Mask: 0xff)             */
#define APBDMA_BBVALUE_DATAOUT_Pos        (0UL)                     /*!< APBDMA BBVALUE: DATAOUT (Bit 0)                       */
#define APBDMA_BBVALUE_DATAOUT_Msk        (0xffUL)                  /*!< APBDMA BBVALUE: DATAOUT (Bitfield-Mask: 0xff)         */
/* ======================================================  BBSETCLEAR  ======================================================= */
#define APBDMA_BBSETCLEAR_CLEAR_Pos       (16UL)                    /*!< APBDMA BBSETCLEAR: CLEAR (Bit 16)                     */
#define APBDMA_BBSETCLEAR_CLEAR_Msk       (0xff0000UL)              /*!< APBDMA BBSETCLEAR: CLEAR (Bitfield-Mask: 0xff)        */
#define APBDMA_BBSETCLEAR_SET_Pos         (0UL)                     /*!< APBDMA BBSETCLEAR: SET (Bit 0)                        */
#define APBDMA_BBSETCLEAR_SET_Msk         (0xffUL)                  /*!< APBDMA BBSETCLEAR: SET (Bitfield-Mask: 0xff)          */
/* ========================================================  BBINPUT  ======================================================== */
#define APBDMA_BBINPUT_DATAIN_Pos         (0UL)                     /*!< APBDMA BBINPUT: DATAIN (Bit 0)                        */
#define APBDMA_BBINPUT_DATAIN_Msk         (0xffUL)                  /*!< APBDMA BBINPUT: DATAIN (Bitfield-Mask: 0xff)          */
/* =======================================================  DEBUGDATA  ======================================================= */
#define APBDMA_DEBUGDATA_DEBUGDATA_Pos    (0UL)                     /*!< APBDMA DEBUGDATA: DEBUGDATA (Bit 0)                   */
#define APBDMA_DEBUGDATA_DEBUGDATA_Msk    (0xffffffffUL)            /*!< APBDMA DEBUGDATA: DEBUGDATA (Bitfield-Mask: 0xffffffff) */
/* =========================================================  DEBUG  ========================================================= */
#define APBDMA_DEBUG_DEBUGEN_Pos          (0UL)                     /*!< APBDMA DEBUG: DEBUGEN (Bit 0)                         */
#define APBDMA_DEBUG_DEBUGEN_Msk          (0xfUL)                   /*!< APBDMA DEBUG: DEBUGEN (Bitfield-Mask: 0x0f)           */


/* =========================================================================================================================== */
/* ================                                           BLEIF                                           ================ */
/* =========================================================================================================================== */

