tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* =========================================================  FIFO  ========================================================== */
#define BLEIF_FIFO_FIFO_Pos               (0UL)                     /*!< BLEIF FIFO: FIFO (Bit 0)                              */
#define BLEIF_FIFO_FIFO_Msk               (0xffffffffUL)            /*!< BLEIF FIFO: FIFO (Bitfield-Mask: 0xffffffff)          */
/* ========================================================  FIFOPTR  ======================================================== */
#define BLEIF_FIFOPTR_FIFO1REM_Pos        (24UL)                    /*!< BLEIF FIFOPTR: FIFO1REM (Bit 24)                      */
#define BLEIF_FIFOPTR_FIFO1REM_Msk        (0xff000000UL)            /*!< BLEIF FIFOPTR: FIFO1REM (Bitfield-Mask: 0xff)         */
#define BLEIF_FIFOPTR_FIFO1SIZ_Pos        (16UL)                    /*!< BLEIF FIFOPTR: FIFO1SIZ (Bit 16)                      */
#define BLEIF_FIFOPTR_FIFO1SIZ_Msk        (0xff0000UL)              /*!< BLEIF FIFOPTR: FIFO1SIZ (Bitfield-Mask: 0xff)         */
#define BLEIF_FIFOPTR_FIFO0REM_Pos        (8UL)                     /*!< BLEIF FIFOPTR: FIFO0REM (Bit 8)                       */
#define BLEIF_FIFOPTR_FIFO0REM_Msk        (0xff00UL)                /*!< BLEIF FIFOPTR: FIFO0REM (Bitfield-Mask: 0xff)         */
#define BLEIF_FIFOPTR_FIFO0SIZ_Pos        (0UL)                     /*!< BLEIF FIFOPTR: FIFO0SIZ (Bit 0)                       */
#define BLEIF_FIFOPTR_FIFO0SIZ_Msk        (0xffUL)                  /*!< BLEIF FIFOPTR: FIFO0SIZ (Bitfield-Mask: 0xff)         */
/* ========================================================  FIFOTHR  ======================================================== */
#define BLEIF_FIFOTHR_FIFOWTHR_Pos        (8UL)                     /*!< BLEIF FIFOTHR: FIFOWTHR (Bit 8)                       */
#define BLEIF_FIFOTHR_FIFOWTHR_Msk        (0x3f00UL)                /*!< BLEIF FIFOTHR: FIFOWTHR (Bitfield-Mask: 0x3f)         */
#define BLEIF_FIFOTHR_FIFORTHR_Pos        (0UL)                     /*!< BLEIF FIFOTHR: FIFORTHR (Bit 0)                       */
#define BLEIF_FIFOTHR_FIFORTHR_Msk        (0x3fUL)                  /*!< BLEIF FIFOTHR: FIFORTHR (Bitfield-Mask: 0x3f)         */
/* ========================================================  FIFOPOP  ======================================================== */
#define BLEIF_FIFOPOP_FIFODOUT_Pos        (0UL)                     /*!< BLEIF FIFOPOP: FIFODOUT (Bit 0)                       */
#define BLEIF_FIFOPOP_FIFODOUT_Msk        (0xffffffffUL)            /*!< BLEIF FIFOPOP: FIFODOUT (Bitfield-Mask: 0xffffffff)   */
/* =======================================================  FIFOPUSH  ======================================================== */
#define BLEIF_FIFOPUSH_FIFODIN_Pos        (0UL)                     /*!< BLEIF FIFOPUSH: FIFODIN (Bit 0)                       */
#define BLEIF_FIFOPUSH_FIFODIN_Msk        (0xffffffffUL)            /*!< BLEIF FIFOPUSH: FIFODIN (Bitfield-Mask: 0xffffffff)   */
/* =======================================================  FIFOCTRL  ======================================================== */
#define BLEIF_FIFOCTRL_FIFORSTN_Pos       (1UL)                     /*!< BLEIF FIFOCTRL: FIFORSTN (Bit 1)                      */
#define BLEIF_FIFOCTRL_FIFORSTN_Msk       (0x2UL)                   /*!< BLEIF FIFOCTRL: FIFORSTN (Bitfield-Mask: 0x01)        */
#define BLEIF_FIFOCTRL_POPWR_Pos          (0UL)                     /*!< BLEIF FIFOCTRL: POPWR (Bit 0)                         */
#define BLEIF_FIFOCTRL_POPWR_Msk          (0x1UL)                   /*!< BLEIF FIFOCTRL: POPWR (Bitfield-Mask: 0x01)           */
/* ========================================================  FIFOLOC  ======================================================== */
#define BLEIF_FIFOLOC_FIFORPTR_Pos        (8UL)                     /*!< BLEIF FIFOLOC: FIFORPTR (Bit 8)                       */
#define BLEIF_FIFOLOC_FIFORPTR_Msk        (0xf00UL)                 /*!< BLEIF FIFOLOC: FIFORPTR (Bitfield-Mask: 0x0f)         */
#define BLEIF_FIFOLOC_FIFOWPTR_Pos        (0UL)                     /*!< BLEIF FIFOLOC: FIFOWPTR (Bit 0)                       */
#define BLEIF_FIFOLOC_FIFOWPTR_Msk        (0xfUL)                   /*!< BLEIF FIFOLOC: FIFOWPTR (Bitfield-Mask: 0x0f)         */
/* ========================================================  CLKCFG  ========================================================= */
#define BLEIF_CLKCFG_DIV3_Pos             (12UL)                    /*!< BLEIF CLKCFG: DIV3 (Bit 12)                           */
#define BLEIF_CLKCFG_DIV3_Msk             (0x1000UL)                /*!< BLEIF CLKCFG: DIV3 (Bitfield-Mask: 0x01)              */
#define BLEIF_CLKCFG_CLK32KEN_Pos         (11UL)                    /*!< BLEIF CLKCFG: CLK32KEN (Bit 11)                       */
#define BLEIF_CLKCFG_CLK32KEN_Msk         (0x800UL)                 /*!< BLEIF CLKCFG: CLK32KEN (Bitfield-Mask: 0x01)          */
#define BLEIF_CLKCFG_FSEL_Pos             (8UL)                     /*!< BLEIF CLKCFG: FSEL (Bit 8)                            */
#define BLEIF_CLKCFG_FSEL_Msk             (0x700UL)                 /*!< BLEIF CLKCFG: FSEL (Bitfield-Mask: 0x07)              */
#define BLEIF_CLKCFG_IOCLKEN_Pos          (0UL)                     /*!< BLEIF CLKCFG: IOCLKEN (Bit 0)                         */
#define BLEIF_CLKCFG_IOCLKEN_Msk          (0x1UL)                   /*!< BLEIF CLKCFG: IOCLKEN (Bitfield-Mask: 0x01)           */
/* ==========================================================  CMD  ========================================================== */
#define BLEIF_CMD_OFFSETLO_Pos            (24UL)                    /*!< BLEIF CMD: OFFSETLO (Bit 24)                          */
#define BLEIF_CMD_OFFSETLO_Msk            (0xff000000UL)            /*!< BLEIF CMD: OFFSETLO (Bitfield-Mask: 0xff)             */
#define BLEIF_CMD_CMDSEL_Pos              (20UL)                    /*!< BLEIF CMD: CMDSEL (Bit 20)                            */
#define BLEIF_CMD_CMDSEL_Msk              (0x300000UL)              /*!< BLEIF CMD: CMDSEL (Bitfield-Mask: 0x03)               */
#define BLEIF_CMD_TSIZE_Pos               (8UL)                     /*!< BLEIF CMD: TSIZE (Bit 8)                              */
#define BLEIF_CMD_TSIZE_Msk               (0xfff00UL)               /*!< BLEIF CMD: TSIZE (Bitfield-Mask: 0xfff)               */
#define BLEIF_CMD_CONT_Pos                (7UL)                     /*!< BLEIF CMD: CONT (Bit 7)                               */
#define BLEIF_CMD_CONT_Msk                (0x80UL)                  /*!< BLEIF CMD: CONT (Bitfield-Mask: 0x01)                 */
#define BLEIF_CMD_OFFSETCNT_Pos           (5UL)                     /*!< BLEIF CMD: OFFSETCNT (Bit 5)                          */
#define BLEIF_CMD_OFFSETCNT_Msk           (0x60UL)                  /*!< BLEIF CMD: OFFSETCNT (Bitfield-Mask: 0x03)            */
#define BLEIF_CMD_CMD_Pos                 (0UL)                     /*!< BLEIF CMD: CMD (Bit 0)                                */
#define BLEIF_CMD_CMD_Msk                 (0x1fUL)                  /*!< BLEIF CMD: CMD (Bitfield-Mask: 0x1f)                  */
/* ========================================================  CMDRPT  ========================================================= */
#define BLEIF_CMDRPT_CMDRPT_Pos           (0UL)                     /*!< BLEIF CMDRPT: CMDRPT (Bit 0)                          */
#define BLEIF_CMDRPT_CMDRPT_Msk           (0x1fUL)                  /*!< BLEIF CMDRPT: CMDRPT (Bitfield-Mask: 0x1f)            */
/* =======================================================  OFFSETHI  ======================================================== */
#define BLEIF_OFFSETHI_OFFSETHI_Pos       (0UL)                     /*!< BLEIF OFFSETHI: OFFSETHI (Bit 0)                      */
#define BLEIF_OFFSETHI_OFFSETHI_Msk       (0xffffUL)                /*!< BLEIF OFFSETHI: OFFSETHI (Bitfield-Mask: 0xffff)      */
/* ========================================================  CMDSTAT  ======================================================== */
#define BLEIF_CMDSTAT_CTSIZE_Pos          (8UL)                     /*!< BLEIF CMDSTAT: CTSIZE (Bit 8)                         */
#define BLEIF_CMDSTAT_CTSIZE_Msk          (0xfff00UL)               /*!< BLEIF CMDSTAT: CTSIZE (Bitfield-Mask: 0xfff)          */
#define BLEIF_CMDSTAT_CMDSTAT_Pos         (5UL)                     /*!< BLEIF CMDSTAT: CMDSTAT (Bit 5)                        */
#define BLEIF_CMDSTAT_CMDSTAT_Msk         (0xe0UL)                  /*!< BLEIF CMDSTAT: CMDSTAT (Bitfield-Mask: 0x07)          */
#define BLEIF_CMDSTAT_CCMD_Pos            (0UL)                     /*!< BLEIF CMDSTAT: CCMD (Bit 0)                           */
#define BLEIF_CMDSTAT_CCMD_Msk            (0x1fUL)                  /*!< BLEIF CMDSTAT: CCMD (Bitfield-Mask: 0x1f)             */
/* =========================================================  INTEN  ========================================================= */
#define BLEIF_INTEN_B2MSHUTDN_Pos         (16UL)                    /*!< BLEIF INTEN: B2MSHUTDN (Bit 16)                       */
#define BLEIF_INTEN_B2MSHUTDN_Msk         (0x10000UL)               /*!< BLEIF INTEN: B2MSHUTDN (Bitfield-Mask: 0x01)          */
#define BLEIF_INTEN_B2MACTIVE_Pos         (15UL)                    /*!< BLEIF INTEN: B2MACTIVE (Bit 15)                       */
#define BLEIF_INTEN_B2MACTIVE_Msk         (0x8000UL)                /*!< BLEIF INTEN: B2MACTIVE (Bitfield-Mask: 0x01)          */
#define BLEIF_INTEN_B2MSLEEP_Pos          (14UL)                    /*!< BLEIF INTEN: B2MSLEEP (Bit 14)                        */
#define BLEIF_INTEN_B2MSLEEP_Msk          (0x4000UL)                /*!< BLEIF INTEN: B2MSLEEP (Bitfield-Mask: 0x01)           */
#define BLEIF_INTEN_CQERR_Pos             (13UL)                    /*!< BLEIF INTEN: CQERR (Bit 13)                           */
#define BLEIF_INTEN_CQERR_Msk             (0x2000UL)                /*!< BLEIF INTEN: CQERR (Bitfield-Mask: 0x01)              */
#define BLEIF_INTEN_CQUPD_Pos             (12UL)                    /*!< BLEIF INTEN: CQUPD (Bit 12)                           */
#define BLEIF_INTEN_CQUPD_Msk             (0x1000UL)                /*!< BLEIF INTEN: CQUPD (Bitfield-Mask: 0x01)              */
#define BLEIF_INTEN_CQPAUSED_Pos          (11UL)                    /*!< BLEIF INTEN: CQPAUSED (Bit 11)                        */
#define BLEIF_INTEN_CQPAUSED_Msk          (0x800UL)                 /*!< BLEIF INTEN: CQPAUSED (Bitfield-Mask: 0x01)           */
#define BLEIF_INTEN_DERR_Pos              (10UL)                    /*!< BLEIF INTEN: DERR (Bit 10)                            */
#define BLEIF_INTEN_DERR_Msk              (0x400UL)                 /*!< BLEIF INTEN: DERR (Bitfield-Mask: 0x01)               */
#define BLEIF_INTEN_DCMP_Pos              (9UL)                     /*!< BLEIF INTEN: DCMP (Bit 9)                             */
#define BLEIF_INTEN_DCMP_Msk              (0x200UL)                 /*!< BLEIF INTEN: DCMP (Bitfield-Mask: 0x01)               */
#define BLEIF_INTEN_BLECSSTAT_Pos         (8UL)                     /*!< BLEIF INTEN: BLECSSTAT (Bit 8)                        */
#define BLEIF_INTEN_BLECSSTAT_Msk         (0x100UL)                 /*!< BLEIF INTEN: BLECSSTAT (Bitfield-Mask: 0x01)          */
#define BLEIF_INTEN_BLECIRQ_Pos           (7UL)                     /*!< BLEIF INTEN: BLECIRQ (Bit 7)                          */
#define BLEIF_INTEN_BLECIRQ_Msk           (0x80UL)                  /*!< BLEIF INTEN: BLECIRQ (Bitfield-Mask: 0x01)            */
#define BLEIF_INTEN_ICMD_Pos              (6UL)                     /*!< BLEIF INTEN: ICMD (Bit 6)                             */
#define BLEIF_INTEN_ICMD_Msk              (0x40UL)                  /*!< BLEIF INTEN: ICMD (Bitfield-Mask: 0x01)               */
#define BLEIF_INTEN_IACC_Pos              (5UL)                     /*!< BLEIF INTEN: IACC (Bit 5)                             */
#define BLEIF_INTEN_IACC_Msk              (0x20UL)                  /*!< BLEIF INTEN: IACC (Bitfield-Mask: 0x01)               */
#define BLEIF_INTEN_B2MST_Pos             (4UL)                     /*!< BLEIF INTEN: B2MST (Bit 4)                            */
#define BLEIF_INTEN_B2MST_Msk             (0x10UL)                  /*!< BLEIF INTEN: B2MST (Bitfield-Mask: 0x01)              */
#define BLEIF_INTEN_FOVFL_Pos             (3UL)                     /*!< BLEIF INTEN: FOVFL (Bit 3)                            */
#define BLEIF_INTEN_FOVFL_Msk             (0x8UL)                   /*!< BLEIF INTEN: FOVFL (Bitfield-Mask: 0x01)              */
#define BLEIF_INTEN_FUNDFL_Pos            (2UL)                     /*!< BLEIF INTEN: FUNDFL (Bit 2)                           */
#define BLEIF_INTEN_FUNDFL_Msk            (0x4UL)                   /*!< BLEIF INTEN: FUNDFL (Bitfield-Mask: 0x01)             */
#define BLEIF_INTEN_THR_Pos               (1UL)                     /*!< BLEIF INTEN: THR (Bit 1)                              */
#define BLEIF_INTEN_THR_Msk               (0x2UL)                   /*!< BLEIF INTEN: THR (Bitfield-Mask: 0x01)                */
#define BLEIF_INTEN_CMDCMP_Pos            (0UL)                     /*!< BLEIF INTEN: CMDCMP (Bit 0)                           */
#define BLEIF_INTEN_CMDCMP_Msk            (0x1UL)                   /*!< BLEIF INTEN: CMDCMP (Bitfield-Mask: 0x01)             */
/* ========================================================  INTSTAT  ======================================================== */
#define BLEIF_INTSTAT_B2MSHUTDN_Pos       (16UL)                    /*!< BLEIF INTSTAT: B2MSHUTDN (Bit 16)                     */
#define BLEIF_INTSTAT_B2MSHUTDN_Msk       (0x10000UL)               /*!< BLEIF INTSTAT: B2MSHUTDN (Bitfield-Mask: 0x01)        */
#define BLEIF_INTSTAT_B2MACTIVE_Pos       (15UL)                    /*!< BLEIF INTSTAT: B2MACTIVE (Bit 15)                     */
#define BLEIF_INTSTAT_B2MACTIVE_Msk       (0x8000UL)                /*!< BLEIF INTSTAT: B2MACTIVE (Bitfield-Mask: 0x01)        */
#define BLEIF_INTSTAT_B2MSLEEP_Pos        (14UL)                    /*!< BLEIF INTSTAT: B2MSLEEP (Bit 14)                      */
#define BLEIF_INTSTAT_B2MSLEEP_Msk        (0x4000UL)                /*!< BLEIF INTSTAT: B2MSLEEP (Bitfield-Mask: 0x01)         */
#define BLEIF_INTSTAT_CQERR_Pos           (13UL)                    /*!< BLEIF INTSTAT: CQERR (Bit 13)                         */
#define BLEIF_INTSTAT_CQERR_Msk           (0x2000UL)                /*!< BLEIF INTSTAT: CQERR (Bitfield-Mask: 0x01)            */
#define BLEIF_INTSTAT_CQUPD_Pos           (12UL)                    /*!< BLEIF INTSTAT: CQUPD (Bit 12)                         */
#define BLEIF_INTSTAT_CQUPD_Msk           (0x1000UL)                /*!< BLEIF INTSTAT: CQUPD (Bitfield-Mask: 0x01)            */
#define BLEIF_INTSTAT_CQPAUSED_Pos        (11UL)                    /*!< BLEIF INTSTAT: CQPAUSED (Bit 11)                      */
#define BLEIF_INTSTAT_CQPAUSED_Msk        (0x800UL)                 /*!< BLEIF INTSTAT: CQPAUSED (Bitfield-Mask: 0x01)         */
#define BLEIF_INTSTAT_DERR_Pos            (10UL)                    /*!< BLEIF INTSTAT: DERR (Bit 10)                          */
#define BLEIF_INTSTAT_DERR_Msk            (0x400UL)                 /*!< BLEIF INTSTAT: DERR (Bitfield-Mask: 0x01)             */
#define BLEIF_INTSTAT_DCMP_Pos            (9UL)                     /*!< BLEIF INTSTAT: DCMP (Bit 9)                           */
#define BLEIF_INTSTAT_DCMP_Msk            (0x200UL)                 /*!< BLEIF INTSTAT: DCMP (Bitfield-Mask: 0x01)             */
#define BLEIF_INTSTAT_BLECSSTAT_Pos       (8UL)                     /*!< BLEIF INTSTAT: BLECSSTAT (Bit 8)                      */
#define BLEIF_INTSTAT_BLECSSTAT_Msk       (0x100UL)                 /*!< BLEIF INTSTAT: BLECSSTAT (Bitfield-Mask: 0x01)        */
#define BLEIF_INTSTAT_BLECIRQ_Pos         (7UL)                     /*!< BLEIF INTSTAT: BLECIRQ (Bit 7)                        */
#define BLEIF_INTSTAT_BLECIRQ_Msk         (0x80UL)                  /*!< BLEIF INTSTAT: BLECIRQ (Bitfield-Mask: 0x01)          */
#define BLEIF_INTSTAT_ICMD_Pos            (6UL)                     /*!< BLEIF INTSTAT: ICMD (Bit 6)                           */
#define BLEIF_INTSTAT_ICMD_Msk            (0x40UL)                  /*!< BLEIF INTSTAT: ICMD (Bitfield-Mask: 0x01)             */
#define BLEIF_INTSTAT_IACC_Pos            (5UL)                     /*!< BLEIF INTSTAT: IACC (Bit 5)                           */
#define BLEIF_INTSTAT_IACC_Msk            (0x20UL)                  /*!< BLEIF INTSTAT: IACC (Bitfield-Mask: 0x01)             */
#define BLEIF_INTSTAT_B2MST_Pos           (4UL)                     /*!< BLEIF INTSTAT: B2MST (Bit 4)                          */
#define BLEIF_INTSTAT_B2MST_Msk           (0x10UL)                  /*!< BLEIF INTSTAT: B2MST (Bitfield-Mask: 0x01)            */
#define BLEIF_INTSTAT_FOVFL_Pos           (3UL)                     /*!< BLEIF INTSTAT: FOVFL (Bit 3)                          */
#define BLEIF_INTSTAT_FOVFL_Msk           (0x8UL)                   /*!< BLEIF INTSTAT: FOVFL (Bitfield-Mask: 0x01)            */
#define BLEIF_INTSTAT_FUNDFL_Pos          (2UL)                     /*!< BLEIF INTSTAT: FUNDFL (Bit 2)                         */
#define BLEIF_INTSTAT_FUNDFL_Msk          (0x4UL)                   /*!< BLEIF INTSTAT: FUNDFL (Bitfield-Mask: 0x01)           */
#define BLEIF_INTSTAT_THR_Pos             (1UL)                     /*!< BLEIF INTSTAT: THR (Bit 1)                            */
#define BLEIF_INTSTAT_THR_Msk             (0x2UL)                   /*!< BLEIF INTSTAT: THR (Bitfield-Mask: 0x01)              */
#define BLEIF_INTSTAT_CMDCMP_Pos          (0UL)                     /*!< BLEIF INTSTAT: CMDCMP (Bit 0)                         */
#define BLEIF_INTSTAT_CMDCMP_Msk          (0x1UL)                   /*!< BLEIF INTSTAT: CMDCMP (Bitfield-Mask: 0x01)           */
/* ========================================================  INTCLR  ========================================================= */
#define BLEIF_INTCLR_B2MSHUTDN_Pos        (16UL)                    /*!< BLEIF INTCLR: B2MSHUTDN (Bit 16)                      */
#define BLEIF_INTCLR_B2MSHUTDN_Msk        (0x10000UL)               /*!< BLEIF INTCLR: B2MSHUTDN (Bitfield-Mask: 0x01)         */
#define BLEIF_INTCLR_B2MACTIVE_Pos        (15UL)                    /*!< BLEIF INTCLR: B2MACTIVE (Bit 15)                      */
#define BLEIF_INTCLR_B2MACTIVE_Msk        (0x8000UL)                /*!< BLEIF INTCLR: B2MACTIVE (Bitfield-Mask: 0x01)         */
#define BLEIF_INTCLR_B2MSLEEP_Pos         (14UL)                    /*!< BLEIF INTCLR: B2MSLEEP (Bit 14)                       */
#define BLEIF_INTCLR_B2MSLEEP_Msk         (0x4000UL)                /*!< BLEIF INTCLR: B2MSLEEP (Bitfield-Mask: 0x01)          */
#define BLEIF_INTCLR_CQERR_Pos            (13UL)                    /*!< BLEIF INTCLR: CQERR (Bit 13)                          */
#define BLEIF_INTCLR_CQERR_Msk            (0x2000UL)                /*!< BLEIF INTCLR: CQERR (Bitfield-Mask: 0x01)             */
#define BLEIF_INTCLR_CQUPD_Pos            (12UL)                    /*!< BLEIF INTCLR: CQUPD (Bit 12)                          */
#define BLEIF_INTCLR_CQUPD_Msk            (0x1000UL)                /*!< BLEIF INTCLR: CQUPD (Bitfield-Mask: 0x01)             */
#define BLEIF_INTCLR_CQPAUSED_Pos         (11UL)                    /*!< BLEIF INTCLR: CQPAUSED (Bit 11)                       */
#define BLEIF_INTCLR_CQPAUSED_Msk         (0x800UL)                 /*!< BLEIF INTCLR: CQPAUSED (Bitfield-Mask: 0x01)          */
#define BLEIF_INTCLR_DERR_Pos             (10UL)                    /*!< BLEIF INTCLR: DERR (Bit 10)                           */
#define BLEIF_INTCLR_DERR_Msk             (0x400UL)                 /*!< BLEIF INTCLR: DERR (Bitfield-Mask: 0x01)              */
#define BLEIF_INTCLR_DCMP_Pos             (9UL)                     /*!< BLEIF INTCLR: DCMP (Bit 9)                            */
#define BLEIF_INTCLR_DCMP_Msk             (0x200UL)                 /*!< BLEIF INTCLR: DCMP (Bitfield-Mask: 0x01)              */
#define BLEIF_INTCLR_BLECSSTAT_Pos        (8UL)                     /*!< BLEIF INTCLR: BLECSSTAT (Bit 8)                       */
#define BLEIF_INTCLR_BLECSSTAT_Msk        (0x100UL)                 /*!< BLEIF INTCLR: BLECSSTAT (Bitfield-Mask: 0x01)         */
#define BLEIF_INTCLR_BLECIRQ_Pos          (7UL)                     /*!< BLEIF INTCLR: BLECIRQ (Bit 7)                         */
#define BLEIF_INTCLR_BLECIRQ_Msk          (0x80UL)                  /*!< BLEIF INTCLR: BLECIRQ (Bitfield-Mask: 0x01)           */
#define BLEIF_INTCLR_ICMD_Pos             (6UL)                     /*!< BLEIF INTCLR: ICMD (Bit 6)                            */
#define BLEIF_INTCLR_ICMD_Msk             (0x40UL)                  /*!< BLEIF INTCLR: ICMD (Bitfield-Mask: 0x01)              */
#define BLEIF_INTCLR_IACC_Pos             (5UL)                     /*!< BLEIF INTCLR: IACC (Bit 5)                            */
#define BLEIF_INTCLR_IACC_Msk             (0x20UL)                  /*!< BLEIF INTCLR: IACC (Bitfield-Mask: 0x01)              */
#define BLEIF_INTCLR_B2MST_Pos            (4UL)                     /*!< BLEIF INTCLR: B2MST (Bit 4)                           */
#define BLEIF_INTCLR_B2MST_Msk            (0x10UL)                  /*!< BLEIF INTCLR: B2MST (Bitfield-Mask: 0x01)             */
#define BLEIF_INTCLR_FOVFL_Pos            (3UL)                     /*!< BLEIF INTCLR: FOVFL (Bit 3)                           */
#define BLEIF_INTCLR_FOVFL_Msk            (0x8UL)                   /*!< BLEIF INTCLR: FOVFL (Bitfield-Mask: 0x01)             */
#define BLEIF_INTCLR_FUNDFL_Pos           (2UL)                     /*!< BLEIF INTCLR: FUNDFL (Bit 2)                          */
#define BLEIF_INTCLR_FUNDFL_Msk           (0x4UL)                   /*!< BLEIF INTCLR: FUNDFL (Bitfield-Mask: 0x01)            */
#define BLEIF_INTCLR_THR_Pos              (1UL)                     /*!< BLEIF INTCLR: THR (Bit 1)                             */
#define BLEIF_INTCLR_THR_Msk              (0x2UL)                   /*!< BLEIF INTCLR: THR (Bitfield-Mask: 0x01)               */
#define BLEIF_INTCLR_CMDCMP_Pos           (0UL)                     /*!< BLEIF INTCLR: CMDCMP (Bit 0)                          */
#define BLEIF_INTCLR_CMDCMP_Msk           (0x1UL)                   /*!< BLEIF INTCLR: CMDCMP (Bitfield-Mask: 0x01)            */
/* ========================================================  INTSET  ========================================================= */
#define BLEIF_INTSET_B2MSHUTDN_Pos        (16UL)                    /*!< BLEIF INTSET: B2MSHUTDN (Bit 16)                      */
#define BLEIF_INTSET_B2MSHUTDN_Msk        (0x10000UL)               /*!< BLEIF INTSET: B2MSHUTDN (Bitfield-Mask: 0x01)         */
#define BLEIF_INTSET_B2MACTIVE_Pos        (15UL)                    /*!< BLEIF INTSET: B2MACTIVE (Bit 15)                      */
#define BLEIF_INTSET_B2MACTIVE_Msk        (0x8000UL)                /*!< BLEIF INTSET: B2MACTIVE (Bitfield-Mask: 0x01)         */
#define BLEIF_INTSET_B2MSLEEP_Pos         (14UL)                    /*!< BLEIF INTSET: B2MSLEEP (Bit 14)                       */
#define BLEIF_INTSET_B2MSLEEP_Msk         (0x4000UL)                /*!< BLEIF INTSET: B2MSLEEP (Bitfield-Mask: 0x01)          */
#define BLEIF_INTSET_CQERR_Pos            (13UL)                    /*!< BLEIF INTSET: CQERR (Bit 13)                          */
#define BLEIF_INTSET_CQERR_Msk            (0x2000UL)                /*!< BLEIF INTSET: CQERR (Bitfield-Mask: 0x01)             */
#define BLEIF_INTSET_CQUPD_Pos            (12UL)                    /*!< BLEIF INTSET: CQUPD (Bit 12)                          */
#define BLEIF_INTSET_CQUPD_Msk            (0x1000UL)                /*!< BLEIF INTSET: CQUPD (Bitfield-Mask: 0x01)             */
