tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
#define BLEIF_INTSET_CQPAUSED_Pos         (11UL)                    /*!< BLEIF INTSET: CQPAUSED (Bit 11)                       */
#define BLEIF_INTSET_CQPAUSED_Msk         (0x800UL)                 /*!< BLEIF INTSET: CQPAUSED (Bitfield-Mask: 0x01)          */
#define BLEIF_INTSET_DERR_Pos             (10UL)                    /*!< BLEIF INTSET: DERR (Bit 10)                           */
#define BLEIF_INTSET_DERR_Msk             (0x400UL)                 /*!< BLEIF INTSET: DERR (Bitfield-Mask: 0x01)              */
#define BLEIF_INTSET_DCMP_Pos             (9UL)                     /*!< BLEIF INTSET: DCMP (Bit 9)                            */
#define BLEIF_INTSET_DCMP_Msk             (0x200UL)                 /*!< BLEIF INTSET: DCMP (Bitfield-Mask: 0x01)              */
#define BLEIF_INTSET_BLECSSTAT_Pos        (8UL)                     /*!< BLEIF INTSET: BLECSSTAT (Bit 8)                       */
#define BLEIF_INTSET_BLECSSTAT_Msk        (0x100UL)                 /*!< BLEIF INTSET: BLECSSTAT (Bitfield-Mask: 0x01)         */
#define BLEIF_INTSET_BLECIRQ_Pos          (7UL)                     /*!< BLEIF INTSET: BLECIRQ (Bit 7)                         */
#define BLEIF_INTSET_BLECIRQ_Msk          (0x80UL)                  /*!< BLEIF INTSET: BLECIRQ (Bitfield-Mask: 0x01)           */
#define BLEIF_INTSET_ICMD_Pos             (6UL)                     /*!< BLEIF INTSET: ICMD (Bit 6)                            */
#define BLEIF_INTSET_ICMD_Msk             (0x40UL)                  /*!< BLEIF INTSET: ICMD (Bitfield-Mask: 0x01)              */
#define BLEIF_INTSET_IACC_Pos             (5UL)                     /*!< BLEIF INTSET: IACC (Bit 5)                            */
#define BLEIF_INTSET_IACC_Msk             (0x20UL)                  /*!< BLEIF INTSET: IACC (Bitfield-Mask: 0x01)              */
#define BLEIF_INTSET_B2MST_Pos            (4UL)                     /*!< BLEIF INTSET: B2MST (Bit 4)                           */
#define BLEIF_INTSET_B2MST_Msk            (0x10UL)                  /*!< BLEIF INTSET: B2MST (Bitfield-Mask: 0x01)             */
#define BLEIF_INTSET_FOVFL_Pos            (3UL)                     /*!< BLEIF INTSET: FOVFL (Bit 3)                           */
#define BLEIF_INTSET_FOVFL_Msk            (0x8UL)                   /*!< BLEIF INTSET: FOVFL (Bitfield-Mask: 0x01)             */
#define BLEIF_INTSET_FUNDFL_Pos           (2UL)                     /*!< BLEIF INTSET: FUNDFL (Bit 2)                          */
#define BLEIF_INTSET_FUNDFL_Msk           (0x4UL)                   /*!< BLEIF INTSET: FUNDFL (Bitfield-Mask: 0x01)            */
#define BLEIF_INTSET_THR_Pos              (1UL)                     /*!< BLEIF INTSET: THR (Bit 1)                             */
#define BLEIF_INTSET_THR_Msk              (0x2UL)                   /*!< BLEIF INTSET: THR (Bitfield-Mask: 0x01)               */
#define BLEIF_INTSET_CMDCMP_Pos           (0UL)                     /*!< BLEIF INTSET: CMDCMP (Bit 0)                          */
#define BLEIF_INTSET_CMDCMP_Msk           (0x1UL)                   /*!< BLEIF INTSET: CMDCMP (Bitfield-Mask: 0x01)            */
/* =======================================================  DMATRIGEN  ======================================================= */
#define BLEIF_DMATRIGEN_DTHREN_Pos        (1UL)                     /*!< BLEIF DMATRIGEN: DTHREN (Bit 1)                       */
#define BLEIF_DMATRIGEN_DTHREN_Msk        (0x2UL)                   /*!< BLEIF DMATRIGEN: DTHREN (Bitfield-Mask: 0x01)         */
#define BLEIF_DMATRIGEN_DCMDCMPEN_Pos     (0UL)                     /*!< BLEIF DMATRIGEN: DCMDCMPEN (Bit 0)                    */
#define BLEIF_DMATRIGEN_DCMDCMPEN_Msk     (0x1UL)                   /*!< BLEIF DMATRIGEN: DCMDCMPEN (Bitfield-Mask: 0x01)      */
/* ======================================================  DMATRIGSTAT  ====================================================== */
#define BLEIF_DMATRIGSTAT_DTOTCMP_Pos     (2UL)                     /*!< BLEIF DMATRIGSTAT: DTOTCMP (Bit 2)                    */
#define BLEIF_DMATRIGSTAT_DTOTCMP_Msk     (0x4UL)                   /*!< BLEIF DMATRIGSTAT: DTOTCMP (Bitfield-Mask: 0x01)      */
#define BLEIF_DMATRIGSTAT_DTHR_Pos        (1UL)                     /*!< BLEIF DMATRIGSTAT: DTHR (Bit 1)                       */
#define BLEIF_DMATRIGSTAT_DTHR_Msk        (0x2UL)                   /*!< BLEIF DMATRIGSTAT: DTHR (Bitfield-Mask: 0x01)         */
#define BLEIF_DMATRIGSTAT_DCMDCMP_Pos     (0UL)                     /*!< BLEIF DMATRIGSTAT: DCMDCMP (Bit 0)                    */
#define BLEIF_DMATRIGSTAT_DCMDCMP_Msk     (0x1UL)                   /*!< BLEIF DMATRIGSTAT: DCMDCMP (Bitfield-Mask: 0x01)      */
/* ========================================================  DMACFG  ========================================================= */
#define BLEIF_DMACFG_DPWROFF_Pos          (9UL)                     /*!< BLEIF DMACFG: DPWROFF (Bit 9)                         */
#define BLEIF_DMACFG_DPWROFF_Msk          (0x200UL)                 /*!< BLEIF DMACFG: DPWROFF (Bitfield-Mask: 0x01)           */
#define BLEIF_DMACFG_DMAPRI_Pos           (8UL)                     /*!< BLEIF DMACFG: DMAPRI (Bit 8)                          */
#define BLEIF_DMACFG_DMAPRI_Msk           (0x100UL)                 /*!< BLEIF DMACFG: DMAPRI (Bitfield-Mask: 0x01)            */
#define BLEIF_DMACFG_DMADIR_Pos           (1UL)                     /*!< BLEIF DMACFG: DMADIR (Bit 1)                          */
#define BLEIF_DMACFG_DMADIR_Msk           (0x2UL)                   /*!< BLEIF DMACFG: DMADIR (Bitfield-Mask: 0x01)            */
#define BLEIF_DMACFG_DMAEN_Pos            (0UL)                     /*!< BLEIF DMACFG: DMAEN (Bit 0)                           */
#define BLEIF_DMACFG_DMAEN_Msk            (0x1UL)                   /*!< BLEIF DMACFG: DMAEN (Bitfield-Mask: 0x01)             */
/* ======================================================  DMATOTCOUNT  ====================================================== */
#define BLEIF_DMATOTCOUNT_TOTCOUNT_Pos    (0UL)                     /*!< BLEIF DMATOTCOUNT: TOTCOUNT (Bit 0)                   */
#define BLEIF_DMATOTCOUNT_TOTCOUNT_Msk    (0xfffUL)                 /*!< BLEIF DMATOTCOUNT: TOTCOUNT (Bitfield-Mask: 0xfff)    */
/* ======================================================  DMATARGADDR  ====================================================== */
#define BLEIF_DMATARGADDR_TARGADDR28_Pos  (28UL)                    /*!< BLEIF DMATARGADDR: TARGADDR28 (Bit 28)                */
#define BLEIF_DMATARGADDR_TARGADDR28_Msk  (0x10000000UL)            /*!< BLEIF DMATARGADDR: TARGADDR28 (Bitfield-Mask: 0x01)   */
#define BLEIF_DMATARGADDR_TARGADDR_Pos    (0UL)                     /*!< BLEIF DMATARGADDR: TARGADDR (Bit 0)                   */
#define BLEIF_DMATARGADDR_TARGADDR_Msk    (0xfffffUL)               /*!< BLEIF DMATARGADDR: TARGADDR (Bitfield-Mask: 0xfffff)  */
/* ========================================================  DMASTAT  ======================================================== */
#define BLEIF_DMASTAT_DMAERR_Pos          (2UL)                     /*!< BLEIF DMASTAT: DMAERR (Bit 2)                         */
#define BLEIF_DMASTAT_DMAERR_Msk          (0x4UL)                   /*!< BLEIF DMASTAT: DMAERR (Bitfield-Mask: 0x01)           */
#define BLEIF_DMASTAT_DMACPL_Pos          (1UL)                     /*!< BLEIF DMASTAT: DMACPL (Bit 1)                         */
#define BLEIF_DMASTAT_DMACPL_Msk          (0x2UL)                   /*!< BLEIF DMASTAT: DMACPL (Bitfield-Mask: 0x01)           */
#define BLEIF_DMASTAT_DMATIP_Pos          (0UL)                     /*!< BLEIF DMASTAT: DMATIP (Bit 0)                         */
#define BLEIF_DMASTAT_DMATIP_Msk          (0x1UL)                   /*!< BLEIF DMASTAT: DMATIP (Bitfield-Mask: 0x01)           */
/* =========================================================  CQCFG  ========================================================= */
#define BLEIF_CQCFG_CQPRI_Pos             (1UL)                     /*!< BLEIF CQCFG: CQPRI (Bit 1)                            */
#define BLEIF_CQCFG_CQPRI_Msk             (0x2UL)                   /*!< BLEIF CQCFG: CQPRI (Bitfield-Mask: 0x01)              */
#define BLEIF_CQCFG_CQEN_Pos              (0UL)                     /*!< BLEIF CQCFG: CQEN (Bit 0)                             */
#define BLEIF_CQCFG_CQEN_Msk              (0x1UL)                   /*!< BLEIF CQCFG: CQEN (Bitfield-Mask: 0x01)               */
/* ========================================================  CQADDR  ========================================================= */
#define BLEIF_CQADDR_CQADDR28_Pos         (28UL)                    /*!< BLEIF CQADDR: CQADDR28 (Bit 28)                       */
#define BLEIF_CQADDR_CQADDR28_Msk         (0x10000000UL)            /*!< BLEIF CQADDR: CQADDR28 (Bitfield-Mask: 0x01)          */
#define BLEIF_CQADDR_CQADDR_Pos           (2UL)                     /*!< BLEIF CQADDR: CQADDR (Bit 2)                          */
#define BLEIF_CQADDR_CQADDR_Msk           (0xffffcUL)               /*!< BLEIF CQADDR: CQADDR (Bitfield-Mask: 0x3ffff)         */
/* ========================================================  CQSTAT  ========================================================= */
#define BLEIF_CQSTAT_CQERR_Pos            (2UL)                     /*!< BLEIF CQSTAT: CQERR (Bit 2)                           */
#define BLEIF_CQSTAT_CQERR_Msk            (0x4UL)                   /*!< BLEIF CQSTAT: CQERR (Bitfield-Mask: 0x01)             */
#define BLEIF_CQSTAT_CQPAUSED_Pos         (1UL)                     /*!< BLEIF CQSTAT: CQPAUSED (Bit 1)                        */
#define BLEIF_CQSTAT_CQPAUSED_Msk         (0x2UL)                   /*!< BLEIF CQSTAT: CQPAUSED (Bitfield-Mask: 0x01)          */
#define BLEIF_CQSTAT_CQTIP_Pos            (0UL)                     /*!< BLEIF CQSTAT: CQTIP (Bit 0)                           */
#define BLEIF_CQSTAT_CQTIP_Msk            (0x1UL)                   /*!< BLEIF CQSTAT: CQTIP (Bitfield-Mask: 0x01)             */
/* ========================================================  CQFLAGS  ======================================================== */
#define BLEIF_CQFLAGS_CQIRQMASK_Pos       (16UL)                    /*!< BLEIF CQFLAGS: CQIRQMASK (Bit 16)                     */
#define BLEIF_CQFLAGS_CQIRQMASK_Msk       (0xffff0000UL)            /*!< BLEIF CQFLAGS: CQIRQMASK (Bitfield-Mask: 0xffff)      */
#define BLEIF_CQFLAGS_CQFLAGS_Pos         (0UL)                     /*!< BLEIF CQFLAGS: CQFLAGS (Bit 0)                        */
#define BLEIF_CQFLAGS_CQFLAGS_Msk         (0xffffUL)                /*!< BLEIF CQFLAGS: CQFLAGS (Bitfield-Mask: 0xffff)        */
/* ======================================================  CQSETCLEAR  ======================================================= */
#define BLEIF_CQSETCLEAR_CQFCLR_Pos       (16UL)                    /*!< BLEIF CQSETCLEAR: CQFCLR (Bit 16)                     */
#define BLEIF_CQSETCLEAR_CQFCLR_Msk       (0xff0000UL)              /*!< BLEIF CQSETCLEAR: CQFCLR (Bitfield-Mask: 0xff)        */
#define BLEIF_CQSETCLEAR_CQFTGL_Pos       (8UL)                     /*!< BLEIF CQSETCLEAR: CQFTGL (Bit 8)                      */
#define BLEIF_CQSETCLEAR_CQFTGL_Msk       (0xff00UL)                /*!< BLEIF CQSETCLEAR: CQFTGL (Bitfield-Mask: 0xff)        */
#define BLEIF_CQSETCLEAR_CQFSET_Pos       (0UL)                     /*!< BLEIF CQSETCLEAR: CQFSET (Bit 0)                      */
#define BLEIF_CQSETCLEAR_CQFSET_Msk       (0xffUL)                  /*!< BLEIF CQSETCLEAR: CQFSET (Bitfield-Mask: 0xff)        */
/* =======================================================  CQPAUSEEN  ======================================================= */
#define BLEIF_CQPAUSEEN_CQPEN_Pos         (0UL)                     /*!< BLEIF CQPAUSEEN: CQPEN (Bit 0)                        */
#define BLEIF_CQPAUSEEN_CQPEN_Msk         (0xffffUL)                /*!< BLEIF CQPAUSEEN: CQPEN (Bitfield-Mask: 0xffff)        */
/* =======================================================  CQCURIDX  ======================================================== */
#define BLEIF_CQCURIDX_CQCURIDX_Pos       (0UL)                     /*!< BLEIF CQCURIDX: CQCURIDX (Bit 0)                      */
#define BLEIF_CQCURIDX_CQCURIDX_Msk       (0xffUL)                  /*!< BLEIF CQCURIDX: CQCURIDX (Bitfield-Mask: 0xff)        */
/* =======================================================  CQENDIDX  ======================================================== */
#define BLEIF_CQENDIDX_CQENDIDX_Pos       (0UL)                     /*!< BLEIF CQENDIDX: CQENDIDX (Bit 0)                      */
#define BLEIF_CQENDIDX_CQENDIDX_Msk       (0xffUL)                  /*!< BLEIF CQENDIDX: CQENDIDX (Bitfield-Mask: 0xff)        */
/* ========================================================  STATUS  ========================================================= */
#define BLEIF_STATUS_IDLEST_Pos           (2UL)                     /*!< BLEIF STATUS: IDLEST (Bit 2)                          */
#define BLEIF_STATUS_IDLEST_Msk           (0x4UL)                   /*!< BLEIF STATUS: IDLEST (Bitfield-Mask: 0x01)            */
#define BLEIF_STATUS_CMDACT_Pos           (1UL)                     /*!< BLEIF STATUS: CMDACT (Bit 1)                          */
#define BLEIF_STATUS_CMDACT_Msk           (0x2UL)                   /*!< BLEIF STATUS: CMDACT (Bitfield-Mask: 0x01)            */
#define BLEIF_STATUS_ERR_Pos              (0UL)                     /*!< BLEIF STATUS: ERR (Bit 0)                             */
#define BLEIF_STATUS_ERR_Msk              (0x1UL)                   /*!< BLEIF STATUS: ERR (Bitfield-Mask: 0x01)               */
/* ========================================================  MSPICFG  ======================================================== */
#define BLEIF_MSPICFG_MSPIRST_Pos         (30UL)                    /*!< BLEIF MSPICFG: MSPIRST (Bit 30)                       */
#define BLEIF_MSPICFG_MSPIRST_Msk         (0x40000000UL)            /*!< BLEIF MSPICFG: MSPIRST (Bitfield-Mask: 0x01)          */
#define BLEIF_MSPICFG_DOUTDLY_Pos         (27UL)                    /*!< BLEIF MSPICFG: DOUTDLY (Bit 27)                       */
#define BLEIF_MSPICFG_DOUTDLY_Msk         (0x38000000UL)            /*!< BLEIF MSPICFG: DOUTDLY (Bitfield-Mask: 0x07)          */
#define BLEIF_MSPICFG_DINDLY_Pos          (24UL)                    /*!< BLEIF MSPICFG: DINDLY (Bit 24)                        */
#define BLEIF_MSPICFG_DINDLY_Msk          (0x7000000UL)             /*!< BLEIF MSPICFG: DINDLY (Bitfield-Mask: 0x07)           */
#define BLEIF_MSPICFG_SPILSB_Pos          (23UL)                    /*!< BLEIF MSPICFG: SPILSB (Bit 23)                        */
#define BLEIF_MSPICFG_SPILSB_Msk          (0x800000UL)              /*!< BLEIF MSPICFG: SPILSB (Bitfield-Mask: 0x01)           */
#define BLEIF_MSPICFG_RDFCPOL_Pos         (22UL)                    /*!< BLEIF MSPICFG: RDFCPOL (Bit 22)                       */
#define BLEIF_MSPICFG_RDFCPOL_Msk         (0x400000UL)              /*!< BLEIF MSPICFG: RDFCPOL (Bitfield-Mask: 0x01)          */
#define BLEIF_MSPICFG_WTFCPOL_Pos         (21UL)                    /*!< BLEIF MSPICFG: WTFCPOL (Bit 21)                       */
#define BLEIF_MSPICFG_WTFCPOL_Msk         (0x200000UL)              /*!< BLEIF MSPICFG: WTFCPOL (Bitfield-Mask: 0x01)          */
#define BLEIF_MSPICFG_RDFC_Pos            (17UL)                    /*!< BLEIF MSPICFG: RDFC (Bit 17)                          */
#define BLEIF_MSPICFG_RDFC_Msk            (0x20000UL)               /*!< BLEIF MSPICFG: RDFC (Bitfield-Mask: 0x01)             */
#define BLEIF_MSPICFG_WTFC_Pos            (16UL)                    /*!< BLEIF MSPICFG: WTFC (Bit 16)                          */
#define BLEIF_MSPICFG_WTFC_Msk            (0x10000UL)               /*!< BLEIF MSPICFG: WTFC (Bitfield-Mask: 0x01)             */
#define BLEIF_MSPICFG_FULLDUP_Pos         (2UL)                     /*!< BLEIF MSPICFG: FULLDUP (Bit 2)                        */
#define BLEIF_MSPICFG_FULLDUP_Msk         (0x4UL)                   /*!< BLEIF MSPICFG: FULLDUP (Bitfield-Mask: 0x01)          */
#define BLEIF_MSPICFG_SPHA_Pos            (1UL)                     /*!< BLEIF MSPICFG: SPHA (Bit 1)                           */
#define BLEIF_MSPICFG_SPHA_Msk            (0x2UL)                   /*!< BLEIF MSPICFG: SPHA (Bitfield-Mask: 0x01)             */
#define BLEIF_MSPICFG_SPOL_Pos            (0UL)                     /*!< BLEIF MSPICFG: SPOL (Bit 0)                           */
#define BLEIF_MSPICFG_SPOL_Msk            (0x1UL)                   /*!< BLEIF MSPICFG: SPOL (Bitfield-Mask: 0x01)             */
/* ========================================================  BLECFG  ========================================================= */
#define BLEIF_BLECFG_SPIISOCTL_Pos        (14UL)                    /*!< BLEIF BLECFG: SPIISOCTL (Bit 14)                      */
#define BLEIF_BLECFG_SPIISOCTL_Msk        (0xc000UL)                /*!< BLEIF BLECFG: SPIISOCTL (Bitfield-Mask: 0x03)         */
#define BLEIF_BLECFG_PWRISOCTL_Pos        (12UL)                    /*!< BLEIF BLECFG: PWRISOCTL (Bit 12)                      */
#define BLEIF_BLECFG_PWRISOCTL_Msk        (0x3000UL)                /*!< BLEIF BLECFG: PWRISOCTL (Bitfield-Mask: 0x03)         */
#define BLEIF_BLECFG_STAYASLEEP_Pos       (11UL)                    /*!< BLEIF BLECFG: STAYASLEEP (Bit 11)                     */
#define BLEIF_BLECFG_STAYASLEEP_Msk       (0x800UL)                 /*!< BLEIF BLECFG: STAYASLEEP (Bitfield-Mask: 0x01)        */
#define BLEIF_BLECFG_FRCCLK_Pos           (10UL)                    /*!< BLEIF BLECFG: FRCCLK (Bit 10)                         */
#define BLEIF_BLECFG_FRCCLK_Msk           (0x400UL)                 /*!< BLEIF BLECFG: FRCCLK (Bitfield-Mask: 0x01)            */
#define BLEIF_BLECFG_MCUFRCSLP_Pos        (9UL)                     /*!< BLEIF BLECFG: MCUFRCSLP (Bit 9)                       */
#define BLEIF_BLECFG_MCUFRCSLP_Msk        (0x200UL)                 /*!< BLEIF BLECFG: MCUFRCSLP (Bitfield-Mask: 0x01)         */
#define BLEIF_BLECFG_WT4ACTOFF_Pos        (8UL)                     /*!< BLEIF BLECFG: WT4ACTOFF (Bit 8)                       */
#define BLEIF_BLECFG_WT4ACTOFF_Msk        (0x100UL)                 /*!< BLEIF BLECFG: WT4ACTOFF (Bitfield-Mask: 0x01)         */
#define BLEIF_BLECFG_BLEHREQCTL_Pos       (6UL)                     /*!< BLEIF BLECFG: BLEHREQCTL (Bit 6)                      */
#define BLEIF_BLECFG_BLEHREQCTL_Msk       (0xc0UL)                  /*!< BLEIF BLECFG: BLEHREQCTL (Bitfield-Mask: 0x03)        */
#define BLEIF_BLECFG_DCDCFLGCTL_Pos       (4UL)                     /*!< BLEIF BLECFG: DCDCFLGCTL (Bit 4)                      */
#define BLEIF_BLECFG_DCDCFLGCTL_Msk       (0x30UL)                  /*!< BLEIF BLECFG: DCDCFLGCTL (Bitfield-Mask: 0x03)        */
#define BLEIF_BLECFG_WAKEUPCTL_Pos        (2UL)                     /*!< BLEIF BLECFG: WAKEUPCTL (Bit 2)                       */
#define BLEIF_BLECFG_WAKEUPCTL_Msk        (0xcUL)                   /*!< BLEIF BLECFG: WAKEUPCTL (Bitfield-Mask: 0x03)         */
#define BLEIF_BLECFG_BLERSTN_Pos          (1UL)                     /*!< BLEIF BLECFG: BLERSTN (Bit 1)                         */
#define BLEIF_BLECFG_BLERSTN_Msk          (0x2UL)                   /*!< BLEIF BLECFG: BLERSTN (Bitfield-Mask: 0x01)           */
#define BLEIF_BLECFG_PWRSMEN_Pos          (0UL)                     /*!< BLEIF BLECFG: PWRSMEN (Bit 0)                         */
#define BLEIF_BLECFG_PWRSMEN_Msk          (0x1UL)                   /*!< BLEIF BLECFG: PWRSMEN (Bitfield-Mask: 0x01)           */
/* ========================================================  PWRCMD  ========================================================= */
#define BLEIF_PWRCMD_RESTART_Pos          (1UL)                     /*!< BLEIF PWRCMD: RESTART (Bit 1)                         */
#define BLEIF_PWRCMD_RESTART_Msk          (0x2UL)                   /*!< BLEIF PWRCMD: RESTART (Bitfield-Mask: 0x01)           */
#define BLEIF_PWRCMD_WAKEREQ_Pos          (0UL)                     /*!< BLEIF PWRCMD: WAKEREQ (Bit 0)                         */
#define BLEIF_PWRCMD_WAKEREQ_Msk          (0x1UL)                   /*!< BLEIF PWRCMD: WAKEREQ (Bitfield-Mask: 0x01)           */
/* ========================================================  BSTATUS  ======================================================== */
#define BLEIF_BSTATUS_BLEHREQ_Pos         (12UL)                    /*!< BLEIF BSTATUS: BLEHREQ (Bit 12)                       */
#define BLEIF_BSTATUS_BLEHREQ_Msk         (0x1000UL)                /*!< BLEIF BSTATUS: BLEHREQ (Bitfield-Mask: 0x01)          */
#define BLEIF_BSTATUS_BLEHACK_Pos         (11UL)                    /*!< BLEIF BSTATUS: BLEHACK (Bit 11)                       */
#define BLEIF_BSTATUS_BLEHACK_Msk         (0x800UL)                 /*!< BLEIF BSTATUS: BLEHACK (Bitfield-Mask: 0x01)          */
#define BLEIF_BSTATUS_PWRST_Pos           (8UL)                     /*!< BLEIF BSTATUS: PWRST (Bit 8)                          */
#define BLEIF_BSTATUS_PWRST_Msk           (0x700UL)                 /*!< BLEIF BSTATUS: PWRST (Bitfield-Mask: 0x07)            */
#define BLEIF_BSTATUS_BLEIRQ_Pos          (7UL)                     /*!< BLEIF BSTATUS: BLEIRQ (Bit 7)                         */
#define BLEIF_BSTATUS_BLEIRQ_Msk          (0x80UL)                  /*!< BLEIF BSTATUS: BLEIRQ (Bitfield-Mask: 0x01)           */
#define BLEIF_BSTATUS_WAKEUP_Pos          (6UL)                     /*!< BLEIF BSTATUS: WAKEUP (Bit 6)                         */
#define BLEIF_BSTATUS_WAKEUP_Msk          (0x40UL)                  /*!< BLEIF BSTATUS: WAKEUP (Bitfield-Mask: 0x01)           */
#define BLEIF_BSTATUS_DCDCFLAG_Pos        (5UL)                     /*!< BLEIF BSTATUS: DCDCFLAG (Bit 5)                       */
#define BLEIF_BSTATUS_DCDCFLAG_Msk        (0x20UL)                  /*!< BLEIF BSTATUS: DCDCFLAG (Bitfield-Mask: 0x01)         */
#define BLEIF_BSTATUS_DCDCREQ_Pos         (4UL)                     /*!< BLEIF BSTATUS: DCDCREQ (Bit 4)                        */
#define BLEIF_BSTATUS_DCDCREQ_Msk         (0x10UL)                  /*!< BLEIF BSTATUS: DCDCREQ (Bitfield-Mask: 0x01)          */
#define BLEIF_BSTATUS_SPISTATUS_Pos       (3UL)                     /*!< BLEIF BSTATUS: SPISTATUS (Bit 3)                      */
#define BLEIF_BSTATUS_SPISTATUS_Msk       (0x8UL)                   /*!< BLEIF BSTATUS: SPISTATUS (Bitfield-Mask: 0x01)        */
#define BLEIF_BSTATUS_B2MSTATE_Pos        (0UL)                     /*!< BLEIF BSTATUS: B2MSTATE (Bit 0)                       */
#define BLEIF_BSTATUS_B2MSTATE_Msk        (0x7UL)                   /*!< BLEIF BSTATUS: B2MSTATE (Bitfield-Mask: 0x07)         */
/* ========================================================  BLEDBG  ========================================================= */
#define BLEIF_BLEDBG_DBGDATA_Pos          (3UL)                     /*!< BLEIF BLEDBG: DBGDATA (Bit 3)                         */
#define BLEIF_BLEDBG_DBGDATA_Msk          (0xfffffff8UL)            /*!< BLEIF BLEDBG: DBGDATA (Bitfield-Mask: 0x1fffffff)     */
#define BLEIF_BLEDBG_APBCLKON_Pos         (2UL)                     /*!< BLEIF BLEDBG: APBCLKON (Bit 2)                        */
#define BLEIF_BLEDBG_APBCLKON_Msk         (0x4UL)                   /*!< BLEIF BLEDBG: APBCLKON (Bitfield-Mask: 0x01)          */
#define BLEIF_BLEDBG_IOCLKON_Pos          (1UL)                     /*!< BLEIF BLEDBG: IOCLKON (Bit 1)                         */
#define BLEIF_BLEDBG_IOCLKON_Msk          (0x2UL)                   /*!< BLEIF BLEDBG: IOCLKON (Bitfield-Mask: 0x01)           */
#define BLEIF_BLEDBG_DBGEN_Pos            (0UL)                     /*!< BLEIF BLEDBG: DBGEN (Bit 0)                           */
#define BLEIF_BLEDBG_DBGEN_Msk            (0x1UL)                   /*!< BLEIF BLEDBG: DBGEN (Bitfield-Mask: 0x01)             */


