tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
#define CTIMER_CTRL4_TMRA4CLK_Pos         (1UL)                     /*!< CTIMER CTRL4: TMRA4CLK (Bit 1)                        */
#define CTIMER_CTRL4_TMRA4CLK_Msk         (0x3eUL)                  /*!< CTIMER CTRL4: TMRA4CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL4_TMRA4EN_Pos          (0UL)                     /*!< CTIMER CTRL4: TMRA4EN (Bit 0)                         */
#define CTIMER_CTRL4_TMRA4EN_Msk          (0x1UL)                   /*!< CTIMER CTRL4: TMRA4EN (Bitfield-Mask: 0x01)           */
/* =======================================================  CMPRAUXA4  ======================================================= */
#define CTIMER_CMPRAUXA4_CMPR3A4_Pos      (16UL)                    /*!< CTIMER CMPRAUXA4: CMPR3A4 (Bit 16)                    */
#define CTIMER_CMPRAUXA4_CMPR3A4_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXA4: CMPR3A4 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXA4_CMPR2A4_Pos      (0UL)                     /*!< CTIMER CMPRAUXA4: CMPR2A4 (Bit 0)                     */
#define CTIMER_CMPRAUXA4_CMPR2A4_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXA4: CMPR2A4 (Bitfield-Mask: 0xffff)     */
/* =======================================================  CMPRAUXB4  ======================================================= */
#define CTIMER_CMPRAUXB4_CMPR3B4_Pos      (16UL)                    /*!< CTIMER CMPRAUXB4: CMPR3B4 (Bit 16)                    */
#define CTIMER_CMPRAUXB4_CMPR3B4_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXB4: CMPR3B4 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXB4_CMPR2B4_Pos      (0UL)                     /*!< CTIMER CMPRAUXB4: CMPR2B4 (Bit 0)                     */
#define CTIMER_CMPRAUXB4_CMPR2B4_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXB4: CMPR2B4 (Bitfield-Mask: 0xffff)     */
/* =========================================================  AUX4  ========================================================== */
#define CTIMER_AUX4_TMRB4EN23_Pos         (30UL)                    /*!< CTIMER AUX4: TMRB4EN23 (Bit 30)                       */
#define CTIMER_AUX4_TMRB4EN23_Msk         (0x40000000UL)            /*!< CTIMER AUX4: TMRB4EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX4_TMRB4POL23_Pos        (29UL)                    /*!< CTIMER AUX4: TMRB4POL23 (Bit 29)                      */
#define CTIMER_AUX4_TMRB4POL23_Msk        (0x20000000UL)            /*!< CTIMER AUX4: TMRB4POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX4_TMRB4TINV_Pos         (28UL)                    /*!< CTIMER AUX4: TMRB4TINV (Bit 28)                       */
#define CTIMER_AUX4_TMRB4TINV_Msk         (0x10000000UL)            /*!< CTIMER AUX4: TMRB4TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX4_TMRB4NOSYNC_Pos       (27UL)                    /*!< CTIMER AUX4: TMRB4NOSYNC (Bit 27)                     */
#define CTIMER_AUX4_TMRB4NOSYNC_Msk       (0x8000000UL)             /*!< CTIMER AUX4: TMRB4NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX4_TMRB4TRIG_Pos         (23UL)                    /*!< CTIMER AUX4: TMRB4TRIG (Bit 23)                       */
#define CTIMER_AUX4_TMRB4TRIG_Msk         (0x7800000UL)             /*!< CTIMER AUX4: TMRB4TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX4_TMRB4LMT_Pos          (16UL)                    /*!< CTIMER AUX4: TMRB4LMT (Bit 16)                        */
#define CTIMER_AUX4_TMRB4LMT_Msk          (0x3f0000UL)              /*!< CTIMER AUX4: TMRB4LMT (Bitfield-Mask: 0x3f)           */
#define CTIMER_AUX4_TMRA4EN23_Pos         (14UL)                    /*!< CTIMER AUX4: TMRA4EN23 (Bit 14)                       */
#define CTIMER_AUX4_TMRA4EN23_Msk         (0x4000UL)                /*!< CTIMER AUX4: TMRA4EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX4_TMRA4POL23_Pos        (13UL)                    /*!< CTIMER AUX4: TMRA4POL23 (Bit 13)                      */
#define CTIMER_AUX4_TMRA4POL23_Msk        (0x2000UL)                /*!< CTIMER AUX4: TMRA4POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX4_TMRA4TINV_Pos         (12UL)                    /*!< CTIMER AUX4: TMRA4TINV (Bit 12)                       */
#define CTIMER_AUX4_TMRA4TINV_Msk         (0x1000UL)                /*!< CTIMER AUX4: TMRA4TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX4_TMRA4NOSYNC_Pos       (11UL)                    /*!< CTIMER AUX4: TMRA4NOSYNC (Bit 11)                     */
#define CTIMER_AUX4_TMRA4NOSYNC_Msk       (0x800UL)                 /*!< CTIMER AUX4: TMRA4NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX4_TMRA4TRIG_Pos         (7UL)                     /*!< CTIMER AUX4: TMRA4TRIG (Bit 7)                        */
#define CTIMER_AUX4_TMRA4TRIG_Msk         (0x780UL)                 /*!< CTIMER AUX4: TMRA4TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX4_TMRA4LMT_Pos          (0UL)                     /*!< CTIMER AUX4: TMRA4LMT (Bit 0)                         */
#define CTIMER_AUX4_TMRA4LMT_Msk          (0x7fUL)                  /*!< CTIMER AUX4: TMRA4LMT (Bitfield-Mask: 0x7f)           */
/* =========================================================  TMR5  ========================================================== */
#define CTIMER_TMR5_CTTMRB5_Pos           (16UL)                    /*!< CTIMER TMR5: CTTMRB5 (Bit 16)                         */
#define CTIMER_TMR5_CTTMRB5_Msk           (0xffff0000UL)            /*!< CTIMER TMR5: CTTMRB5 (Bitfield-Mask: 0xffff)          */
#define CTIMER_TMR5_CTTMRA5_Pos           (0UL)                     /*!< CTIMER TMR5: CTTMRA5 (Bit 0)                          */
#define CTIMER_TMR5_CTTMRA5_Msk           (0xffffUL)                /*!< CTIMER TMR5: CTTMRA5 (Bitfield-Mask: 0xffff)          */
/* ========================================================  CMPRA5  ========================================================= */
#define CTIMER_CMPRA5_CMPR1A5_Pos         (16UL)                    /*!< CTIMER CMPRA5: CMPR1A5 (Bit 16)                       */
#define CTIMER_CMPRA5_CMPR1A5_Msk         (0xffff0000UL)            /*!< CTIMER CMPRA5: CMPR1A5 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRA5_CMPR0A5_Pos         (0UL)                     /*!< CTIMER CMPRA5: CMPR0A5 (Bit 0)                        */
#define CTIMER_CMPRA5_CMPR0A5_Msk         (0xffffUL)                /*!< CTIMER CMPRA5: CMPR0A5 (Bitfield-Mask: 0xffff)        */
/* ========================================================  CMPRB5  ========================================================= */
#define CTIMER_CMPRB5_CMPR1B5_Pos         (16UL)                    /*!< CTIMER CMPRB5: CMPR1B5 (Bit 16)                       */
#define CTIMER_CMPRB5_CMPR1B5_Msk         (0xffff0000UL)            /*!< CTIMER CMPRB5: CMPR1B5 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRB5_CMPR0B5_Pos         (0UL)                     /*!< CTIMER CMPRB5: CMPR0B5 (Bit 0)                        */
#define CTIMER_CMPRB5_CMPR0B5_Msk         (0xffffUL)                /*!< CTIMER CMPRB5: CMPR0B5 (Bitfield-Mask: 0xffff)        */
/* =========================================================  CTRL5  ========================================================= */
#define CTIMER_CTRL5_CTLINK5_Pos          (31UL)                    /*!< CTIMER CTRL5: CTLINK5 (Bit 31)                        */
#define CTIMER_CTRL5_CTLINK5_Msk          (0x80000000UL)            /*!< CTIMER CTRL5: CTLINK5 (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL5_TMRB5POL_Pos         (28UL)                    /*!< CTIMER CTRL5: TMRB5POL (Bit 28)                       */
#define CTIMER_CTRL5_TMRB5POL_Msk         (0x10000000UL)            /*!< CTIMER CTRL5: TMRB5POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL5_TMRB5CLR_Pos         (27UL)                    /*!< CTIMER CTRL5: TMRB5CLR (Bit 27)                       */
#define CTIMER_CTRL5_TMRB5CLR_Msk         (0x8000000UL)             /*!< CTIMER CTRL5: TMRB5CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL5_TMRB5IE1_Pos         (26UL)                    /*!< CTIMER CTRL5: TMRB5IE1 (Bit 26)                       */
#define CTIMER_CTRL5_TMRB5IE1_Msk         (0x4000000UL)             /*!< CTIMER CTRL5: TMRB5IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL5_TMRB5IE0_Pos         (25UL)                    /*!< CTIMER CTRL5: TMRB5IE0 (Bit 25)                       */
#define CTIMER_CTRL5_TMRB5IE0_Msk         (0x2000000UL)             /*!< CTIMER CTRL5: TMRB5IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL5_TMRB5FN_Pos          (22UL)                    /*!< CTIMER CTRL5: TMRB5FN (Bit 22)                        */
#define CTIMER_CTRL5_TMRB5FN_Msk          (0x1c00000UL)             /*!< CTIMER CTRL5: TMRB5FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL5_TMRB5CLK_Pos         (17UL)                    /*!< CTIMER CTRL5: TMRB5CLK (Bit 17)                       */
#define CTIMER_CTRL5_TMRB5CLK_Msk         (0x3e0000UL)              /*!< CTIMER CTRL5: TMRB5CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL5_TMRB5EN_Pos          (16UL)                    /*!< CTIMER CTRL5: TMRB5EN (Bit 16)                        */
#define CTIMER_CTRL5_TMRB5EN_Msk          (0x10000UL)               /*!< CTIMER CTRL5: TMRB5EN (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL5_TMRA5POL_Pos         (12UL)                    /*!< CTIMER CTRL5: TMRA5POL (Bit 12)                       */
#define CTIMER_CTRL5_TMRA5POL_Msk         (0x1000UL)                /*!< CTIMER CTRL5: TMRA5POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL5_TMRA5CLR_Pos         (11UL)                    /*!< CTIMER CTRL5: TMRA5CLR (Bit 11)                       */
#define CTIMER_CTRL5_TMRA5CLR_Msk         (0x800UL)                 /*!< CTIMER CTRL5: TMRA5CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL5_TMRA5IE1_Pos         (10UL)                    /*!< CTIMER CTRL5: TMRA5IE1 (Bit 10)                       */
#define CTIMER_CTRL5_TMRA5IE1_Msk         (0x400UL)                 /*!< CTIMER CTRL5: TMRA5IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL5_TMRA5IE0_Pos         (9UL)                     /*!< CTIMER CTRL5: TMRA5IE0 (Bit 9)                        */
#define CTIMER_CTRL5_TMRA5IE0_Msk         (0x200UL)                 /*!< CTIMER CTRL5: TMRA5IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL5_TMRA5FN_Pos          (6UL)                     /*!< CTIMER CTRL5: TMRA5FN (Bit 6)                         */
#define CTIMER_CTRL5_TMRA5FN_Msk          (0x1c0UL)                 /*!< CTIMER CTRL5: TMRA5FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL5_TMRA5CLK_Pos         (1UL)                     /*!< CTIMER CTRL5: TMRA5CLK (Bit 1)                        */
#define CTIMER_CTRL5_TMRA5CLK_Msk         (0x3eUL)                  /*!< CTIMER CTRL5: TMRA5CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL5_TMRA5EN_Pos          (0UL)                     /*!< CTIMER CTRL5: TMRA5EN (Bit 0)                         */
#define CTIMER_CTRL5_TMRA5EN_Msk          (0x1UL)                   /*!< CTIMER CTRL5: TMRA5EN (Bitfield-Mask: 0x01)           */
/* =======================================================  CMPRAUXA5  ======================================================= */
#define CTIMER_CMPRAUXA5_CMPR3A5_Pos      (16UL)                    /*!< CTIMER CMPRAUXA5: CMPR3A5 (Bit 16)                    */
#define CTIMER_CMPRAUXA5_CMPR3A5_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXA5: CMPR3A5 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXA5_CMPR2A5_Pos      (0UL)                     /*!< CTIMER CMPRAUXA5: CMPR2A5 (Bit 0)                     */
#define CTIMER_CMPRAUXA5_CMPR2A5_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXA5: CMPR2A5 (Bitfield-Mask: 0xffff)     */
/* =======================================================  CMPRAUXB5  ======================================================= */
#define CTIMER_CMPRAUXB5_CMPR3B5_Pos      (16UL)                    /*!< CTIMER CMPRAUXB5: CMPR3B5 (Bit 16)                    */
#define CTIMER_CMPRAUXB5_CMPR3B5_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXB5: CMPR3B5 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXB5_CMPR2B5_Pos      (0UL)                     /*!< CTIMER CMPRAUXB5: CMPR2B5 (Bit 0)                     */
#define CTIMER_CMPRAUXB5_CMPR2B5_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXB5: CMPR2B5 (Bitfield-Mask: 0xffff)     */
/* =========================================================  AUX5  ========================================================== */
#define CTIMER_AUX5_TMRB5EN23_Pos         (30UL)                    /*!< CTIMER AUX5: TMRB5EN23 (Bit 30)                       */
#define CTIMER_AUX5_TMRB5EN23_Msk         (0x40000000UL)            /*!< CTIMER AUX5: TMRB5EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX5_TMRB5POL23_Pos        (29UL)                    /*!< CTIMER AUX5: TMRB5POL23 (Bit 29)                      */
#define CTIMER_AUX5_TMRB5POL23_Msk        (0x20000000UL)            /*!< CTIMER AUX5: TMRB5POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX5_TMRB5TINV_Pos         (28UL)                    /*!< CTIMER AUX5: TMRB5TINV (Bit 28)                       */
#define CTIMER_AUX5_TMRB5TINV_Msk         (0x10000000UL)            /*!< CTIMER AUX5: TMRB5TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX5_TMRB5NOSYNC_Pos       (27UL)                    /*!< CTIMER AUX5: TMRB5NOSYNC (Bit 27)                     */
#define CTIMER_AUX5_TMRB5NOSYNC_Msk       (0x8000000UL)             /*!< CTIMER AUX5: TMRB5NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX5_TMRB5TRIG_Pos         (23UL)                    /*!< CTIMER AUX5: TMRB5TRIG (Bit 23)                       */
#define CTIMER_AUX5_TMRB5TRIG_Msk         (0x7800000UL)             /*!< CTIMER AUX5: TMRB5TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX5_TMRB5LMT_Pos          (16UL)                    /*!< CTIMER AUX5: TMRB5LMT (Bit 16)                        */
#define CTIMER_AUX5_TMRB5LMT_Msk          (0x3f0000UL)              /*!< CTIMER AUX5: TMRB5LMT (Bitfield-Mask: 0x3f)           */
#define CTIMER_AUX5_TMRA5EN23_Pos         (14UL)                    /*!< CTIMER AUX5: TMRA5EN23 (Bit 14)                       */
#define CTIMER_AUX5_TMRA5EN23_Msk         (0x4000UL)                /*!< CTIMER AUX5: TMRA5EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX5_TMRA5POL23_Pos        (13UL)                    /*!< CTIMER AUX5: TMRA5POL23 (Bit 13)                      */
#define CTIMER_AUX5_TMRA5POL23_Msk        (0x2000UL)                /*!< CTIMER AUX5: TMRA5POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX5_TMRA5TINV_Pos         (12UL)                    /*!< CTIMER AUX5: TMRA5TINV (Bit 12)                       */
#define CTIMER_AUX5_TMRA5TINV_Msk         (0x1000UL)                /*!< CTIMER AUX5: TMRA5TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX5_TMRA5NOSYNC_Pos       (11UL)                    /*!< CTIMER AUX5: TMRA5NOSYNC (Bit 11)                     */
#define CTIMER_AUX5_TMRA5NOSYNC_Msk       (0x800UL)                 /*!< CTIMER AUX5: TMRA5NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX5_TMRA5TRIG_Pos         (7UL)                     /*!< CTIMER AUX5: TMRA5TRIG (Bit 7)                        */
#define CTIMER_AUX5_TMRA5TRIG_Msk         (0x780UL)                 /*!< CTIMER AUX5: TMRA5TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX5_TMRA5LMT_Pos          (0UL)                     /*!< CTIMER AUX5: TMRA5LMT (Bit 0)                         */
#define CTIMER_AUX5_TMRA5LMT_Msk          (0x7fUL)                  /*!< CTIMER AUX5: TMRA5LMT (Bitfield-Mask: 0x7f)           */
/* =========================================================  TMR6  ========================================================== */
#define CTIMER_TMR6_CTTMRB6_Pos           (16UL)                    /*!< CTIMER TMR6: CTTMRB6 (Bit 16)                         */
#define CTIMER_TMR6_CTTMRB6_Msk           (0xffff0000UL)            /*!< CTIMER TMR6: CTTMRB6 (Bitfield-Mask: 0xffff)          */
#define CTIMER_TMR6_CTTMRA6_Pos           (0UL)                     /*!< CTIMER TMR6: CTTMRA6 (Bit 0)                          */
#define CTIMER_TMR6_CTTMRA6_Msk           (0xffffUL)                /*!< CTIMER TMR6: CTTMRA6 (Bitfield-Mask: 0xffff)          */
/* ========================================================  CMPRA6  ========================================================= */
#define CTIMER_CMPRA6_CMPR1A6_Pos         (16UL)                    /*!< CTIMER CMPRA6: CMPR1A6 (Bit 16)                       */
#define CTIMER_CMPRA6_CMPR1A6_Msk         (0xffff0000UL)            /*!< CTIMER CMPRA6: CMPR1A6 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRA6_CMPR0A6_Pos         (0UL)                     /*!< CTIMER CMPRA6: CMPR0A6 (Bit 0)                        */
#define CTIMER_CMPRA6_CMPR0A6_Msk         (0xffffUL)                /*!< CTIMER CMPRA6: CMPR0A6 (Bitfield-Mask: 0xffff)        */
/* ========================================================  CMPRB6  ========================================================= */
#define CTIMER_CMPRB6_CMPR1B6_Pos         (16UL)                    /*!< CTIMER CMPRB6: CMPR1B6 (Bit 16)                       */
#define CTIMER_CMPRB6_CMPR1B6_Msk         (0xffff0000UL)            /*!< CTIMER CMPRB6: CMPR1B6 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRB6_CMPR0B6_Pos         (0UL)                     /*!< CTIMER CMPRB6: CMPR0B6 (Bit 0)                        */
#define CTIMER_CMPRB6_CMPR0B6_Msk         (0xffffUL)                /*!< CTIMER CMPRB6: CMPR0B6 (Bitfield-Mask: 0xffff)        */
/* =========================================================  CTRL6  ========================================================= */
#define CTIMER_CTRL6_CTLINK6_Pos          (31UL)                    /*!< CTIMER CTRL6: CTLINK6 (Bit 31)                        */
#define CTIMER_CTRL6_CTLINK6_Msk          (0x80000000UL)            /*!< CTIMER CTRL6: CTLINK6 (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL6_TMRB6POL_Pos         (28UL)                    /*!< CTIMER CTRL6: TMRB6POL (Bit 28)                       */
#define CTIMER_CTRL6_TMRB6POL_Msk         (0x10000000UL)            /*!< CTIMER CTRL6: TMRB6POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL6_TMRB6CLR_Pos         (27UL)                    /*!< CTIMER CTRL6: TMRB6CLR (Bit 27)                       */
#define CTIMER_CTRL6_TMRB6CLR_Msk         (0x8000000UL)             /*!< CTIMER CTRL6: TMRB6CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL6_TMRB6IE1_Pos         (26UL)                    /*!< CTIMER CTRL6: TMRB6IE1 (Bit 26)                       */
#define CTIMER_CTRL6_TMRB6IE1_Msk         (0x4000000UL)             /*!< CTIMER CTRL6: TMRB6IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL6_TMRB6IE0_Pos         (25UL)                    /*!< CTIMER CTRL6: TMRB6IE0 (Bit 25)                       */
#define CTIMER_CTRL6_TMRB6IE0_Msk         (0x2000000UL)             /*!< CTIMER CTRL6: TMRB6IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL6_TMRB6FN_Pos          (22UL)                    /*!< CTIMER CTRL6: TMRB6FN (Bit 22)                        */
#define CTIMER_CTRL6_TMRB6FN_Msk          (0x1c00000UL)             /*!< CTIMER CTRL6: TMRB6FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL6_TMRB6CLK_Pos         (17UL)                    /*!< CTIMER CTRL6: TMRB6CLK (Bit 17)                       */
#define CTIMER_CTRL6_TMRB6CLK_Msk         (0x3e0000UL)              /*!< CTIMER CTRL6: TMRB6CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL6_TMRB6EN_Pos          (16UL)                    /*!< CTIMER CTRL6: TMRB6EN (Bit 16)                        */
#define CTIMER_CTRL6_TMRB6EN_Msk          (0x10000UL)               /*!< CTIMER CTRL6: TMRB6EN (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL6_TMRA6POL_Pos         (12UL)                    /*!< CTIMER CTRL6: TMRA6POL (Bit 12)                       */
#define CTIMER_CTRL6_TMRA6POL_Msk         (0x1000UL)                /*!< CTIMER CTRL6: TMRA6POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL6_TMRA6CLR_Pos         (11UL)                    /*!< CTIMER CTRL6: TMRA6CLR (Bit 11)                       */
#define CTIMER_CTRL6_TMRA6CLR_Msk         (0x800UL)                 /*!< CTIMER CTRL6: TMRA6CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL6_TMRA6IE1_Pos         (10UL)                    /*!< CTIMER CTRL6: TMRA6IE1 (Bit 10)                       */
#define CTIMER_CTRL6_TMRA6IE1_Msk         (0x400UL)                 /*!< CTIMER CTRL6: TMRA6IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL6_TMRA6IE0_Pos         (9UL)                     /*!< CTIMER CTRL6: TMRA6IE0 (Bit 9)                        */
#define CTIMER_CTRL6_TMRA6IE0_Msk         (0x200UL)                 /*!< CTIMER CTRL6: TMRA6IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL6_TMRA6FN_Pos          (6UL)                     /*!< CTIMER CTRL6: TMRA6FN (Bit 6)                         */
#define CTIMER_CTRL6_TMRA6FN_Msk          (0x1c0UL)                 /*!< CTIMER CTRL6: TMRA6FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL6_TMRA6CLK_Pos         (1UL)                     /*!< CTIMER CTRL6: TMRA6CLK (Bit 1)                        */
#define CTIMER_CTRL6_TMRA6CLK_Msk         (0x3eUL)                  /*!< CTIMER CTRL6: TMRA6CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL6_TMRA6EN_Pos          (0UL)                     /*!< CTIMER CTRL6: TMRA6EN (Bit 0)                         */
#define CTIMER_CTRL6_TMRA6EN_Msk          (0x1UL)                   /*!< CTIMER CTRL6: TMRA6EN (Bitfield-Mask: 0x01)           */
/* =======================================================  CMPRAUXA6  ======================================================= */
#define CTIMER_CMPRAUXA6_CMPR3A6_Pos      (16UL)                    /*!< CTIMER CMPRAUXA6: CMPR3A6 (Bit 16)                    */
#define CTIMER_CMPRAUXA6_CMPR3A6_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXA6: CMPR3A6 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXA6_CMPR2A6_Pos      (0UL)                     /*!< CTIMER CMPRAUXA6: CMPR2A6 (Bit 0)                     */
#define CTIMER_CMPRAUXA6_CMPR2A6_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXA6: CMPR2A6 (Bitfield-Mask: 0xffff)     */
/* =======================================================  CMPRAUXB6  ======================================================= */
#define CTIMER_CMPRAUXB6_CMPR3B6_Pos      (16UL)                    /*!< CTIMER CMPRAUXB6: CMPR3B6 (Bit 16)                    */
#define CTIMER_CMPRAUXB6_CMPR3B6_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXB6: CMPR3B6 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXB6_CMPR2B6_Pos      (0UL)                     /*!< CTIMER CMPRAUXB6: CMPR2B6 (Bit 0)                     */
#define CTIMER_CMPRAUXB6_CMPR2B6_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXB6: CMPR2B6 (Bitfield-Mask: 0xffff)     */
/* =========================================================  AUX6  ========================================================== */
#define CTIMER_AUX6_TMRB6EN23_Pos         (30UL)                    /*!< CTIMER AUX6: TMRB6EN23 (Bit 30)                       */
#define CTIMER_AUX6_TMRB6EN23_Msk         (0x40000000UL)            /*!< CTIMER AUX6: TMRB6EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX6_TMRB6POL23_Pos        (29UL)                    /*!< CTIMER AUX6: TMRB6POL23 (Bit 29)                      */
#define CTIMER_AUX6_TMRB6POL23_Msk        (0x20000000UL)            /*!< CTIMER AUX6: TMRB6POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX6_TMRB6TINV_Pos         (28UL)                    /*!< CTIMER AUX6: TMRB6TINV (Bit 28)                       */
#define CTIMER_AUX6_TMRB6TINV_Msk         (0x10000000UL)            /*!< CTIMER AUX6: TMRB6TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX6_TMRB6NOSYNC_Pos       (27UL)                    /*!< CTIMER AUX6: TMRB6NOSYNC (Bit 27)                     */
