tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
#define CTIMER_AUX6_TMRB6NOSYNC_Msk       (0x8000000UL)             /*!< CTIMER AUX6: TMRB6NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX6_TMRB6TRIG_Pos         (23UL)                    /*!< CTIMER AUX6: TMRB6TRIG (Bit 23)                       */
#define CTIMER_AUX6_TMRB6TRIG_Msk         (0x7800000UL)             /*!< CTIMER AUX6: TMRB6TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX6_TMRB6LMT_Pos          (16UL)                    /*!< CTIMER AUX6: TMRB6LMT (Bit 16)                        */
#define CTIMER_AUX6_TMRB6LMT_Msk          (0x3f0000UL)              /*!< CTIMER AUX6: TMRB6LMT (Bitfield-Mask: 0x3f)           */
#define CTIMER_AUX6_TMRA6EN23_Pos         (14UL)                    /*!< CTIMER AUX6: TMRA6EN23 (Bit 14)                       */
#define CTIMER_AUX6_TMRA6EN23_Msk         (0x4000UL)                /*!< CTIMER AUX6: TMRA6EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX6_TMRA6POL23_Pos        (13UL)                    /*!< CTIMER AUX6: TMRA6POL23 (Bit 13)                      */
#define CTIMER_AUX6_TMRA6POL23_Msk        (0x2000UL)                /*!< CTIMER AUX6: TMRA6POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX6_TMRA6TINV_Pos         (12UL)                    /*!< CTIMER AUX6: TMRA6TINV (Bit 12)                       */
#define CTIMER_AUX6_TMRA6TINV_Msk         (0x1000UL)                /*!< CTIMER AUX6: TMRA6TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX6_TMRA6NOSYNC_Pos       (11UL)                    /*!< CTIMER AUX6: TMRA6NOSYNC (Bit 11)                     */
#define CTIMER_AUX6_TMRA6NOSYNC_Msk       (0x800UL)                 /*!< CTIMER AUX6: TMRA6NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX6_TMRA6TRIG_Pos         (7UL)                     /*!< CTIMER AUX6: TMRA6TRIG (Bit 7)                        */
#define CTIMER_AUX6_TMRA6TRIG_Msk         (0x780UL)                 /*!< CTIMER AUX6: TMRA6TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX6_TMRA6LMT_Pos          (0UL)                     /*!< CTIMER AUX6: TMRA6LMT (Bit 0)                         */
#define CTIMER_AUX6_TMRA6LMT_Msk          (0x7fUL)                  /*!< CTIMER AUX6: TMRA6LMT (Bitfield-Mask: 0x7f)           */
/* =========================================================  TMR7  ========================================================== */
#define CTIMER_TMR7_CTTMRB7_Pos           (16UL)                    /*!< CTIMER TMR7: CTTMRB7 (Bit 16)                         */
#define CTIMER_TMR7_CTTMRB7_Msk           (0xffff0000UL)            /*!< CTIMER TMR7: CTTMRB7 (Bitfield-Mask: 0xffff)          */
#define CTIMER_TMR7_CTTMRA7_Pos           (0UL)                     /*!< CTIMER TMR7: CTTMRA7 (Bit 0)                          */
#define CTIMER_TMR7_CTTMRA7_Msk           (0xffffUL)                /*!< CTIMER TMR7: CTTMRA7 (Bitfield-Mask: 0xffff)          */
/* ========================================================  CMPRA7  ========================================================= */
#define CTIMER_CMPRA7_CMPR1A7_Pos         (16UL)                    /*!< CTIMER CMPRA7: CMPR1A7 (Bit 16)                       */
#define CTIMER_CMPRA7_CMPR1A7_Msk         (0xffff0000UL)            /*!< CTIMER CMPRA7: CMPR1A7 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRA7_CMPR0A7_Pos         (0UL)                     /*!< CTIMER CMPRA7: CMPR0A7 (Bit 0)                        */
#define CTIMER_CMPRA7_CMPR0A7_Msk         (0xffffUL)                /*!< CTIMER CMPRA7: CMPR0A7 (Bitfield-Mask: 0xffff)        */
/* ========================================================  CMPRB7  ========================================================= */
#define CTIMER_CMPRB7_CMPR1B7_Pos         (16UL)                    /*!< CTIMER CMPRB7: CMPR1B7 (Bit 16)                       */
#define CTIMER_CMPRB7_CMPR1B7_Msk         (0xffff0000UL)            /*!< CTIMER CMPRB7: CMPR1B7 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRB7_CMPR0B7_Pos         (0UL)                     /*!< CTIMER CMPRB7: CMPR0B7 (Bit 0)                        */
#define CTIMER_CMPRB7_CMPR0B7_Msk         (0xffffUL)                /*!< CTIMER CMPRB7: CMPR0B7 (Bitfield-Mask: 0xffff)        */
/* =========================================================  CTRL7  ========================================================= */
#define CTIMER_CTRL7_CTLINK7_Pos          (31UL)                    /*!< CTIMER CTRL7: CTLINK7 (Bit 31)                        */
#define CTIMER_CTRL7_CTLINK7_Msk          (0x80000000UL)            /*!< CTIMER CTRL7: CTLINK7 (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL7_TMRB7POL_Pos         (28UL)                    /*!< CTIMER CTRL7: TMRB7POL (Bit 28)                       */
#define CTIMER_CTRL7_TMRB7POL_Msk         (0x10000000UL)            /*!< CTIMER CTRL7: TMRB7POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL7_TMRB7CLR_Pos         (27UL)                    /*!< CTIMER CTRL7: TMRB7CLR (Bit 27)                       */
#define CTIMER_CTRL7_TMRB7CLR_Msk         (0x8000000UL)             /*!< CTIMER CTRL7: TMRB7CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL7_TMRB7IE1_Pos         (26UL)                    /*!< CTIMER CTRL7: TMRB7IE1 (Bit 26)                       */
#define CTIMER_CTRL7_TMRB7IE1_Msk         (0x4000000UL)             /*!< CTIMER CTRL7: TMRB7IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL7_TMRB7IE0_Pos         (25UL)                    /*!< CTIMER CTRL7: TMRB7IE0 (Bit 25)                       */
#define CTIMER_CTRL7_TMRB7IE0_Msk         (0x2000000UL)             /*!< CTIMER CTRL7: TMRB7IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL7_TMRB7FN_Pos          (22UL)                    /*!< CTIMER CTRL7: TMRB7FN (Bit 22)                        */
#define CTIMER_CTRL7_TMRB7FN_Msk          (0x1c00000UL)             /*!< CTIMER CTRL7: TMRB7FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL7_TMRB7CLK_Pos         (17UL)                    /*!< CTIMER CTRL7: TMRB7CLK (Bit 17)                       */
#define CTIMER_CTRL7_TMRB7CLK_Msk         (0x3e0000UL)              /*!< CTIMER CTRL7: TMRB7CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL7_TMRB7EN_Pos          (16UL)                    /*!< CTIMER CTRL7: TMRB7EN (Bit 16)                        */
#define CTIMER_CTRL7_TMRB7EN_Msk          (0x10000UL)               /*!< CTIMER CTRL7: TMRB7EN (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL7_TMRA7POL_Pos         (12UL)                    /*!< CTIMER CTRL7: TMRA7POL (Bit 12)                       */
#define CTIMER_CTRL7_TMRA7POL_Msk         (0x1000UL)                /*!< CTIMER CTRL7: TMRA7POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL7_TMRA7CLR_Pos         (11UL)                    /*!< CTIMER CTRL7: TMRA7CLR (Bit 11)                       */
#define CTIMER_CTRL7_TMRA7CLR_Msk         (0x800UL)                 /*!< CTIMER CTRL7: TMRA7CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL7_TMRA7IE1_Pos         (10UL)                    /*!< CTIMER CTRL7: TMRA7IE1 (Bit 10)                       */
#define CTIMER_CTRL7_TMRA7IE1_Msk         (0x400UL)                 /*!< CTIMER CTRL7: TMRA7IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL7_TMRA7IE0_Pos         (9UL)                     /*!< CTIMER CTRL7: TMRA7IE0 (Bit 9)                        */
#define CTIMER_CTRL7_TMRA7IE0_Msk         (0x200UL)                 /*!< CTIMER CTRL7: TMRA7IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL7_TMRA7FN_Pos          (6UL)                     /*!< CTIMER CTRL7: TMRA7FN (Bit 6)                         */
#define CTIMER_CTRL7_TMRA7FN_Msk          (0x1c0UL)                 /*!< CTIMER CTRL7: TMRA7FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL7_TMRA7CLK_Pos         (1UL)                     /*!< CTIMER CTRL7: TMRA7CLK (Bit 1)                        */
#define CTIMER_CTRL7_TMRA7CLK_Msk         (0x3eUL)                  /*!< CTIMER CTRL7: TMRA7CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL7_TMRA7EN_Pos          (0UL)                     /*!< CTIMER CTRL7: TMRA7EN (Bit 0)                         */
#define CTIMER_CTRL7_TMRA7EN_Msk          (0x1UL)                   /*!< CTIMER CTRL7: TMRA7EN (Bitfield-Mask: 0x01)           */
/* =======================================================  CMPRAUXA7  ======================================================= */
#define CTIMER_CMPRAUXA7_CMPR3A7_Pos      (16UL)                    /*!< CTIMER CMPRAUXA7: CMPR3A7 (Bit 16)                    */
#define CTIMER_CMPRAUXA7_CMPR3A7_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXA7: CMPR3A7 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXA7_CMPR2A7_Pos      (0UL)                     /*!< CTIMER CMPRAUXA7: CMPR2A7 (Bit 0)                     */
#define CTIMER_CMPRAUXA7_CMPR2A7_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXA7: CMPR2A7 (Bitfield-Mask: 0xffff)     */
/* =======================================================  CMPRAUXB7  ======================================================= */
#define CTIMER_CMPRAUXB7_CMPR3B7_Pos      (16UL)                    /*!< CTIMER CMPRAUXB7: CMPR3B7 (Bit 16)                    */
#define CTIMER_CMPRAUXB7_CMPR3B7_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXB7: CMPR3B7 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXB7_CMPR2B7_Pos      (0UL)                     /*!< CTIMER CMPRAUXB7: CMPR2B7 (Bit 0)                     */
#define CTIMER_CMPRAUXB7_CMPR2B7_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXB7: CMPR2B7 (Bitfield-Mask: 0xffff)     */
/* =========================================================  AUX7  ========================================================== */
#define CTIMER_AUX7_TMRB7EN23_Pos         (30UL)                    /*!< CTIMER AUX7: TMRB7EN23 (Bit 30)                       */
#define CTIMER_AUX7_TMRB7EN23_Msk         (0x40000000UL)            /*!< CTIMER AUX7: TMRB7EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX7_TMRB7POL23_Pos        (29UL)                    /*!< CTIMER AUX7: TMRB7POL23 (Bit 29)                      */
#define CTIMER_AUX7_TMRB7POL23_Msk        (0x20000000UL)            /*!< CTIMER AUX7: TMRB7POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX7_TMRB7TINV_Pos         (28UL)                    /*!< CTIMER AUX7: TMRB7TINV (Bit 28)                       */
#define CTIMER_AUX7_TMRB7TINV_Msk         (0x10000000UL)            /*!< CTIMER AUX7: TMRB7TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX7_TMRB7NOSYNC_Pos       (27UL)                    /*!< CTIMER AUX7: TMRB7NOSYNC (Bit 27)                     */
#define CTIMER_AUX7_TMRB7NOSYNC_Msk       (0x8000000UL)             /*!< CTIMER AUX7: TMRB7NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX7_TMRB7TRIG_Pos         (23UL)                    /*!< CTIMER AUX7: TMRB7TRIG (Bit 23)                       */
#define CTIMER_AUX7_TMRB7TRIG_Msk         (0x7800000UL)             /*!< CTIMER AUX7: TMRB7TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX7_TMRB7LMT_Pos          (16UL)                    /*!< CTIMER AUX7: TMRB7LMT (Bit 16)                        */
#define CTIMER_AUX7_TMRB7LMT_Msk          (0x3f0000UL)              /*!< CTIMER AUX7: TMRB7LMT (Bitfield-Mask: 0x3f)           */
#define CTIMER_AUX7_TMRA7EN23_Pos         (14UL)                    /*!< CTIMER AUX7: TMRA7EN23 (Bit 14)                       */
#define CTIMER_AUX7_TMRA7EN23_Msk         (0x4000UL)                /*!< CTIMER AUX7: TMRA7EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX7_TMRA7POL23_Pos        (13UL)                    /*!< CTIMER AUX7: TMRA7POL23 (Bit 13)                      */
#define CTIMER_AUX7_TMRA7POL23_Msk        (0x2000UL)                /*!< CTIMER AUX7: TMRA7POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX7_TMRA7TINV_Pos         (12UL)                    /*!< CTIMER AUX7: TMRA7TINV (Bit 12)                       */
#define CTIMER_AUX7_TMRA7TINV_Msk         (0x1000UL)                /*!< CTIMER AUX7: TMRA7TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX7_TMRA7NOSYNC_Pos       (11UL)                    /*!< CTIMER AUX7: TMRA7NOSYNC (Bit 11)                     */
#define CTIMER_AUX7_TMRA7NOSYNC_Msk       (0x800UL)                 /*!< CTIMER AUX7: TMRA7NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX7_TMRA7TRIG_Pos         (7UL)                     /*!< CTIMER AUX7: TMRA7TRIG (Bit 7)                        */
#define CTIMER_AUX7_TMRA7TRIG_Msk         (0x780UL)                 /*!< CTIMER AUX7: TMRA7TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX7_TMRA7LMT_Pos          (0UL)                     /*!< CTIMER AUX7: TMRA7LMT (Bit 0)                         */
#define CTIMER_AUX7_TMRA7LMT_Msk          (0x7fUL)                  /*!< CTIMER AUX7: TMRA7LMT (Bitfield-Mask: 0x7f)           */
/* ========================================================  GLOBEN  ========================================================= */
#define CTIMER_GLOBEN_ENB7_Pos            (15UL)                    /*!< CTIMER GLOBEN: ENB7 (Bit 15)                          */
#define CTIMER_GLOBEN_ENB7_Msk            (0x8000UL)                /*!< CTIMER GLOBEN: ENB7 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENA7_Pos            (14UL)                    /*!< CTIMER GLOBEN: ENA7 (Bit 14)                          */
#define CTIMER_GLOBEN_ENA7_Msk            (0x4000UL)                /*!< CTIMER GLOBEN: ENA7 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENB6_Pos            (13UL)                    /*!< CTIMER GLOBEN: ENB6 (Bit 13)                          */
#define CTIMER_GLOBEN_ENB6_Msk            (0x2000UL)                /*!< CTIMER GLOBEN: ENB6 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENA6_Pos            (12UL)                    /*!< CTIMER GLOBEN: ENA6 (Bit 12)                          */
#define CTIMER_GLOBEN_ENA6_Msk            (0x1000UL)                /*!< CTIMER GLOBEN: ENA6 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENB5_Pos            (11UL)                    /*!< CTIMER GLOBEN: ENB5 (Bit 11)                          */
#define CTIMER_GLOBEN_ENB5_Msk            (0x800UL)                 /*!< CTIMER GLOBEN: ENB5 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENA5_Pos            (10UL)                    /*!< CTIMER GLOBEN: ENA5 (Bit 10)                          */
#define CTIMER_GLOBEN_ENA5_Msk            (0x400UL)                 /*!< CTIMER GLOBEN: ENA5 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENB4_Pos            (9UL)                     /*!< CTIMER GLOBEN: ENB4 (Bit 9)                           */
#define CTIMER_GLOBEN_ENB4_Msk            (0x200UL)                 /*!< CTIMER GLOBEN: ENB4 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENA4_Pos            (8UL)                     /*!< CTIMER GLOBEN: ENA4 (Bit 8)                           */
#define CTIMER_GLOBEN_ENA4_Msk            (0x100UL)                 /*!< CTIMER GLOBEN: ENA4 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENB3_Pos            (7UL)                     /*!< CTIMER GLOBEN: ENB3 (Bit 7)                           */
#define CTIMER_GLOBEN_ENB3_Msk            (0x80UL)                  /*!< CTIMER GLOBEN: ENB3 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENA3_Pos            (6UL)                     /*!< CTIMER GLOBEN: ENA3 (Bit 6)                           */
#define CTIMER_GLOBEN_ENA3_Msk            (0x40UL)                  /*!< CTIMER GLOBEN: ENA3 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENB2_Pos            (5UL)                     /*!< CTIMER GLOBEN: ENB2 (Bit 5)                           */
#define CTIMER_GLOBEN_ENB2_Msk            (0x20UL)                  /*!< CTIMER GLOBEN: ENB2 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENA2_Pos            (4UL)                     /*!< CTIMER GLOBEN: ENA2 (Bit 4)                           */
#define CTIMER_GLOBEN_ENA2_Msk            (0x10UL)                  /*!< CTIMER GLOBEN: ENA2 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENB1_Pos            (3UL)                     /*!< CTIMER GLOBEN: ENB1 (Bit 3)                           */
#define CTIMER_GLOBEN_ENB1_Msk            (0x8UL)                   /*!< CTIMER GLOBEN: ENB1 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENA1_Pos            (2UL)                     /*!< CTIMER GLOBEN: ENA1 (Bit 2)                           */
#define CTIMER_GLOBEN_ENA1_Msk            (0x4UL)                   /*!< CTIMER GLOBEN: ENA1 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENB0_Pos            (1UL)                     /*!< CTIMER GLOBEN: ENB0 (Bit 1)                           */
#define CTIMER_GLOBEN_ENB0_Msk            (0x2UL)                   /*!< CTIMER GLOBEN: ENB0 (Bitfield-Mask: 0x01)             */
#define CTIMER_GLOBEN_ENA0_Pos            (0UL)                     /*!< CTIMER GLOBEN: ENA0 (Bit 0)                           */
#define CTIMER_GLOBEN_ENA0_Msk            (0x1UL)                   /*!< CTIMER GLOBEN: ENA0 (Bitfield-Mask: 0x01)             */
/* ========================================================  OUTCFG0  ======================================================== */
#define CTIMER_OUTCFG0_CFG9_Pos           (28UL)                    /*!< CTIMER OUTCFG0: CFG9 (Bit 28)                         */
#define CTIMER_OUTCFG0_CFG9_Msk           (0x70000000UL)            /*!< CTIMER OUTCFG0: CFG9 (Bitfield-Mask: 0x07)            */
#define CTIMER_OUTCFG0_CFG8_Pos           (25UL)                    /*!< CTIMER OUTCFG0: CFG8 (Bit 25)                         */
#define CTIMER_OUTCFG0_CFG8_Msk           (0xe000000UL)             /*!< CTIMER OUTCFG0: CFG8 (Bitfield-Mask: 0x07)            */
#define CTIMER_OUTCFG0_CFG7_Pos           (22UL)                    /*!< CTIMER OUTCFG0: CFG7 (Bit 22)                         */
#define CTIMER_OUTCFG0_CFG7_Msk           (0x1c00000UL)             /*!< CTIMER OUTCFG0: CFG7 (Bitfield-Mask: 0x07)            */
#define CTIMER_OUTCFG0_CFG6_Pos           (19UL)                    /*!< CTIMER OUTCFG0: CFG6 (Bit 19)                         */
#define CTIMER_OUTCFG0_CFG6_Msk           (0x380000UL)              /*!< CTIMER OUTCFG0: CFG6 (Bitfield-Mask: 0x07)            */
#define CTIMER_OUTCFG0_CFG5_Pos           (16UL)                    /*!< CTIMER OUTCFG0: CFG5 (Bit 16)                         */
#define CTIMER_OUTCFG0_CFG5_Msk           (0x70000UL)               /*!< CTIMER OUTCFG0: CFG5 (Bitfield-Mask: 0x07)            */
#define CTIMER_OUTCFG0_CFG4_Pos           (12UL)                    /*!< CTIMER OUTCFG0: CFG4 (Bit 12)                         */
#define CTIMER_OUTCFG0_CFG4_Msk           (0x7000UL)                /*!< CTIMER OUTCFG0: CFG4 (Bitfield-Mask: 0x07)            */
#define CTIMER_OUTCFG0_CFG3_Pos           (9UL)                     /*!< CTIMER OUTCFG0: CFG3 (Bit 9)                          */
#define CTIMER_OUTCFG0_CFG3_Msk           (0xe00UL)                 /*!< CTIMER OUTCFG0: CFG3 (Bitfield-Mask: 0x07)            */
#define CTIMER_OUTCFG0_CFG2_Pos           (6UL)                     /*!< CTIMER OUTCFG0: CFG2 (Bit 6)                          */
#define CTIMER_OUTCFG0_CFG2_Msk           (0x1c0UL)                 /*!< CTIMER OUTCFG0: CFG2 (Bitfield-Mask: 0x07)            */
#define CTIMER_OUTCFG0_CFG1_Pos           (3UL)                     /*!< CTIMER OUTCFG0: CFG1 (Bit 3)                          */
#define CTIMER_OUTCFG0_CFG1_Msk           (0x38UL)                  /*!< CTIMER OUTCFG0: CFG1 (Bitfield-Mask: 0x07)            */
#define CTIMER_OUTCFG0_CFG0_Pos           (0UL)                     /*!< CTIMER OUTCFG0: CFG0 (Bit 0)                          */
#define CTIMER_OUTCFG0_CFG0_Msk           (0x7UL)                   /*!< CTIMER OUTCFG0: CFG0 (Bitfield-Mask: 0x07)            */
/* ========================================================  OUTCFG1  ======================================================== */
#define CTIMER_OUTCFG1_CFG19_Pos          (28UL)                    /*!< CTIMER OUTCFG1: CFG19 (Bit 28)                        */
#define CTIMER_OUTCFG1_CFG19_Msk          (0x70000000UL)            /*!< CTIMER OUTCFG1: CFG19 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG1_CFG18_Pos          (25UL)                    /*!< CTIMER OUTCFG1: CFG18 (Bit 25)                        */
#define CTIMER_OUTCFG1_CFG18_Msk          (0xe000000UL)             /*!< CTIMER OUTCFG1: CFG18 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG1_CFG17_Pos          (22UL)                    /*!< CTIMER OUTCFG1: CFG17 (Bit 22)                        */
#define CTIMER_OUTCFG1_CFG17_Msk          (0x1c00000UL)             /*!< CTIMER OUTCFG1: CFG17 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG1_CFG16_Pos          (19UL)                    /*!< CTIMER OUTCFG1: CFG16 (Bit 19)                        */
#define CTIMER_OUTCFG1_CFG16_Msk          (0x380000UL)              /*!< CTIMER OUTCFG1: CFG16 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG1_CFG15_Pos          (16UL)                    /*!< CTIMER OUTCFG1: CFG15 (Bit 16)                        */
#define CTIMER_OUTCFG1_CFG15_Msk          (0x70000UL)               /*!< CTIMER OUTCFG1: CFG15 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG1_CFG14_Pos          (12UL)                    /*!< CTIMER OUTCFG1: CFG14 (Bit 12)                        */
#define CTIMER_OUTCFG1_CFG14_Msk          (0x7000UL)                /*!< CTIMER OUTCFG1: CFG14 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG1_CFG13_Pos          (9UL)                     /*!< CTIMER OUTCFG1: CFG13 (Bit 9)                         */
#define CTIMER_OUTCFG1_CFG13_Msk          (0xe00UL)                 /*!< CTIMER OUTCFG1: CFG13 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG1_CFG12_Pos          (6UL)                     /*!< CTIMER OUTCFG1: CFG12 (Bit 6)                         */
#define CTIMER_OUTCFG1_CFG12_Msk          (0x1c0UL)                 /*!< CTIMER OUTCFG1: CFG12 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG1_CFG11_Pos          (3UL)                     /*!< CTIMER OUTCFG1: CFG11 (Bit 3)                         */
#define CTIMER_OUTCFG1_CFG11_Msk          (0x38UL)                  /*!< CTIMER OUTCFG1: CFG11 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG1_CFG10_Pos          (0UL)                     /*!< CTIMER OUTCFG1: CFG10 (Bit 0)                         */
#define CTIMER_OUTCFG1_CFG10_Msk          (0x7UL)                   /*!< CTIMER OUTCFG1: CFG10 (Bitfield-Mask: 0x07)           */
/* ========================================================  OUTCFG2  ======================================================== */
#define CTIMER_OUTCFG2_CFG29_Pos          (28UL)                    /*!< CTIMER OUTCFG2: CFG29 (Bit 28)                        */
#define CTIMER_OUTCFG2_CFG29_Msk          (0x70000000UL)            /*!< CTIMER OUTCFG2: CFG29 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG2_CFG28_Pos          (25UL)                    /*!< CTIMER OUTCFG2: CFG28 (Bit 25)                        */
#define CTIMER_OUTCFG2_CFG28_Msk          (0xe000000UL)             /*!< CTIMER OUTCFG2: CFG28 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG2_CFG27_Pos          (22UL)                    /*!< CTIMER OUTCFG2: CFG27 (Bit 22)                        */
#define CTIMER_OUTCFG2_CFG27_Msk          (0x1c00000UL)             /*!< CTIMER OUTCFG2: CFG27 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG2_CFG26_Pos          (19UL)                    /*!< CTIMER OUTCFG2: CFG26 (Bit 19)                        */
#define CTIMER_OUTCFG2_CFG26_Msk          (0x380000UL)              /*!< CTIMER OUTCFG2: CFG26 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG2_CFG25_Pos          (16UL)                    /*!< CTIMER OUTCFG2: CFG25 (Bit 16)                        */
#define CTIMER_OUTCFG2_CFG25_Msk          (0x70000UL)               /*!< CTIMER OUTCFG2: CFG25 (Bitfield-Mask: 0x07)           */
