tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
#define CTIMER_OUTCFG2_CFG24_Pos          (12UL)                    /*!< CTIMER OUTCFG2: CFG24 (Bit 12)                        */
#define CTIMER_OUTCFG2_CFG24_Msk          (0x7000UL)                /*!< CTIMER OUTCFG2: CFG24 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG2_CFG23_Pos          (9UL)                     /*!< CTIMER OUTCFG2: CFG23 (Bit 9)                         */
#define CTIMER_OUTCFG2_CFG23_Msk          (0xe00UL)                 /*!< CTIMER OUTCFG2: CFG23 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG2_CFG22_Pos          (6UL)                     /*!< CTIMER OUTCFG2: CFG22 (Bit 6)                         */
#define CTIMER_OUTCFG2_CFG22_Msk          (0x1c0UL)                 /*!< CTIMER OUTCFG2: CFG22 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG2_CFG21_Pos          (3UL)                     /*!< CTIMER OUTCFG2: CFG21 (Bit 3)                         */
#define CTIMER_OUTCFG2_CFG21_Msk          (0x38UL)                  /*!< CTIMER OUTCFG2: CFG21 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG2_CFG20_Pos          (0UL)                     /*!< CTIMER OUTCFG2: CFG20 (Bit 0)                         */
#define CTIMER_OUTCFG2_CFG20_Msk          (0x7UL)                   /*!< CTIMER OUTCFG2: CFG20 (Bitfield-Mask: 0x07)           */
/* ========================================================  OUTCFG3  ======================================================== */
#define CTIMER_OUTCFG3_CFG31_Pos          (3UL)                     /*!< CTIMER OUTCFG3: CFG31 (Bit 3)                         */
#define CTIMER_OUTCFG3_CFG31_Msk          (0x38UL)                  /*!< CTIMER OUTCFG3: CFG31 (Bitfield-Mask: 0x07)           */
#define CTIMER_OUTCFG3_CFG30_Pos          (0UL)                     /*!< CTIMER OUTCFG3: CFG30 (Bit 0)                         */
#define CTIMER_OUTCFG3_CFG30_Msk          (0x7UL)                   /*!< CTIMER OUTCFG3: CFG30 (Bitfield-Mask: 0x07)           */
/* =========================================================  INCFG  ========================================================= */
#define CTIMER_INCFG_CFGB7_Pos            (15UL)                    /*!< CTIMER INCFG: CFGB7 (Bit 15)                          */
#define CTIMER_INCFG_CFGB7_Msk            (0x8000UL)                /*!< CTIMER INCFG: CFGB7 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGA7_Pos            (14UL)                    /*!< CTIMER INCFG: CFGA7 (Bit 14)                          */
#define CTIMER_INCFG_CFGA7_Msk            (0x4000UL)                /*!< CTIMER INCFG: CFGA7 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGB6_Pos            (13UL)                    /*!< CTIMER INCFG: CFGB6 (Bit 13)                          */
#define CTIMER_INCFG_CFGB6_Msk            (0x2000UL)                /*!< CTIMER INCFG: CFGB6 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGA6_Pos            (12UL)                    /*!< CTIMER INCFG: CFGA6 (Bit 12)                          */
#define CTIMER_INCFG_CFGA6_Msk            (0x1000UL)                /*!< CTIMER INCFG: CFGA6 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGB5_Pos            (11UL)                    /*!< CTIMER INCFG: CFGB5 (Bit 11)                          */
#define CTIMER_INCFG_CFGB5_Msk            (0x800UL)                 /*!< CTIMER INCFG: CFGB5 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGA5_Pos            (10UL)                    /*!< CTIMER INCFG: CFGA5 (Bit 10)                          */
#define CTIMER_INCFG_CFGA5_Msk            (0x400UL)                 /*!< CTIMER INCFG: CFGA5 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGB4_Pos            (9UL)                     /*!< CTIMER INCFG: CFGB4 (Bit 9)                           */
#define CTIMER_INCFG_CFGB4_Msk            (0x200UL)                 /*!< CTIMER INCFG: CFGB4 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGA4_Pos            (8UL)                     /*!< CTIMER INCFG: CFGA4 (Bit 8)                           */
#define CTIMER_INCFG_CFGA4_Msk            (0x100UL)                 /*!< CTIMER INCFG: CFGA4 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGB3_Pos            (7UL)                     /*!< CTIMER INCFG: CFGB3 (Bit 7)                           */
#define CTIMER_INCFG_CFGB3_Msk            (0x80UL)                  /*!< CTIMER INCFG: CFGB3 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGA3_Pos            (6UL)                     /*!< CTIMER INCFG: CFGA3 (Bit 6)                           */
#define CTIMER_INCFG_CFGA3_Msk            (0x40UL)                  /*!< CTIMER INCFG: CFGA3 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGB2_Pos            (5UL)                     /*!< CTIMER INCFG: CFGB2 (Bit 5)                           */
#define CTIMER_INCFG_CFGB2_Msk            (0x20UL)                  /*!< CTIMER INCFG: CFGB2 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGA2_Pos            (4UL)                     /*!< CTIMER INCFG: CFGA2 (Bit 4)                           */
#define CTIMER_INCFG_CFGA2_Msk            (0x10UL)                  /*!< CTIMER INCFG: CFGA2 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGB1_Pos            (3UL)                     /*!< CTIMER INCFG: CFGB1 (Bit 3)                           */
#define CTIMER_INCFG_CFGB1_Msk            (0x8UL)                   /*!< CTIMER INCFG: CFGB1 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGA1_Pos            (2UL)                     /*!< CTIMER INCFG: CFGA1 (Bit 2)                           */
#define CTIMER_INCFG_CFGA1_Msk            (0x4UL)                   /*!< CTIMER INCFG: CFGA1 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGB0_Pos            (1UL)                     /*!< CTIMER INCFG: CFGB0 (Bit 1)                           */
#define CTIMER_INCFG_CFGB0_Msk            (0x2UL)                   /*!< CTIMER INCFG: CFGB0 (Bitfield-Mask: 0x01)             */
#define CTIMER_INCFG_CFGA0_Pos            (0UL)                     /*!< CTIMER INCFG: CFGA0 (Bit 0)                           */
#define CTIMER_INCFG_CFGA0_Msk            (0x1UL)                   /*!< CTIMER INCFG: CFGA0 (Bitfield-Mask: 0x01)             */
/* =========================================================  STCFG  ========================================================= */
#define CTIMER_STCFG_FREEZE_Pos           (31UL)                    /*!< CTIMER STCFG: FREEZE (Bit 31)                         */
#define CTIMER_STCFG_FREEZE_Msk           (0x80000000UL)            /*!< CTIMER STCFG: FREEZE (Bitfield-Mask: 0x01)            */
#define CTIMER_STCFG_CLEAR_Pos            (30UL)                    /*!< CTIMER STCFG: CLEAR (Bit 30)                          */
#define CTIMER_STCFG_CLEAR_Msk            (0x40000000UL)            /*!< CTIMER STCFG: CLEAR (Bitfield-Mask: 0x01)             */
#define CTIMER_STCFG_COMPARE_H_EN_Pos     (15UL)                    /*!< CTIMER STCFG: COMPARE_H_EN (Bit 15)                   */
#define CTIMER_STCFG_COMPARE_H_EN_Msk     (0x8000UL)                /*!< CTIMER STCFG: COMPARE_H_EN (Bitfield-Mask: 0x01)      */
#define CTIMER_STCFG_COMPARE_G_EN_Pos     (14UL)                    /*!< CTIMER STCFG: COMPARE_G_EN (Bit 14)                   */
#define CTIMER_STCFG_COMPARE_G_EN_Msk     (0x4000UL)                /*!< CTIMER STCFG: COMPARE_G_EN (Bitfield-Mask: 0x01)      */
#define CTIMER_STCFG_COMPARE_F_EN_Pos     (13UL)                    /*!< CTIMER STCFG: COMPARE_F_EN (Bit 13)                   */
#define CTIMER_STCFG_COMPARE_F_EN_Msk     (0x2000UL)                /*!< CTIMER STCFG: COMPARE_F_EN (Bitfield-Mask: 0x01)      */
#define CTIMER_STCFG_COMPARE_E_EN_Pos     (12UL)                    /*!< CTIMER STCFG: COMPARE_E_EN (Bit 12)                   */
#define CTIMER_STCFG_COMPARE_E_EN_Msk     (0x1000UL)                /*!< CTIMER STCFG: COMPARE_E_EN (Bitfield-Mask: 0x01)      */
#define CTIMER_STCFG_COMPARE_D_EN_Pos     (11UL)                    /*!< CTIMER STCFG: COMPARE_D_EN (Bit 11)                   */
#define CTIMER_STCFG_COMPARE_D_EN_Msk     (0x800UL)                 /*!< CTIMER STCFG: COMPARE_D_EN (Bitfield-Mask: 0x01)      */
#define CTIMER_STCFG_COMPARE_C_EN_Pos     (10UL)                    /*!< CTIMER STCFG: COMPARE_C_EN (Bit 10)                   */
#define CTIMER_STCFG_COMPARE_C_EN_Msk     (0x400UL)                 /*!< CTIMER STCFG: COMPARE_C_EN (Bitfield-Mask: 0x01)      */
#define CTIMER_STCFG_COMPARE_B_EN_Pos     (9UL)                     /*!< CTIMER STCFG: COMPARE_B_EN (Bit 9)                    */
#define CTIMER_STCFG_COMPARE_B_EN_Msk     (0x200UL)                 /*!< CTIMER STCFG: COMPARE_B_EN (Bitfield-Mask: 0x01)      */
#define CTIMER_STCFG_COMPARE_A_EN_Pos     (8UL)                     /*!< CTIMER STCFG: COMPARE_A_EN (Bit 8)                    */
#define CTIMER_STCFG_COMPARE_A_EN_Msk     (0x100UL)                 /*!< CTIMER STCFG: COMPARE_A_EN (Bitfield-Mask: 0x01)      */
#define CTIMER_STCFG_CLKSEL_Pos           (0UL)                     /*!< CTIMER STCFG: CLKSEL (Bit 0)                          */
#define CTIMER_STCFG_CLKSEL_Msk           (0xfUL)                   /*!< CTIMER STCFG: CLKSEL (Bitfield-Mask: 0x0f)            */
/* =========================================================  STTMR  ========================================================= */
#define CTIMER_STTMR_STTMR_Pos            (0UL)                     /*!< CTIMER STTMR: STTMR (Bit 0)                           */
#define CTIMER_STTMR_STTMR_Msk            (0xffffffffUL)            /*!< CTIMER STTMR: STTMR (Bitfield-Mask: 0xffffffff)       */
/* ====================================================  CAPTURECONTROL  ===================================================== */
#define CTIMER_CAPTURECONTROL_CAPTURE3_Pos (3UL)                    /*!< CTIMER CAPTURECONTROL: CAPTURE3 (Bit 3)               */
#define CTIMER_CAPTURECONTROL_CAPTURE3_Msk (0x8UL)                  /*!< CTIMER CAPTURECONTROL: CAPTURE3 (Bitfield-Mask: 0x01) */
#define CTIMER_CAPTURECONTROL_CAPTURE2_Pos (2UL)                    /*!< CTIMER CAPTURECONTROL: CAPTURE2 (Bit 2)               */
#define CTIMER_CAPTURECONTROL_CAPTURE2_Msk (0x4UL)                  /*!< CTIMER CAPTURECONTROL: CAPTURE2 (Bitfield-Mask: 0x01) */
#define CTIMER_CAPTURECONTROL_CAPTURE1_Pos (1UL)                    /*!< CTIMER CAPTURECONTROL: CAPTURE1 (Bit 1)               */
#define CTIMER_CAPTURECONTROL_CAPTURE1_Msk (0x2UL)                  /*!< CTIMER CAPTURECONTROL: CAPTURE1 (Bitfield-Mask: 0x01) */
#define CTIMER_CAPTURECONTROL_CAPTURE0_Pos (0UL)                    /*!< CTIMER CAPTURECONTROL: CAPTURE0 (Bit 0)               */
#define CTIMER_CAPTURECONTROL_CAPTURE0_Msk (0x1UL)                  /*!< CTIMER CAPTURECONTROL: CAPTURE0 (Bitfield-Mask: 0x01) */
/* ========================================================  SCMPR0  ========================================================= */
#define CTIMER_SCMPR0_SCMPR0_Pos          (0UL)                     /*!< CTIMER SCMPR0: SCMPR0 (Bit 0)                         */
#define CTIMER_SCMPR0_SCMPR0_Msk          (0xffffffffUL)            /*!< CTIMER SCMPR0: SCMPR0 (Bitfield-Mask: 0xffffffff)     */
/* ========================================================  SCMPR1  ========================================================= */
#define CTIMER_SCMPR1_SCMPR1_Pos          (0UL)                     /*!< CTIMER SCMPR1: SCMPR1 (Bit 0)                         */
#define CTIMER_SCMPR1_SCMPR1_Msk          (0xffffffffUL)            /*!< CTIMER SCMPR1: SCMPR1 (Bitfield-Mask: 0xffffffff)     */
/* ========================================================  SCMPR2  ========================================================= */
#define CTIMER_SCMPR2_SCMPR2_Pos          (0UL)                     /*!< CTIMER SCMPR2: SCMPR2 (Bit 0)                         */
#define CTIMER_SCMPR2_SCMPR2_Msk          (0xffffffffUL)            /*!< CTIMER SCMPR2: SCMPR2 (Bitfield-Mask: 0xffffffff)     */
/* ========================================================  SCMPR3  ========================================================= */
#define CTIMER_SCMPR3_SCMPR3_Pos          (0UL)                     /*!< CTIMER SCMPR3: SCMPR3 (Bit 0)                         */
#define CTIMER_SCMPR3_SCMPR3_Msk          (0xffffffffUL)            /*!< CTIMER SCMPR3: SCMPR3 (Bitfield-Mask: 0xffffffff)     */
/* ========================================================  SCMPR4  ========================================================= */
#define CTIMER_SCMPR4_SCMPR4_Pos          (0UL)                     /*!< CTIMER SCMPR4: SCMPR4 (Bit 0)                         */
#define CTIMER_SCMPR4_SCMPR4_Msk          (0xffffffffUL)            /*!< CTIMER SCMPR4: SCMPR4 (Bitfield-Mask: 0xffffffff)     */
/* ========================================================  SCMPR5  ========================================================= */
#define CTIMER_SCMPR5_SCMPR5_Pos          (0UL)                     /*!< CTIMER SCMPR5: SCMPR5 (Bit 0)                         */
#define CTIMER_SCMPR5_SCMPR5_Msk          (0xffffffffUL)            /*!< CTIMER SCMPR5: SCMPR5 (Bitfield-Mask: 0xffffffff)     */
/* ========================================================  SCMPR6  ========================================================= */
#define CTIMER_SCMPR6_SCMPR6_Pos          (0UL)                     /*!< CTIMER SCMPR6: SCMPR6 (Bit 0)                         */
#define CTIMER_SCMPR6_SCMPR6_Msk          (0xffffffffUL)            /*!< CTIMER SCMPR6: SCMPR6 (Bitfield-Mask: 0xffffffff)     */
/* ========================================================  SCMPR7  ========================================================= */
#define CTIMER_SCMPR7_SCMPR7_Pos          (0UL)                     /*!< CTIMER SCMPR7: SCMPR7 (Bit 0)                         */
#define CTIMER_SCMPR7_SCMPR7_Msk          (0xffffffffUL)            /*!< CTIMER SCMPR7: SCMPR7 (Bitfield-Mask: 0xffffffff)     */
/* ========================================================  SCAPT0  ========================================================= */
#define CTIMER_SCAPT0_SCAPT0_Pos          (0UL)                     /*!< CTIMER SCAPT0: SCAPT0 (Bit 0)                         */
#define CTIMER_SCAPT0_SCAPT0_Msk          (0xffffffffUL)            /*!< CTIMER SCAPT0: SCAPT0 (Bitfield-Mask: 0xffffffff)     */
/* ========================================================  SCAPT1  ========================================================= */
#define CTIMER_SCAPT1_SCAPT1_Pos          (0UL)                     /*!< CTIMER SCAPT1: SCAPT1 (Bit 0)                         */
#define CTIMER_SCAPT1_SCAPT1_Msk          (0xffffffffUL)            /*!< CTIMER SCAPT1: SCAPT1 (Bitfield-Mask: 0xffffffff)     */
/* ========================================================  SCAPT2  ========================================================= */
#define CTIMER_SCAPT2_SCAPT2_Pos          (0UL)                     /*!< CTIMER SCAPT2: SCAPT2 (Bit 0)                         */
#define CTIMER_SCAPT2_SCAPT2_Msk          (0xffffffffUL)            /*!< CTIMER SCAPT2: SCAPT2 (Bitfield-Mask: 0xffffffff)     */
/* ========================================================  SCAPT3  ========================================================= */
#define CTIMER_SCAPT3_SCAPT3_Pos          (0UL)                     /*!< CTIMER SCAPT3: SCAPT3 (Bit 0)                         */
#define CTIMER_SCAPT3_SCAPT3_Msk          (0xffffffffUL)            /*!< CTIMER SCAPT3: SCAPT3 (Bitfield-Mask: 0xffffffff)     */
/* =========================================================  SNVR0  ========================================================= */
#define CTIMER_SNVR0_SNVR0_Pos            (0UL)                     /*!< CTIMER SNVR0: SNVR0 (Bit 0)                           */
#define CTIMER_SNVR0_SNVR0_Msk            (0xffffffffUL)            /*!< CTIMER SNVR0: SNVR0 (Bitfield-Mask: 0xffffffff)       */
/* =========================================================  SNVR1  ========================================================= */
#define CTIMER_SNVR1_SNVR1_Pos            (0UL)                     /*!< CTIMER SNVR1: SNVR1 (Bit 0)                           */
#define CTIMER_SNVR1_SNVR1_Msk            (0xffffffffUL)            /*!< CTIMER SNVR1: SNVR1 (Bitfield-Mask: 0xffffffff)       */
/* =========================================================  SNVR2  ========================================================= */
#define CTIMER_SNVR2_SNVR2_Pos            (0UL)                     /*!< CTIMER SNVR2: SNVR2 (Bit 0)                           */
#define CTIMER_SNVR2_SNVR2_Msk            (0xffffffffUL)            /*!< CTIMER SNVR2: SNVR2 (Bitfield-Mask: 0xffffffff)       */
/* =========================================================  SNVR3  ========================================================= */
#define CTIMER_SNVR3_SNVR3_Pos            (0UL)                     /*!< CTIMER SNVR3: SNVR3 (Bit 0)                           */
#define CTIMER_SNVR3_SNVR3_Msk            (0xffffffffUL)            /*!< CTIMER SNVR3: SNVR3 (Bitfield-Mask: 0xffffffff)       */
/* =========================================================  INTEN  ========================================================= */
#define CTIMER_INTEN_CTMRB7C1INT_Pos      (31UL)                    /*!< CTIMER INTEN: CTMRB7C1INT (Bit 31)                    */
#define CTIMER_INTEN_CTMRB7C1INT_Msk      (0x80000000UL)            /*!< CTIMER INTEN: CTMRB7C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA7C1INT_Pos      (30UL)                    /*!< CTIMER INTEN: CTMRA7C1INT (Bit 30)                    */
#define CTIMER_INTEN_CTMRA7C1INT_Msk      (0x40000000UL)            /*!< CTIMER INTEN: CTMRA7C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB6C1INT_Pos      (29UL)                    /*!< CTIMER INTEN: CTMRB6C1INT (Bit 29)                    */
#define CTIMER_INTEN_CTMRB6C1INT_Msk      (0x20000000UL)            /*!< CTIMER INTEN: CTMRB6C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA6C1INT_Pos      (28UL)                    /*!< CTIMER INTEN: CTMRA6C1INT (Bit 28)                    */
#define CTIMER_INTEN_CTMRA6C1INT_Msk      (0x10000000UL)            /*!< CTIMER INTEN: CTMRA6C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB5C1INT_Pos      (27UL)                    /*!< CTIMER INTEN: CTMRB5C1INT (Bit 27)                    */
#define CTIMER_INTEN_CTMRB5C1INT_Msk      (0x8000000UL)             /*!< CTIMER INTEN: CTMRB5C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA5C1INT_Pos      (26UL)                    /*!< CTIMER INTEN: CTMRA5C1INT (Bit 26)                    */
#define CTIMER_INTEN_CTMRA5C1INT_Msk      (0x4000000UL)             /*!< CTIMER INTEN: CTMRA5C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB4C1INT_Pos      (25UL)                    /*!< CTIMER INTEN: CTMRB4C1INT (Bit 25)                    */
#define CTIMER_INTEN_CTMRB4C1INT_Msk      (0x2000000UL)             /*!< CTIMER INTEN: CTMRB4C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA4C1INT_Pos      (24UL)                    /*!< CTIMER INTEN: CTMRA4C1INT (Bit 24)                    */
#define CTIMER_INTEN_CTMRA4C1INT_Msk      (0x1000000UL)             /*!< CTIMER INTEN: CTMRA4C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB3C1INT_Pos      (23UL)                    /*!< CTIMER INTEN: CTMRB3C1INT (Bit 23)                    */
#define CTIMER_INTEN_CTMRB3C1INT_Msk      (0x800000UL)              /*!< CTIMER INTEN: CTMRB3C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA3C1INT_Pos      (22UL)                    /*!< CTIMER INTEN: CTMRA3C1INT (Bit 22)                    */
#define CTIMER_INTEN_CTMRA3C1INT_Msk      (0x400000UL)              /*!< CTIMER INTEN: CTMRA3C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB2C1INT_Pos      (21UL)                    /*!< CTIMER INTEN: CTMRB2C1INT (Bit 21)                    */
#define CTIMER_INTEN_CTMRB2C1INT_Msk      (0x200000UL)              /*!< CTIMER INTEN: CTMRB2C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA2C1INT_Pos      (20UL)                    /*!< CTIMER INTEN: CTMRA2C1INT (Bit 20)                    */
#define CTIMER_INTEN_CTMRA2C1INT_Msk      (0x100000UL)              /*!< CTIMER INTEN: CTMRA2C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB1C1INT_Pos      (19UL)                    /*!< CTIMER INTEN: CTMRB1C1INT (Bit 19)                    */
#define CTIMER_INTEN_CTMRB1C1INT_Msk      (0x80000UL)               /*!< CTIMER INTEN: CTMRB1C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA1C1INT_Pos      (18UL)                    /*!< CTIMER INTEN: CTMRA1C1INT (Bit 18)                    */
#define CTIMER_INTEN_CTMRA1C1INT_Msk      (0x40000UL)               /*!< CTIMER INTEN: CTMRA1C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB0C1INT_Pos      (17UL)                    /*!< CTIMER INTEN: CTMRB0C1INT (Bit 17)                    */
#define CTIMER_INTEN_CTMRB0C1INT_Msk      (0x20000UL)               /*!< CTIMER INTEN: CTMRB0C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA0C1INT_Pos      (16UL)                    /*!< CTIMER INTEN: CTMRA0C1INT (Bit 16)                    */
#define CTIMER_INTEN_CTMRA0C1INT_Msk      (0x10000UL)               /*!< CTIMER INTEN: CTMRA0C1INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB7C0INT_Pos      (15UL)                    /*!< CTIMER INTEN: CTMRB7C0INT (Bit 15)                    */
#define CTIMER_INTEN_CTMRB7C0INT_Msk      (0x8000UL)                /*!< CTIMER INTEN: CTMRB7C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA7C0INT_Pos      (14UL)                    /*!< CTIMER INTEN: CTMRA7C0INT (Bit 14)                    */
#define CTIMER_INTEN_CTMRA7C0INT_Msk      (0x4000UL)                /*!< CTIMER INTEN: CTMRA7C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB6C0INT_Pos      (13UL)                    /*!< CTIMER INTEN: CTMRB6C0INT (Bit 13)                    */
#define CTIMER_INTEN_CTMRB6C0INT_Msk      (0x2000UL)                /*!< CTIMER INTEN: CTMRB6C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA6C0INT_Pos      (12UL)                    /*!< CTIMER INTEN: CTMRA6C0INT (Bit 12)                    */
#define CTIMER_INTEN_CTMRA6C0INT_Msk      (0x1000UL)                /*!< CTIMER INTEN: CTMRA6C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB5C0INT_Pos      (11UL)                    /*!< CTIMER INTEN: CTMRB5C0INT (Bit 11)                    */
#define CTIMER_INTEN_CTMRB5C0INT_Msk      (0x800UL)                 /*!< CTIMER INTEN: CTMRB5C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA5C0INT_Pos      (10UL)                    /*!< CTIMER INTEN: CTMRA5C0INT (Bit 10)                    */
#define CTIMER_INTEN_CTMRA5C0INT_Msk      (0x400UL)                 /*!< CTIMER INTEN: CTMRA5C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB4C0INT_Pos      (9UL)                     /*!< CTIMER INTEN: CTMRB4C0INT (Bit 9)                     */
#define CTIMER_INTEN_CTMRB4C0INT_Msk      (0x200UL)                 /*!< CTIMER INTEN: CTMRB4C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA4C0INT_Pos      (8UL)                     /*!< CTIMER INTEN: CTMRA4C0INT (Bit 8)                     */
#define CTIMER_INTEN_CTMRA4C0INT_Msk      (0x100UL)                 /*!< CTIMER INTEN: CTMRA4C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB3C0INT_Pos      (7UL)                     /*!< CTIMER INTEN: CTMRB3C0INT (Bit 7)                     */
#define CTIMER_INTEN_CTMRB3C0INT_Msk      (0x80UL)                  /*!< CTIMER INTEN: CTMRB3C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA3C0INT_Pos      (6UL)                     /*!< CTIMER INTEN: CTMRA3C0INT (Bit 6)                     */
#define CTIMER_INTEN_CTMRA3C0INT_Msk      (0x40UL)                  /*!< CTIMER INTEN: CTMRA3C0INT (Bitfield-Mask: 0x01)       */
