tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
#define CTIMER_INTEN_CTMRB2C0INT_Pos      (5UL)                     /*!< CTIMER INTEN: CTMRB2C0INT (Bit 5)                     */
#define CTIMER_INTEN_CTMRB2C0INT_Msk      (0x20UL)                  /*!< CTIMER INTEN: CTMRB2C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA2C0INT_Pos      (4UL)                     /*!< CTIMER INTEN: CTMRA2C0INT (Bit 4)                     */
#define CTIMER_INTEN_CTMRA2C0INT_Msk      (0x10UL)                  /*!< CTIMER INTEN: CTMRA2C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB1C0INT_Pos      (3UL)                     /*!< CTIMER INTEN: CTMRB1C0INT (Bit 3)                     */
#define CTIMER_INTEN_CTMRB1C0INT_Msk      (0x8UL)                   /*!< CTIMER INTEN: CTMRB1C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA1C0INT_Pos      (2UL)                     /*!< CTIMER INTEN: CTMRA1C0INT (Bit 2)                     */
#define CTIMER_INTEN_CTMRA1C0INT_Msk      (0x4UL)                   /*!< CTIMER INTEN: CTMRA1C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRB0C0INT_Pos      (1UL)                     /*!< CTIMER INTEN: CTMRB0C0INT (Bit 1)                     */
#define CTIMER_INTEN_CTMRB0C0INT_Msk      (0x2UL)                   /*!< CTIMER INTEN: CTMRB0C0INT (Bitfield-Mask: 0x01)       */
#define CTIMER_INTEN_CTMRA0C0INT_Pos      (0UL)                     /*!< CTIMER INTEN: CTMRA0C0INT (Bit 0)                     */
#define CTIMER_INTEN_CTMRA0C0INT_Msk      (0x1UL)                   /*!< CTIMER INTEN: CTMRA0C0INT (Bitfield-Mask: 0x01)       */
/* ========================================================  INTSTAT  ======================================================== */
#define CTIMER_INTSTAT_CTMRB7C1INT_Pos    (31UL)                    /*!< CTIMER INTSTAT: CTMRB7C1INT (Bit 31)                  */
#define CTIMER_INTSTAT_CTMRB7C1INT_Msk    (0x80000000UL)            /*!< CTIMER INTSTAT: CTMRB7C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA7C1INT_Pos    (30UL)                    /*!< CTIMER INTSTAT: CTMRA7C1INT (Bit 30)                  */
#define CTIMER_INTSTAT_CTMRA7C1INT_Msk    (0x40000000UL)            /*!< CTIMER INTSTAT: CTMRA7C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB6C1INT_Pos    (29UL)                    /*!< CTIMER INTSTAT: CTMRB6C1INT (Bit 29)                  */
#define CTIMER_INTSTAT_CTMRB6C1INT_Msk    (0x20000000UL)            /*!< CTIMER INTSTAT: CTMRB6C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA6C1INT_Pos    (28UL)                    /*!< CTIMER INTSTAT: CTMRA6C1INT (Bit 28)                  */
#define CTIMER_INTSTAT_CTMRA6C1INT_Msk    (0x10000000UL)            /*!< CTIMER INTSTAT: CTMRA6C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB5C1INT_Pos    (27UL)                    /*!< CTIMER INTSTAT: CTMRB5C1INT (Bit 27)                  */
#define CTIMER_INTSTAT_CTMRB5C1INT_Msk    (0x8000000UL)             /*!< CTIMER INTSTAT: CTMRB5C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA5C1INT_Pos    (26UL)                    /*!< CTIMER INTSTAT: CTMRA5C1INT (Bit 26)                  */
#define CTIMER_INTSTAT_CTMRA5C1INT_Msk    (0x4000000UL)             /*!< CTIMER INTSTAT: CTMRA5C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB4C1INT_Pos    (25UL)                    /*!< CTIMER INTSTAT: CTMRB4C1INT (Bit 25)                  */
#define CTIMER_INTSTAT_CTMRB4C1INT_Msk    (0x2000000UL)             /*!< CTIMER INTSTAT: CTMRB4C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA4C1INT_Pos    (24UL)                    /*!< CTIMER INTSTAT: CTMRA4C1INT (Bit 24)                  */
#define CTIMER_INTSTAT_CTMRA4C1INT_Msk    (0x1000000UL)             /*!< CTIMER INTSTAT: CTMRA4C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB3C1INT_Pos    (23UL)                    /*!< CTIMER INTSTAT: CTMRB3C1INT (Bit 23)                  */
#define CTIMER_INTSTAT_CTMRB3C1INT_Msk    (0x800000UL)              /*!< CTIMER INTSTAT: CTMRB3C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA3C1INT_Pos    (22UL)                    /*!< CTIMER INTSTAT: CTMRA3C1INT (Bit 22)                  */
#define CTIMER_INTSTAT_CTMRA3C1INT_Msk    (0x400000UL)              /*!< CTIMER INTSTAT: CTMRA3C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB2C1INT_Pos    (21UL)                    /*!< CTIMER INTSTAT: CTMRB2C1INT (Bit 21)                  */
#define CTIMER_INTSTAT_CTMRB2C1INT_Msk    (0x200000UL)              /*!< CTIMER INTSTAT: CTMRB2C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA2C1INT_Pos    (20UL)                    /*!< CTIMER INTSTAT: CTMRA2C1INT (Bit 20)                  */
#define CTIMER_INTSTAT_CTMRA2C1INT_Msk    (0x100000UL)              /*!< CTIMER INTSTAT: CTMRA2C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB1C1INT_Pos    (19UL)                    /*!< CTIMER INTSTAT: CTMRB1C1INT (Bit 19)                  */
#define CTIMER_INTSTAT_CTMRB1C1INT_Msk    (0x80000UL)               /*!< CTIMER INTSTAT: CTMRB1C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA1C1INT_Pos    (18UL)                    /*!< CTIMER INTSTAT: CTMRA1C1INT (Bit 18)                  */
#define CTIMER_INTSTAT_CTMRA1C1INT_Msk    (0x40000UL)               /*!< CTIMER INTSTAT: CTMRA1C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB0C1INT_Pos    (17UL)                    /*!< CTIMER INTSTAT: CTMRB0C1INT (Bit 17)                  */
#define CTIMER_INTSTAT_CTMRB0C1INT_Msk    (0x20000UL)               /*!< CTIMER INTSTAT: CTMRB0C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA0C1INT_Pos    (16UL)                    /*!< CTIMER INTSTAT: CTMRA0C1INT (Bit 16)                  */
#define CTIMER_INTSTAT_CTMRA0C1INT_Msk    (0x10000UL)               /*!< CTIMER INTSTAT: CTMRA0C1INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB7C0INT_Pos    (15UL)                    /*!< CTIMER INTSTAT: CTMRB7C0INT (Bit 15)                  */
#define CTIMER_INTSTAT_CTMRB7C0INT_Msk    (0x8000UL)                /*!< CTIMER INTSTAT: CTMRB7C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA7C0INT_Pos    (14UL)                    /*!< CTIMER INTSTAT: CTMRA7C0INT (Bit 14)                  */
#define CTIMER_INTSTAT_CTMRA7C0INT_Msk    (0x4000UL)                /*!< CTIMER INTSTAT: CTMRA7C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB6C0INT_Pos    (13UL)                    /*!< CTIMER INTSTAT: CTMRB6C0INT (Bit 13)                  */
#define CTIMER_INTSTAT_CTMRB6C0INT_Msk    (0x2000UL)                /*!< CTIMER INTSTAT: CTMRB6C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA6C0INT_Pos    (12UL)                    /*!< CTIMER INTSTAT: CTMRA6C0INT (Bit 12)                  */
#define CTIMER_INTSTAT_CTMRA6C0INT_Msk    (0x1000UL)                /*!< CTIMER INTSTAT: CTMRA6C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB5C0INT_Pos    (11UL)                    /*!< CTIMER INTSTAT: CTMRB5C0INT (Bit 11)                  */
#define CTIMER_INTSTAT_CTMRB5C0INT_Msk    (0x800UL)                 /*!< CTIMER INTSTAT: CTMRB5C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA5C0INT_Pos    (10UL)                    /*!< CTIMER INTSTAT: CTMRA5C0INT (Bit 10)                  */
#define CTIMER_INTSTAT_CTMRA5C0INT_Msk    (0x400UL)                 /*!< CTIMER INTSTAT: CTMRA5C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB4C0INT_Pos    (9UL)                     /*!< CTIMER INTSTAT: CTMRB4C0INT (Bit 9)                   */
#define CTIMER_INTSTAT_CTMRB4C0INT_Msk    (0x200UL)                 /*!< CTIMER INTSTAT: CTMRB4C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA4C0INT_Pos    (8UL)                     /*!< CTIMER INTSTAT: CTMRA4C0INT (Bit 8)                   */
#define CTIMER_INTSTAT_CTMRA4C0INT_Msk    (0x100UL)                 /*!< CTIMER INTSTAT: CTMRA4C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB3C0INT_Pos    (7UL)                     /*!< CTIMER INTSTAT: CTMRB3C0INT (Bit 7)                   */
#define CTIMER_INTSTAT_CTMRB3C0INT_Msk    (0x80UL)                  /*!< CTIMER INTSTAT: CTMRB3C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA3C0INT_Pos    (6UL)                     /*!< CTIMER INTSTAT: CTMRA3C0INT (Bit 6)                   */
#define CTIMER_INTSTAT_CTMRA3C0INT_Msk    (0x40UL)                  /*!< CTIMER INTSTAT: CTMRA3C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB2C0INT_Pos    (5UL)                     /*!< CTIMER INTSTAT: CTMRB2C0INT (Bit 5)                   */
#define CTIMER_INTSTAT_CTMRB2C0INT_Msk    (0x20UL)                  /*!< CTIMER INTSTAT: CTMRB2C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA2C0INT_Pos    (4UL)                     /*!< CTIMER INTSTAT: CTMRA2C0INT (Bit 4)                   */
#define CTIMER_INTSTAT_CTMRA2C0INT_Msk    (0x10UL)                  /*!< CTIMER INTSTAT: CTMRA2C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB1C0INT_Pos    (3UL)                     /*!< CTIMER INTSTAT: CTMRB1C0INT (Bit 3)                   */
#define CTIMER_INTSTAT_CTMRB1C0INT_Msk    (0x8UL)                   /*!< CTIMER INTSTAT: CTMRB1C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA1C0INT_Pos    (2UL)                     /*!< CTIMER INTSTAT: CTMRA1C0INT (Bit 2)                   */
#define CTIMER_INTSTAT_CTMRA1C0INT_Msk    (0x4UL)                   /*!< CTIMER INTSTAT: CTMRA1C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRB0C0INT_Pos    (1UL)                     /*!< CTIMER INTSTAT: CTMRB0C0INT (Bit 1)                   */
#define CTIMER_INTSTAT_CTMRB0C0INT_Msk    (0x2UL)                   /*!< CTIMER INTSTAT: CTMRB0C0INT (Bitfield-Mask: 0x01)     */
#define CTIMER_INTSTAT_CTMRA0C0INT_Pos    (0UL)                     /*!< CTIMER INTSTAT: CTMRA0C0INT (Bit 0)                   */
#define CTIMER_INTSTAT_CTMRA0C0INT_Msk    (0x1UL)                   /*!< CTIMER INTSTAT: CTMRA0C0INT (Bitfield-Mask: 0x01)     */
/* ========================================================  INTCLR  ========================================================= */
#define CTIMER_INTCLR_CTMRB7C1INT_Pos     (31UL)                    /*!< CTIMER INTCLR: CTMRB7C1INT (Bit 31)                   */
#define CTIMER_INTCLR_CTMRB7C1INT_Msk     (0x80000000UL)            /*!< CTIMER INTCLR: CTMRB7C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA7C1INT_Pos     (30UL)                    /*!< CTIMER INTCLR: CTMRA7C1INT (Bit 30)                   */
#define CTIMER_INTCLR_CTMRA7C1INT_Msk     (0x40000000UL)            /*!< CTIMER INTCLR: CTMRA7C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB6C1INT_Pos     (29UL)                    /*!< CTIMER INTCLR: CTMRB6C1INT (Bit 29)                   */
#define CTIMER_INTCLR_CTMRB6C1INT_Msk     (0x20000000UL)            /*!< CTIMER INTCLR: CTMRB6C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA6C1INT_Pos     (28UL)                    /*!< CTIMER INTCLR: CTMRA6C1INT (Bit 28)                   */
#define CTIMER_INTCLR_CTMRA6C1INT_Msk     (0x10000000UL)            /*!< CTIMER INTCLR: CTMRA6C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB5C1INT_Pos     (27UL)                    /*!< CTIMER INTCLR: CTMRB5C1INT (Bit 27)                   */
#define CTIMER_INTCLR_CTMRB5C1INT_Msk     (0x8000000UL)             /*!< CTIMER INTCLR: CTMRB5C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA5C1INT_Pos     (26UL)                    /*!< CTIMER INTCLR: CTMRA5C1INT (Bit 26)                   */
#define CTIMER_INTCLR_CTMRA5C1INT_Msk     (0x4000000UL)             /*!< CTIMER INTCLR: CTMRA5C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB4C1INT_Pos     (25UL)                    /*!< CTIMER INTCLR: CTMRB4C1INT (Bit 25)                   */
#define CTIMER_INTCLR_CTMRB4C1INT_Msk     (0x2000000UL)             /*!< CTIMER INTCLR: CTMRB4C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA4C1INT_Pos     (24UL)                    /*!< CTIMER INTCLR: CTMRA4C1INT (Bit 24)                   */
#define CTIMER_INTCLR_CTMRA4C1INT_Msk     (0x1000000UL)             /*!< CTIMER INTCLR: CTMRA4C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB3C1INT_Pos     (23UL)                    /*!< CTIMER INTCLR: CTMRB3C1INT (Bit 23)                   */
#define CTIMER_INTCLR_CTMRB3C1INT_Msk     (0x800000UL)              /*!< CTIMER INTCLR: CTMRB3C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA3C1INT_Pos     (22UL)                    /*!< CTIMER INTCLR: CTMRA3C1INT (Bit 22)                   */
#define CTIMER_INTCLR_CTMRA3C1INT_Msk     (0x400000UL)              /*!< CTIMER INTCLR: CTMRA3C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB2C1INT_Pos     (21UL)                    /*!< CTIMER INTCLR: CTMRB2C1INT (Bit 21)                   */
#define CTIMER_INTCLR_CTMRB2C1INT_Msk     (0x200000UL)              /*!< CTIMER INTCLR: CTMRB2C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA2C1INT_Pos     (20UL)                    /*!< CTIMER INTCLR: CTMRA2C1INT (Bit 20)                   */
#define CTIMER_INTCLR_CTMRA2C1INT_Msk     (0x100000UL)              /*!< CTIMER INTCLR: CTMRA2C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB1C1INT_Pos     (19UL)                    /*!< CTIMER INTCLR: CTMRB1C1INT (Bit 19)                   */
#define CTIMER_INTCLR_CTMRB1C1INT_Msk     (0x80000UL)               /*!< CTIMER INTCLR: CTMRB1C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA1C1INT_Pos     (18UL)                    /*!< CTIMER INTCLR: CTMRA1C1INT (Bit 18)                   */
#define CTIMER_INTCLR_CTMRA1C1INT_Msk     (0x40000UL)               /*!< CTIMER INTCLR: CTMRA1C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB0C1INT_Pos     (17UL)                    /*!< CTIMER INTCLR: CTMRB0C1INT (Bit 17)                   */
#define CTIMER_INTCLR_CTMRB0C1INT_Msk     (0x20000UL)               /*!< CTIMER INTCLR: CTMRB0C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA0C1INT_Pos     (16UL)                    /*!< CTIMER INTCLR: CTMRA0C1INT (Bit 16)                   */
#define CTIMER_INTCLR_CTMRA0C1INT_Msk     (0x10000UL)               /*!< CTIMER INTCLR: CTMRA0C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB7C0INT_Pos     (15UL)                    /*!< CTIMER INTCLR: CTMRB7C0INT (Bit 15)                   */
#define CTIMER_INTCLR_CTMRB7C0INT_Msk     (0x8000UL)                /*!< CTIMER INTCLR: CTMRB7C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA7C0INT_Pos     (14UL)                    /*!< CTIMER INTCLR: CTMRA7C0INT (Bit 14)                   */
#define CTIMER_INTCLR_CTMRA7C0INT_Msk     (0x4000UL)                /*!< CTIMER INTCLR: CTMRA7C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB6C0INT_Pos     (13UL)                    /*!< CTIMER INTCLR: CTMRB6C0INT (Bit 13)                   */
#define CTIMER_INTCLR_CTMRB6C0INT_Msk     (0x2000UL)                /*!< CTIMER INTCLR: CTMRB6C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA6C0INT_Pos     (12UL)                    /*!< CTIMER INTCLR: CTMRA6C0INT (Bit 12)                   */
#define CTIMER_INTCLR_CTMRA6C0INT_Msk     (0x1000UL)                /*!< CTIMER INTCLR: CTMRA6C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB5C0INT_Pos     (11UL)                    /*!< CTIMER INTCLR: CTMRB5C0INT (Bit 11)                   */
#define CTIMER_INTCLR_CTMRB5C0INT_Msk     (0x800UL)                 /*!< CTIMER INTCLR: CTMRB5C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA5C0INT_Pos     (10UL)                    /*!< CTIMER INTCLR: CTMRA5C0INT (Bit 10)                   */
#define CTIMER_INTCLR_CTMRA5C0INT_Msk     (0x400UL)                 /*!< CTIMER INTCLR: CTMRA5C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB4C0INT_Pos     (9UL)                     /*!< CTIMER INTCLR: CTMRB4C0INT (Bit 9)                    */
#define CTIMER_INTCLR_CTMRB4C0INT_Msk     (0x200UL)                 /*!< CTIMER INTCLR: CTMRB4C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA4C0INT_Pos     (8UL)                     /*!< CTIMER INTCLR: CTMRA4C0INT (Bit 8)                    */
#define CTIMER_INTCLR_CTMRA4C0INT_Msk     (0x100UL)                 /*!< CTIMER INTCLR: CTMRA4C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB3C0INT_Pos     (7UL)                     /*!< CTIMER INTCLR: CTMRB3C0INT (Bit 7)                    */
#define CTIMER_INTCLR_CTMRB3C0INT_Msk     (0x80UL)                  /*!< CTIMER INTCLR: CTMRB3C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA3C0INT_Pos     (6UL)                     /*!< CTIMER INTCLR: CTMRA3C0INT (Bit 6)                    */
#define CTIMER_INTCLR_CTMRA3C0INT_Msk     (0x40UL)                  /*!< CTIMER INTCLR: CTMRA3C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB2C0INT_Pos     (5UL)                     /*!< CTIMER INTCLR: CTMRB2C0INT (Bit 5)                    */
#define CTIMER_INTCLR_CTMRB2C0INT_Msk     (0x20UL)                  /*!< CTIMER INTCLR: CTMRB2C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA2C0INT_Pos     (4UL)                     /*!< CTIMER INTCLR: CTMRA2C0INT (Bit 4)                    */
#define CTIMER_INTCLR_CTMRA2C0INT_Msk     (0x10UL)                  /*!< CTIMER INTCLR: CTMRA2C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB1C0INT_Pos     (3UL)                     /*!< CTIMER INTCLR: CTMRB1C0INT (Bit 3)                    */
#define CTIMER_INTCLR_CTMRB1C0INT_Msk     (0x8UL)                   /*!< CTIMER INTCLR: CTMRB1C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA1C0INT_Pos     (2UL)                     /*!< CTIMER INTCLR: CTMRA1C0INT (Bit 2)                    */
#define CTIMER_INTCLR_CTMRA1C0INT_Msk     (0x4UL)                   /*!< CTIMER INTCLR: CTMRA1C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRB0C0INT_Pos     (1UL)                     /*!< CTIMER INTCLR: CTMRB0C0INT (Bit 1)                    */
#define CTIMER_INTCLR_CTMRB0C0INT_Msk     (0x2UL)                   /*!< CTIMER INTCLR: CTMRB0C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTCLR_CTMRA0C0INT_Pos     (0UL)                     /*!< CTIMER INTCLR: CTMRA0C0INT (Bit 0)                    */
#define CTIMER_INTCLR_CTMRA0C0INT_Msk     (0x1UL)                   /*!< CTIMER INTCLR: CTMRA0C0INT (Bitfield-Mask: 0x01)      */
/* ========================================================  INTSET  ========================================================= */
#define CTIMER_INTSET_CTMRB7C1INT_Pos     (31UL)                    /*!< CTIMER INTSET: CTMRB7C1INT (Bit 31)                   */
#define CTIMER_INTSET_CTMRB7C1INT_Msk     (0x80000000UL)            /*!< CTIMER INTSET: CTMRB7C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRA7C1INT_Pos     (30UL)                    /*!< CTIMER INTSET: CTMRA7C1INT (Bit 30)                   */
#define CTIMER_INTSET_CTMRA7C1INT_Msk     (0x40000000UL)            /*!< CTIMER INTSET: CTMRA7C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRB6C1INT_Pos     (29UL)                    /*!< CTIMER INTSET: CTMRB6C1INT (Bit 29)                   */
#define CTIMER_INTSET_CTMRB6C1INT_Msk     (0x20000000UL)            /*!< CTIMER INTSET: CTMRB6C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRA6C1INT_Pos     (28UL)                    /*!< CTIMER INTSET: CTMRA6C1INT (Bit 28)                   */
#define CTIMER_INTSET_CTMRA6C1INT_Msk     (0x10000000UL)            /*!< CTIMER INTSET: CTMRA6C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRB5C1INT_Pos     (27UL)                    /*!< CTIMER INTSET: CTMRB5C1INT (Bit 27)                   */
#define CTIMER_INTSET_CTMRB5C1INT_Msk     (0x8000000UL)             /*!< CTIMER INTSET: CTMRB5C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRA5C1INT_Pos     (26UL)                    /*!< CTIMER INTSET: CTMRA5C1INT (Bit 26)                   */
#define CTIMER_INTSET_CTMRA5C1INT_Msk     (0x4000000UL)             /*!< CTIMER INTSET: CTMRA5C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRB4C1INT_Pos     (25UL)                    /*!< CTIMER INTSET: CTMRB4C1INT (Bit 25)                   */
#define CTIMER_INTSET_CTMRB4C1INT_Msk     (0x2000000UL)             /*!< CTIMER INTSET: CTMRB4C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRA4C1INT_Pos     (24UL)                    /*!< CTIMER INTSET: CTMRA4C1INT (Bit 24)                   */
#define CTIMER_INTSET_CTMRA4C1INT_Msk     (0x1000000UL)             /*!< CTIMER INTSET: CTMRA4C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRB3C1INT_Pos     (23UL)                    /*!< CTIMER INTSET: CTMRB3C1INT (Bit 23)                   */
#define CTIMER_INTSET_CTMRB3C1INT_Msk     (0x800000UL)              /*!< CTIMER INTSET: CTMRB3C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRA3C1INT_Pos     (22UL)                    /*!< CTIMER INTSET: CTMRA3C1INT (Bit 22)                   */
#define CTIMER_INTSET_CTMRA3C1INT_Msk     (0x400000UL)              /*!< CTIMER INTSET: CTMRA3C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRB2C1INT_Pos     (21UL)                    /*!< CTIMER INTSET: CTMRB2C1INT (Bit 21)                   */
#define CTIMER_INTSET_CTMRB2C1INT_Msk     (0x200000UL)              /*!< CTIMER INTSET: CTMRB2C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRA2C1INT_Pos     (20UL)                    /*!< CTIMER INTSET: CTMRA2C1INT (Bit 20)                   */
#define CTIMER_INTSET_CTMRA2C1INT_Msk     (0x100000UL)              /*!< CTIMER INTSET: CTMRA2C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRB1C1INT_Pos     (19UL)                    /*!< CTIMER INTSET: CTMRB1C1INT (Bit 19)                   */
#define CTIMER_INTSET_CTMRB1C1INT_Msk     (0x80000UL)               /*!< CTIMER INTSET: CTMRB1C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRA1C1INT_Pos     (18UL)                    /*!< CTIMER INTSET: CTMRA1C1INT (Bit 18)                   */
#define CTIMER_INTSET_CTMRA1C1INT_Msk     (0x40000UL)               /*!< CTIMER INTSET: CTMRA1C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRB0C1INT_Pos     (17UL)                    /*!< CTIMER INTSET: CTMRB0C1INT (Bit 17)                   */
#define CTIMER_INTSET_CTMRB0C1INT_Msk     (0x20000UL)               /*!< CTIMER INTSET: CTMRB0C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRA0C1INT_Pos     (16UL)                    /*!< CTIMER INTSET: CTMRA0C1INT (Bit 16)                   */
#define CTIMER_INTSET_CTMRA0C1INT_Msk     (0x10000UL)               /*!< CTIMER INTSET: CTMRA0C1INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRB7C0INT_Pos     (15UL)                    /*!< CTIMER INTSET: CTMRB7C0INT (Bit 15)                   */
#define CTIMER_INTSET_CTMRB7C0INT_Msk     (0x8000UL)                /*!< CTIMER INTSET: CTMRB7C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRA7C0INT_Pos     (14UL)                    /*!< CTIMER INTSET: CTMRA7C0INT (Bit 14)                   */
#define CTIMER_INTSET_CTMRA7C0INT_Msk     (0x4000UL)                /*!< CTIMER INTSET: CTMRA7C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRB6C0INT_Pos     (13UL)                    /*!< CTIMER INTSET: CTMRB6C0INT (Bit 13)                   */
#define CTIMER_INTSET_CTMRB6C0INT_Msk     (0x2000UL)                /*!< CTIMER INTSET: CTMRB6C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRA6C0INT_Pos     (12UL)                    /*!< CTIMER INTSET: CTMRA6C0INT (Bit 12)                   */
#define CTIMER_INTSET_CTMRA6C0INT_Msk     (0x1000UL)                /*!< CTIMER INTSET: CTMRA6C0INT (Bitfield-Mask: 0x01)      */
#define CTIMER_INTSET_CTMRB5C0INT_Pos     (11UL)                    /*!< CTIMER INTSET: CTMRB5C0INT (Bit 11)                   */
