tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
#define IOM0_CMD_TSIZE_Pos                (8UL)                     /*!< IOM0 CMD: TSIZE (Bit 8)                               */
#define IOM0_CMD_TSIZE_Msk                (0xfff00UL)               /*!< IOM0 CMD: TSIZE (Bitfield-Mask: 0xfff)                */
#define IOM0_CMD_CONT_Pos                 (7UL)                     /*!< IOM0 CMD: CONT (Bit 7)                                */
#define IOM0_CMD_CONT_Msk                 (0x80UL)                  /*!< IOM0 CMD: CONT (Bitfield-Mask: 0x01)                  */
#define IOM0_CMD_OFFSETCNT_Pos            (5UL)                     /*!< IOM0 CMD: OFFSETCNT (Bit 5)                           */
#define IOM0_CMD_OFFSETCNT_Msk            (0x60UL)                  /*!< IOM0 CMD: OFFSETCNT (Bitfield-Mask: 0x03)             */
#define IOM0_CMD_CMD_Pos                  (0UL)                     /*!< IOM0 CMD: CMD (Bit 0)                                 */
#define IOM0_CMD_CMD_Msk                  (0x1fUL)                  /*!< IOM0 CMD: CMD (Bitfield-Mask: 0x1f)                   */
/* ========================================================  CMDRPT  ========================================================= */
#define IOM0_CMDRPT_CMDRPT_Pos            (0UL)                     /*!< IOM0 CMDRPT: CMDRPT (Bit 0)                           */
#define IOM0_CMDRPT_CMDRPT_Msk            (0x1fUL)                  /*!< IOM0 CMDRPT: CMDRPT (Bitfield-Mask: 0x1f)             */
/* =======================================================  OFFSETHI  ======================================================== */
#define IOM0_OFFSETHI_OFFSETHI_Pos        (0UL)                     /*!< IOM0 OFFSETHI: OFFSETHI (Bit 0)                       */
#define IOM0_OFFSETHI_OFFSETHI_Msk        (0xffffUL)                /*!< IOM0 OFFSETHI: OFFSETHI (Bitfield-Mask: 0xffff)       */
/* ========================================================  CMDSTAT  ======================================================== */
#define IOM0_CMDSTAT_CTSIZE_Pos           (8UL)                     /*!< IOM0 CMDSTAT: CTSIZE (Bit 8)                          */
#define IOM0_CMDSTAT_CTSIZE_Msk           (0xfff00UL)               /*!< IOM0 CMDSTAT: CTSIZE (Bitfield-Mask: 0xfff)           */
#define IOM0_CMDSTAT_CMDSTAT_Pos          (5UL)                     /*!< IOM0 CMDSTAT: CMDSTAT (Bit 5)                         */
#define IOM0_CMDSTAT_CMDSTAT_Msk          (0xe0UL)                  /*!< IOM0 CMDSTAT: CMDSTAT (Bitfield-Mask: 0x07)           */
#define IOM0_CMDSTAT_CCMD_Pos             (0UL)                     /*!< IOM0 CMDSTAT: CCMD (Bit 0)                            */
#define IOM0_CMDSTAT_CCMD_Msk             (0x1fUL)                  /*!< IOM0 CMDSTAT: CCMD (Bitfield-Mask: 0x1f)              */
/* =======================================================  DMATRIGEN  ======================================================= */
#define IOM0_DMATRIGEN_DTHREN_Pos         (1UL)                     /*!< IOM0 DMATRIGEN: DTHREN (Bit 1)                        */
#define IOM0_DMATRIGEN_DTHREN_Msk         (0x2UL)                   /*!< IOM0 DMATRIGEN: DTHREN (Bitfield-Mask: 0x01)          */
#define IOM0_DMATRIGEN_DCMDCMPEN_Pos      (0UL)                     /*!< IOM0 DMATRIGEN: DCMDCMPEN (Bit 0)                     */
#define IOM0_DMATRIGEN_DCMDCMPEN_Msk      (0x1UL)                   /*!< IOM0 DMATRIGEN: DCMDCMPEN (Bitfield-Mask: 0x01)       */
/* ======================================================  DMATRIGSTAT  ====================================================== */
#define IOM0_DMATRIGSTAT_DTOTCMP_Pos      (2UL)                     /*!< IOM0 DMATRIGSTAT: DTOTCMP (Bit 2)                     */
#define IOM0_DMATRIGSTAT_DTOTCMP_Msk      (0x4UL)                   /*!< IOM0 DMATRIGSTAT: DTOTCMP (Bitfield-Mask: 0x01)       */
#define IOM0_DMATRIGSTAT_DTHR_Pos         (1UL)                     /*!< IOM0 DMATRIGSTAT: DTHR (Bit 1)                        */
#define IOM0_DMATRIGSTAT_DTHR_Msk         (0x2UL)                   /*!< IOM0 DMATRIGSTAT: DTHR (Bitfield-Mask: 0x01)          */
#define IOM0_DMATRIGSTAT_DCMDCMP_Pos      (0UL)                     /*!< IOM0 DMATRIGSTAT: DCMDCMP (Bit 0)                     */
#define IOM0_DMATRIGSTAT_DCMDCMP_Msk      (0x1UL)                   /*!< IOM0 DMATRIGSTAT: DCMDCMP (Bitfield-Mask: 0x01)       */
/* ========================================================  DMACFG  ========================================================= */
#define IOM0_DMACFG_DPWROFF_Pos           (9UL)                     /*!< IOM0 DMACFG: DPWROFF (Bit 9)                          */
#define IOM0_DMACFG_DPWROFF_Msk           (0x200UL)                 /*!< IOM0 DMACFG: DPWROFF (Bitfield-Mask: 0x01)            */
#define IOM0_DMACFG_DMAPRI_Pos            (8UL)                     /*!< IOM0 DMACFG: DMAPRI (Bit 8)                           */
#define IOM0_DMACFG_DMAPRI_Msk            (0x100UL)                 /*!< IOM0 DMACFG: DMAPRI (Bitfield-Mask: 0x01)             */
#define IOM0_DMACFG_DMADIR_Pos            (1UL)                     /*!< IOM0 DMACFG: DMADIR (Bit 1)                           */
#define IOM0_DMACFG_DMADIR_Msk            (0x2UL)                   /*!< IOM0 DMACFG: DMADIR (Bitfield-Mask: 0x01)             */
#define IOM0_DMACFG_DMAEN_Pos             (0UL)                     /*!< IOM0 DMACFG: DMAEN (Bit 0)                            */
#define IOM0_DMACFG_DMAEN_Msk             (0x1UL)                   /*!< IOM0 DMACFG: DMAEN (Bitfield-Mask: 0x01)              */
/* ======================================================  DMATOTCOUNT  ====================================================== */
#define IOM0_DMATOTCOUNT_TOTCOUNT_Pos     (0UL)                     /*!< IOM0 DMATOTCOUNT: TOTCOUNT (Bit 0)                    */
#define IOM0_DMATOTCOUNT_TOTCOUNT_Msk     (0xfffUL)                 /*!< IOM0 DMATOTCOUNT: TOTCOUNT (Bitfield-Mask: 0xfff)     */
/* ======================================================  DMATARGADDR  ====================================================== */
#define IOM0_DMATARGADDR_TARGADDR28_Pos   (28UL)                    /*!< IOM0 DMATARGADDR: TARGADDR28 (Bit 28)                 */
#define IOM0_DMATARGADDR_TARGADDR28_Msk   (0x10000000UL)            /*!< IOM0 DMATARGADDR: TARGADDR28 (Bitfield-Mask: 0x01)    */
#define IOM0_DMATARGADDR_TARGADDR_Pos     (0UL)                     /*!< IOM0 DMATARGADDR: TARGADDR (Bit 0)                    */
#define IOM0_DMATARGADDR_TARGADDR_Msk     (0xfffffUL)               /*!< IOM0 DMATARGADDR: TARGADDR (Bitfield-Mask: 0xfffff)   */
/* ========================================================  DMASTAT  ======================================================== */
#define IOM0_DMASTAT_DMAERR_Pos           (2UL)                     /*!< IOM0 DMASTAT: DMAERR (Bit 2)                          */
#define IOM0_DMASTAT_DMAERR_Msk           (0x4UL)                   /*!< IOM0 DMASTAT: DMAERR (Bitfield-Mask: 0x01)            */
#define IOM0_DMASTAT_DMACPL_Pos           (1UL)                     /*!< IOM0 DMASTAT: DMACPL (Bit 1)                          */
#define IOM0_DMASTAT_DMACPL_Msk           (0x2UL)                   /*!< IOM0 DMASTAT: DMACPL (Bitfield-Mask: 0x01)            */
#define IOM0_DMASTAT_DMATIP_Pos           (0UL)                     /*!< IOM0 DMASTAT: DMATIP (Bit 0)                          */
#define IOM0_DMASTAT_DMATIP_Msk           (0x1UL)                   /*!< IOM0 DMASTAT: DMATIP (Bitfield-Mask: 0x01)            */
/* =========================================================  CQCFG  ========================================================= */
#define IOM0_CQCFG_CQPRI_Pos              (1UL)                     /*!< IOM0 CQCFG: CQPRI (Bit 1)                             */
#define IOM0_CQCFG_CQPRI_Msk              (0x2UL)                   /*!< IOM0 CQCFG: CQPRI (Bitfield-Mask: 0x01)               */
#define IOM0_CQCFG_CQEN_Pos               (0UL)                     /*!< IOM0 CQCFG: CQEN (Bit 0)                              */
#define IOM0_CQCFG_CQEN_Msk               (0x1UL)                   /*!< IOM0 CQCFG: CQEN (Bitfield-Mask: 0x01)                */
/* ========================================================  CQADDR  ========================================================= */
#define IOM0_CQADDR_CQADDR28_Pos          (28UL)                    /*!< IOM0 CQADDR: CQADDR28 (Bit 28)                        */
#define IOM0_CQADDR_CQADDR28_Msk          (0x10000000UL)            /*!< IOM0 CQADDR: CQADDR28 (Bitfield-Mask: 0x01)           */
#define IOM0_CQADDR_CQADDR_Pos            (2UL)                     /*!< IOM0 CQADDR: CQADDR (Bit 2)                           */
#define IOM0_CQADDR_CQADDR_Msk            (0xffffcUL)               /*!< IOM0 CQADDR: CQADDR (Bitfield-Mask: 0x3ffff)          */
/* ========================================================  CQSTAT  ========================================================= */
#define IOM0_CQSTAT_CQERR_Pos             (2UL)                     /*!< IOM0 CQSTAT: CQERR (Bit 2)                            */
#define IOM0_CQSTAT_CQERR_Msk             (0x4UL)                   /*!< IOM0 CQSTAT: CQERR (Bitfield-Mask: 0x01)              */
#define IOM0_CQSTAT_CQPAUSED_Pos          (1UL)                     /*!< IOM0 CQSTAT: CQPAUSED (Bit 1)                         */
#define IOM0_CQSTAT_CQPAUSED_Msk          (0x2UL)                   /*!< IOM0 CQSTAT: CQPAUSED (Bitfield-Mask: 0x01)           */
#define IOM0_CQSTAT_CQTIP_Pos             (0UL)                     /*!< IOM0 CQSTAT: CQTIP (Bit 0)                            */
#define IOM0_CQSTAT_CQTIP_Msk             (0x1UL)                   /*!< IOM0 CQSTAT: CQTIP (Bitfield-Mask: 0x01)              */
/* ========================================================  CQFLAGS  ======================================================== */
#define IOM0_CQFLAGS_CQIRQMASK_Pos        (16UL)                    /*!< IOM0 CQFLAGS: CQIRQMASK (Bit 16)                      */
#define IOM0_CQFLAGS_CQIRQMASK_Msk        (0xffff0000UL)            /*!< IOM0 CQFLAGS: CQIRQMASK (Bitfield-Mask: 0xffff)       */
#define IOM0_CQFLAGS_CQFLAGS_Pos          (0UL)                     /*!< IOM0 CQFLAGS: CQFLAGS (Bit 0)                         */
#define IOM0_CQFLAGS_CQFLAGS_Msk          (0xffffUL)                /*!< IOM0 CQFLAGS: CQFLAGS (Bitfield-Mask: 0xffff)         */
/* ======================================================  CQSETCLEAR  ======================================================= */
#define IOM0_CQSETCLEAR_CQFCLR_Pos        (16UL)                    /*!< IOM0 CQSETCLEAR: CQFCLR (Bit 16)                      */
#define IOM0_CQSETCLEAR_CQFCLR_Msk        (0xff0000UL)              /*!< IOM0 CQSETCLEAR: CQFCLR (Bitfield-Mask: 0xff)         */
#define IOM0_CQSETCLEAR_CQFTGL_Pos        (8UL)                     /*!< IOM0 CQSETCLEAR: CQFTGL (Bit 8)                       */
#define IOM0_CQSETCLEAR_CQFTGL_Msk        (0xff00UL)                /*!< IOM0 CQSETCLEAR: CQFTGL (Bitfield-Mask: 0xff)         */
#define IOM0_CQSETCLEAR_CQFSET_Pos        (0UL)                     /*!< IOM0 CQSETCLEAR: CQFSET (Bit 0)                       */
#define IOM0_CQSETCLEAR_CQFSET_Msk        (0xffUL)                  /*!< IOM0 CQSETCLEAR: CQFSET (Bitfield-Mask: 0xff)         */
/* =======================================================  CQPAUSEEN  ======================================================= */
#define IOM0_CQPAUSEEN_CQPEN_Pos          (0UL)                     /*!< IOM0 CQPAUSEEN: CQPEN (Bit 0)                         */
#define IOM0_CQPAUSEEN_CQPEN_Msk          (0xffffUL)                /*!< IOM0 CQPAUSEEN: CQPEN (Bitfield-Mask: 0xffff)         */
/* =======================================================  CQCURIDX  ======================================================== */
#define IOM0_CQCURIDX_CQCURIDX_Pos        (0UL)                     /*!< IOM0 CQCURIDX: CQCURIDX (Bit 0)                       */
#define IOM0_CQCURIDX_CQCURIDX_Msk        (0xffUL)                  /*!< IOM0 CQCURIDX: CQCURIDX (Bitfield-Mask: 0xff)         */
/* =======================================================  CQENDIDX  ======================================================== */
#define IOM0_CQENDIDX_CQENDIDX_Pos        (0UL)                     /*!< IOM0 CQENDIDX: CQENDIDX (Bit 0)                       */
#define IOM0_CQENDIDX_CQENDIDX_Msk        (0xffUL)                  /*!< IOM0 CQENDIDX: CQENDIDX (Bitfield-Mask: 0xff)         */
/* ========================================================  STATUS  ========================================================= */
#define IOM0_STATUS_IDLEST_Pos            (2UL)                     /*!< IOM0 STATUS: IDLEST (Bit 2)                           */
#define IOM0_STATUS_IDLEST_Msk            (0x4UL)                   /*!< IOM0 STATUS: IDLEST (Bitfield-Mask: 0x01)             */
#define IOM0_STATUS_CMDACT_Pos            (1UL)                     /*!< IOM0 STATUS: CMDACT (Bit 1)                           */
#define IOM0_STATUS_CMDACT_Msk            (0x2UL)                   /*!< IOM0 STATUS: CMDACT (Bitfield-Mask: 0x01)             */
#define IOM0_STATUS_ERR_Pos               (0UL)                     /*!< IOM0 STATUS: ERR (Bit 0)                              */
#define IOM0_STATUS_ERR_Msk               (0x1UL)                   /*!< IOM0 STATUS: ERR (Bitfield-Mask: 0x01)                */
/* ========================================================  MSPICFG  ======================================================== */
#define IOM0_MSPICFG_MSPIRST_Pos          (30UL)                    /*!< IOM0 MSPICFG: MSPIRST (Bit 30)                        */
#define IOM0_MSPICFG_MSPIRST_Msk          (0x40000000UL)            /*!< IOM0 MSPICFG: MSPIRST (Bitfield-Mask: 0x01)           */
#define IOM0_MSPICFG_DOUTDLY_Pos          (27UL)                    /*!< IOM0 MSPICFG: DOUTDLY (Bit 27)                        */
#define IOM0_MSPICFG_DOUTDLY_Msk          (0x38000000UL)            /*!< IOM0 MSPICFG: DOUTDLY (Bitfield-Mask: 0x07)           */
#define IOM0_MSPICFG_DINDLY_Pos           (24UL)                    /*!< IOM0 MSPICFG: DINDLY (Bit 24)                         */
#define IOM0_MSPICFG_DINDLY_Msk           (0x7000000UL)             /*!< IOM0 MSPICFG: DINDLY (Bitfield-Mask: 0x07)            */
#define IOM0_MSPICFG_SPILSB_Pos           (23UL)                    /*!< IOM0 MSPICFG: SPILSB (Bit 23)                         */
#define IOM0_MSPICFG_SPILSB_Msk           (0x800000UL)              /*!< IOM0 MSPICFG: SPILSB (Bitfield-Mask: 0x01)            */
#define IOM0_MSPICFG_RDFCPOL_Pos          (22UL)                    /*!< IOM0 MSPICFG: RDFCPOL (Bit 22)                        */
#define IOM0_MSPICFG_RDFCPOL_Msk          (0x400000UL)              /*!< IOM0 MSPICFG: RDFCPOL (Bitfield-Mask: 0x01)           */
#define IOM0_MSPICFG_WTFCPOL_Pos          (21UL)                    /*!< IOM0 MSPICFG: WTFCPOL (Bit 21)                        */
#define IOM0_MSPICFG_WTFCPOL_Msk          (0x200000UL)              /*!< IOM0 MSPICFG: WTFCPOL (Bitfield-Mask: 0x01)           */
#define IOM0_MSPICFG_WTFCIRQ_Pos          (20UL)                    /*!< IOM0 MSPICFG: WTFCIRQ (Bit 20)                        */
#define IOM0_MSPICFG_WTFCIRQ_Msk          (0x100000UL)              /*!< IOM0 MSPICFG: WTFCIRQ (Bitfield-Mask: 0x01)           */
#define IOM0_MSPICFG_MOSIINV_Pos          (18UL)                    /*!< IOM0 MSPICFG: MOSIINV (Bit 18)                        */
#define IOM0_MSPICFG_MOSIINV_Msk          (0x40000UL)               /*!< IOM0 MSPICFG: MOSIINV (Bitfield-Mask: 0x01)           */
#define IOM0_MSPICFG_RDFC_Pos             (17UL)                    /*!< IOM0 MSPICFG: RDFC (Bit 17)                           */
#define IOM0_MSPICFG_RDFC_Msk             (0x20000UL)               /*!< IOM0 MSPICFG: RDFC (Bitfield-Mask: 0x01)              */
#define IOM0_MSPICFG_WTFC_Pos             (16UL)                    /*!< IOM0 MSPICFG: WTFC (Bit 16)                           */
#define IOM0_MSPICFG_WTFC_Msk             (0x10000UL)               /*!< IOM0 MSPICFG: WTFC (Bitfield-Mask: 0x01)              */
#define IOM0_MSPICFG_FULLDUP_Pos          (2UL)                     /*!< IOM0 MSPICFG: FULLDUP (Bit 2)                         */
#define IOM0_MSPICFG_FULLDUP_Msk          (0x4UL)                   /*!< IOM0 MSPICFG: FULLDUP (Bitfield-Mask: 0x01)           */
#define IOM0_MSPICFG_SPHA_Pos             (1UL)                     /*!< IOM0 MSPICFG: SPHA (Bit 1)                            */
#define IOM0_MSPICFG_SPHA_Msk             (0x2UL)                   /*!< IOM0 MSPICFG: SPHA (Bitfield-Mask: 0x01)              */
#define IOM0_MSPICFG_SPOL_Pos             (0UL)                     /*!< IOM0 MSPICFG: SPOL (Bit 0)                            */
#define IOM0_MSPICFG_SPOL_Msk             (0x1UL)                   /*!< IOM0 MSPICFG: SPOL (Bitfield-Mask: 0x01)              */
/* ========================================================  MI2CCFG  ======================================================== */
#define IOM0_MI2CCFG_STRDIS_Pos           (24UL)                    /*!< IOM0 MI2CCFG: STRDIS (Bit 24)                         */
#define IOM0_MI2CCFG_STRDIS_Msk           (0x1000000UL)             /*!< IOM0 MI2CCFG: STRDIS (Bitfield-Mask: 0x01)            */
#define IOM0_MI2CCFG_SMPCNT_Pos           (16UL)                    /*!< IOM0 MI2CCFG: SMPCNT (Bit 16)                         */
#define IOM0_MI2CCFG_SMPCNT_Msk           (0xff0000UL)              /*!< IOM0 MI2CCFG: SMPCNT (Bitfield-Mask: 0xff)            */
#define IOM0_MI2CCFG_SDAENDLY_Pos         (12UL)                    /*!< IOM0 MI2CCFG: SDAENDLY (Bit 12)                       */
#define IOM0_MI2CCFG_SDAENDLY_Msk         (0xf000UL)                /*!< IOM0 MI2CCFG: SDAENDLY (Bitfield-Mask: 0x0f)          */
#define IOM0_MI2CCFG_SCLENDLY_Pos         (8UL)                     /*!< IOM0 MI2CCFG: SCLENDLY (Bit 8)                        */
#define IOM0_MI2CCFG_SCLENDLY_Msk         (0xf00UL)                 /*!< IOM0 MI2CCFG: SCLENDLY (Bitfield-Mask: 0x0f)          */
#define IOM0_MI2CCFG_MI2CRST_Pos          (6UL)                     /*!< IOM0 MI2CCFG: MI2CRST (Bit 6)                         */
#define IOM0_MI2CCFG_MI2CRST_Msk          (0x40UL)                  /*!< IOM0 MI2CCFG: MI2CRST (Bitfield-Mask: 0x01)           */
#define IOM0_MI2CCFG_SDADLY_Pos           (4UL)                     /*!< IOM0 MI2CCFG: SDADLY (Bit 4)                          */
#define IOM0_MI2CCFG_SDADLY_Msk           (0x30UL)                  /*!< IOM0 MI2CCFG: SDADLY (Bitfield-Mask: 0x03)            */
#define IOM0_MI2CCFG_ARBEN_Pos            (2UL)                     /*!< IOM0 MI2CCFG: ARBEN (Bit 2)                           */
#define IOM0_MI2CCFG_ARBEN_Msk            (0x4UL)                   /*!< IOM0 MI2CCFG: ARBEN (Bitfield-Mask: 0x01)             */
#define IOM0_MI2CCFG_I2CLSB_Pos           (1UL)                     /*!< IOM0 MI2CCFG: I2CLSB (Bit 1)                          */
#define IOM0_MI2CCFG_I2CLSB_Msk           (0x2UL)                   /*!< IOM0 MI2CCFG: I2CLSB (Bitfield-Mask: 0x01)            */
#define IOM0_MI2CCFG_ADDRSZ_Pos           (0UL)                     /*!< IOM0 MI2CCFG: ADDRSZ (Bit 0)                          */
#define IOM0_MI2CCFG_ADDRSZ_Msk           (0x1UL)                   /*!< IOM0 MI2CCFG: ADDRSZ (Bitfield-Mask: 0x01)            */
/* ========================================================  DEVCFG  ========================================================= */
#define IOM0_DEVCFG_DEVADDR_Pos           (0UL)                     /*!< IOM0 DEVCFG: DEVADDR (Bit 0)                          */
#define IOM0_DEVCFG_DEVADDR_Msk           (0x3ffUL)                 /*!< IOM0 DEVCFG: DEVADDR (Bitfield-Mask: 0x3ff)           */
/* ========================================================  IOMDBG  ========================================================= */
#define IOM0_IOMDBG_DBGDATA_Pos           (3UL)                     /*!< IOM0 IOMDBG: DBGDATA (Bit 3)                          */
#define IOM0_IOMDBG_DBGDATA_Msk           (0xfffffff8UL)            /*!< IOM0 IOMDBG: DBGDATA (Bitfield-Mask: 0x1fffffff)      */
#define IOM0_IOMDBG_APBCLKON_Pos          (2UL)                     /*!< IOM0 IOMDBG: APBCLKON (Bit 2)                         */
#define IOM0_IOMDBG_APBCLKON_Msk          (0x4UL)                   /*!< IOM0 IOMDBG: APBCLKON (Bitfield-Mask: 0x01)           */
#define IOM0_IOMDBG_IOCLKON_Pos           (1UL)                     /*!< IOM0 IOMDBG: IOCLKON (Bit 1)                          */
#define IOM0_IOMDBG_IOCLKON_Msk           (0x2UL)                   /*!< IOM0 IOMDBG: IOCLKON (Bitfield-Mask: 0x01)            */
#define IOM0_IOMDBG_DBGEN_Pos             (0UL)                     /*!< IOM0 IOMDBG: DBGEN (Bit 0)                            */
#define IOM0_IOMDBG_DBGEN_Msk             (0x1UL)                   /*!< IOM0 IOMDBG: DBGEN (Bitfield-Mask: 0x01)              */


/* =========================================================================================================================== */
/* ================                                          IOSLAVE                                          ================ */
/* =========================================================================================================================== */

