tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* =======================================================  SRAMMODE  ======================================================== */
#define MCUCTRL_SRAMMODE_DPREFETCH_CACHE_Pos (5UL)                  /*!< MCUCTRL SRAMMODE: DPREFETCH_CACHE (Bit 5)             */
#define MCUCTRL_SRAMMODE_DPREFETCH_CACHE_Msk (0x20UL)               /*!< MCUCTRL SRAMMODE: DPREFETCH_CACHE (Bitfield-Mask: 0x01) */
#define MCUCTRL_SRAMMODE_DPREFETCH_Pos    (4UL)                     /*!< MCUCTRL SRAMMODE: DPREFETCH (Bit 4)                   */
#define MCUCTRL_SRAMMODE_DPREFETCH_Msk    (0x10UL)                  /*!< MCUCTRL SRAMMODE: DPREFETCH (Bitfield-Mask: 0x01)     */
#define MCUCTRL_SRAMMODE_IPREFETCH_CACHE_Pos (1UL)                  /*!< MCUCTRL SRAMMODE: IPREFETCH_CACHE (Bit 1)             */
#define MCUCTRL_SRAMMODE_IPREFETCH_CACHE_Msk (0x2UL)                /*!< MCUCTRL SRAMMODE: IPREFETCH_CACHE (Bitfield-Mask: 0x01) */
#define MCUCTRL_SRAMMODE_IPREFETCH_Pos    (0UL)                     /*!< MCUCTRL SRAMMODE: IPREFETCH (Bit 0)                   */
#define MCUCTRL_SRAMMODE_IPREFETCH_Msk    (0x1UL)                   /*!< MCUCTRL SRAMMODE: IPREFETCH (Bitfield-Mask: 0x01)     */
/* ======================================================  KEXTCLKSEL  ======================================================= */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Pos (0UL)                     /*!< MCUCTRL KEXTCLKSEL: KEXTCLKSEL (Bit 0)                */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Msk (0xffffffffUL)            /*!< MCUCTRL KEXTCLKSEL: KEXTCLKSEL (Bitfield-Mask: 0xffffffff) */
/* =======================================================  SIMOBUCK4  ======================================================= */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKIBIASTRIM_Pos (28UL)              /*!< MCUCTRL SIMOBUCK4: SIMOBUCKIBIASTRIM (Bit 28)         */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKIBIASTRIM_Msk (0xf0000000UL)      /*!< MCUCTRL SIMOBUCK4: SIMOBUCKIBIASTRIM (Bitfield-Mask: 0x0f) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKUVLOMODE_Pos (26UL)               /*!< MCUCTRL SIMOBUCK4: SIMOBUCKUVLOMODE (Bit 26)          */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKUVLOMODE_Msk (0xc000000UL)        /*!< MCUCTRL SIMOBUCK4: SIMOBUCKUVLOMODE (Bitfield-Mask: 0x03) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKPRIORITYSEL_Pos (25UL)            /*!< MCUCTRL SIMOBUCK4: SIMOBUCKPRIORITYSEL (Bit 25)       */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKPRIORITYSEL_Msk (0x2000000UL)     /*!< MCUCTRL SIMOBUCK4: SIMOBUCKPRIORITYSEL (Bitfield-Mask: 0x01) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKCOMP2TIMEOUTEN_Pos (24UL)         /*!< MCUCTRL SIMOBUCK4: SIMOBUCKCOMP2TIMEOUTEN (Bit 24)    */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKCOMP2TIMEOUTEN_Msk (0x1000000UL)  /*!< MCUCTRL SIMOBUCK4: SIMOBUCKCOMP2TIMEOUTEN (Bitfield-Mask: 0x01) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKCOMP2LPEN_Pos (23UL)              /*!< MCUCTRL SIMOBUCK4: SIMOBUCKCOMP2LPEN (Bit 23)         */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKCOMP2LPEN_Msk (0x800000UL)        /*!< MCUCTRL SIMOBUCK4: SIMOBUCKCOMP2LPEN (Bitfield-Mask: 0x01) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKCLKDIVSEL_Pos (21UL)              /*!< MCUCTRL SIMOBUCK4: SIMOBUCKCLKDIVSEL (Bit 21)         */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKCLKDIVSEL_Msk (0x600000UL)        /*!< MCUCTRL SIMOBUCK4: SIMOBUCKCLKDIVSEL (Bitfield-Mask: 0x03) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKEXTCLKSEL_Pos (20UL)              /*!< MCUCTRL SIMOBUCK4: SIMOBUCKEXTCLKSEL (Bit 20)         */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKEXTCLKSEL_Msk (0x100000UL)        /*!< MCUCTRL SIMOBUCK4: SIMOBUCKEXTCLKSEL (Bitfield-Mask: 0x01) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKUVLODRVSTRTRIM_Pos (17UL)         /*!< MCUCTRL SIMOBUCK4: SIMOBUCKUVLODRVSTRTRIM (Bit 17)    */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKUVLODRVSTRTRIM_Msk (0xe0000UL)    /*!< MCUCTRL SIMOBUCK4: SIMOBUCKUVLODRVSTRTRIM (Bitfield-Mask: 0x07) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKUVLOCNTRTRIM_Pos (14UL)           /*!< MCUCTRL SIMOBUCK4: SIMOBUCKUVLOCNTRTRIM (Bit 14)      */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKUVLOCNTRTRIM_Msk (0x1c000UL)      /*!< MCUCTRL SIMOBUCK4: SIMOBUCKUVLOCNTRTRIM (Bitfield-Mask: 0x07) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKZXTRIM_Pos (10UL)                 /*!< MCUCTRL SIMOBUCK4: SIMOBUCKZXTRIM (Bit 10)            */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKZXTRIM_Msk (0x3c00UL)             /*!< MCUCTRL SIMOBUCK4: SIMOBUCKZXTRIM (Bitfield-Mask: 0x0f) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKMEMLEAKAGETRIM_Pos (8UL)          /*!< MCUCTRL SIMOBUCK4: SIMOBUCKMEMLEAKAGETRIM (Bit 8)     */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKMEMLEAKAGETRIM_Msk (0x300UL)      /*!< MCUCTRL SIMOBUCK4: SIMOBUCKMEMLEAKAGETRIM (Bitfield-Mask: 0x03) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKMEMLPDRVSTRTRIM_Pos (6UL)         /*!< MCUCTRL SIMOBUCK4: SIMOBUCKMEMLPDRVSTRTRIM (Bit 6)    */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKMEMLPDRVSTRTRIM_Msk (0xc0UL)      /*!< MCUCTRL SIMOBUCK4: SIMOBUCKMEMLPDRVSTRTRIM (Bitfield-Mask: 0x03) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKMEMACTDRVSTRTRIM_Pos (4UL)        /*!< MCUCTRL SIMOBUCK4: SIMOBUCKMEMACTDRVSTRTRIM (Bit 4)   */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKMEMACTDRVSTRTRIM_Msk (0x30UL)     /*!< MCUCTRL SIMOBUCK4: SIMOBUCKMEMACTDRVSTRTRIM (Bitfield-Mask: 0x03) */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKMEMLPLOWTONTRIM_Pos (0UL)         /*!< MCUCTRL SIMOBUCK4: SIMOBUCKMEMLPLOWTONTRIM (Bit 0)    */
#define MCUCTRL_SIMOBUCK4_SIMOBUCKMEMLPLOWTONTRIM_Msk (0xfUL)       /*!< MCUCTRL SIMOBUCK4: SIMOBUCKMEMLPLOWTONTRIM (Bitfield-Mask: 0x0f) */
/* =======================================================  BLEBUCK2  ======================================================== */
#define MCUCTRL_BLEBUCK2_BLEBUCKTOND2ATRIM_Pos (12UL)               /*!< MCUCTRL BLEBUCK2: BLEBUCKTOND2ATRIM (Bit 12)          */
#define MCUCTRL_BLEBUCK2_BLEBUCKTOND2ATRIM_Msk (0x3f000UL)          /*!< MCUCTRL BLEBUCK2: BLEBUCKTOND2ATRIM (Bitfield-Mask: 0x3f) */
#define MCUCTRL_BLEBUCK2_BLEBUCKTONHITRIM_Pos (6UL)                 /*!< MCUCTRL BLEBUCK2: BLEBUCKTONHITRIM (Bit 6)            */
#define MCUCTRL_BLEBUCK2_BLEBUCKTONHITRIM_Msk (0xfc0UL)             /*!< MCUCTRL BLEBUCK2: BLEBUCKTONHITRIM (Bitfield-Mask: 0x3f) */
#define MCUCTRL_BLEBUCK2_BLEBUCKTONLOWTRIM_Pos (0UL)                /*!< MCUCTRL BLEBUCK2: BLEBUCKTONLOWTRIM (Bit 0)           */
#define MCUCTRL_BLEBUCK2_BLEBUCKTONLOWTRIM_Msk (0x3fUL)             /*!< MCUCTRL BLEBUCK2: BLEBUCKTONLOWTRIM (Bitfield-Mask: 0x3f) */
/* ======================================================  FLASHWPROT0  ====================================================== */
#define MCUCTRL_FLASHWPROT0_FW0BITS_Pos   (0UL)                     /*!< MCUCTRL FLASHWPROT0: FW0BITS (Bit 0)                  */
#define MCUCTRL_FLASHWPROT0_FW0BITS_Msk   (0xffffffffUL)            /*!< MCUCTRL FLASHWPROT0: FW0BITS (Bitfield-Mask: 0xffffffff) */
/* ======================================================  FLASHWPROT1  ====================================================== */
#define MCUCTRL_FLASHWPROT1_FW1BITS_Pos   (0UL)                     /*!< MCUCTRL FLASHWPROT1: FW1BITS (Bit 0)                  */
#define MCUCTRL_FLASHWPROT1_FW1BITS_Msk   (0xffffffffUL)            /*!< MCUCTRL FLASHWPROT1: FW1BITS (Bitfield-Mask: 0xffffffff) */
/* ======================================================  FLASHRPROT0  ====================================================== */
#define MCUCTRL_FLASHRPROT0_FR0BITS_Pos   (0UL)                     /*!< MCUCTRL FLASHRPROT0: FR0BITS (Bit 0)                  */
#define MCUCTRL_FLASHRPROT0_FR0BITS_Msk   (0xffffffffUL)            /*!< MCUCTRL FLASHRPROT0: FR0BITS (Bitfield-Mask: 0xffffffff) */
/* ======================================================  FLASHRPROT1  ====================================================== */
#define MCUCTRL_FLASHRPROT1_FR1BITS_Pos   (0UL)                     /*!< MCUCTRL FLASHRPROT1: FR1BITS (Bit 0)                  */
#define MCUCTRL_FLASHRPROT1_FR1BITS_Msk   (0xffffffffUL)            /*!< MCUCTRL FLASHRPROT1: FR1BITS (Bitfield-Mask: 0xffffffff) */
/* =================================================  DMASRAMWRITEPROTECT0  ================================================== */
#define MCUCTRL_DMASRAMWRITEPROTECT0_DMA_WPROT0_Pos (0UL)           /*!< MCUCTRL DMASRAMWRITEPROTECT0: DMA_WPROT0 (Bit 0)      */
#define MCUCTRL_DMASRAMWRITEPROTECT0_DMA_WPROT0_Msk (0xffffffffUL)  /*!< MCUCTRL DMASRAMWRITEPROTECT0: DMA_WPROT0 (Bitfield-Mask: 0xffffffff) */
/* =================================================  DMASRAMWRITEPROTECT1  ================================================== */
#define MCUCTRL_DMASRAMWRITEPROTECT1_DMA_WPROT1_Pos (0UL)           /*!< MCUCTRL DMASRAMWRITEPROTECT1: DMA_WPROT1 (Bit 0)      */
#define MCUCTRL_DMASRAMWRITEPROTECT1_DMA_WPROT1_Msk (0xffffUL)      /*!< MCUCTRL DMASRAMWRITEPROTECT1: DMA_WPROT1 (Bitfield-Mask: 0xffff) */
/* ==================================================  DMASRAMREADPROTECT0  ================================================== */
#define MCUCTRL_DMASRAMREADPROTECT0_DMA_RPROT0_Pos (0UL)            /*!< MCUCTRL DMASRAMREADPROTECT0: DMA_RPROT0 (Bit 0)       */
#define MCUCTRL_DMASRAMREADPROTECT0_DMA_RPROT0_Msk (0xffffffffUL)   /*!< MCUCTRL DMASRAMREADPROTECT0: DMA_RPROT0 (Bitfield-Mask: 0xffffffff) */
/* ==================================================  DMASRAMREADPROTECT1  ================================================== */
#define MCUCTRL_DMASRAMREADPROTECT1_DMA_RPROT1_Pos (0UL)            /*!< MCUCTRL DMASRAMREADPROTECT1: DMA_RPROT1 (Bit 0)       */
#define MCUCTRL_DMASRAMREADPROTECT1_DMA_RPROT1_Msk (0xffffUL)       /*!< MCUCTRL DMASRAMREADPROTECT1: DMA_RPROT1 (Bitfield-Mask: 0xffff) */


/* =========================================================================================================================== */
/* ================                                           MSPI                                            ================ */
/* =========================================================================================================================== */

