tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* =========================================================  CTRL  ========================================================== */
#define MSPI_CTRL_XFERBYTES_Pos           (16UL)                    /*!< MSPI CTRL: XFERBYTES (Bit 16)                         */
#define MSPI_CTRL_XFERBYTES_Msk           (0xffff0000UL)            /*!< MSPI CTRL: XFERBYTES (Bitfield-Mask: 0xffff)          */
#define MSPI_CTRL_PIOSCRAMBLE_Pos         (11UL)                    /*!< MSPI CTRL: PIOSCRAMBLE (Bit 11)                       */
#define MSPI_CTRL_PIOSCRAMBLE_Msk         (0x800UL)                 /*!< MSPI CTRL: PIOSCRAMBLE (Bitfield-Mask: 0x01)          */
#define MSPI_CTRL_TXRX_Pos                (10UL)                    /*!< MSPI CTRL: TXRX (Bit 10)                              */
#define MSPI_CTRL_TXRX_Msk                (0x400UL)                 /*!< MSPI CTRL: TXRX (Bitfield-Mask: 0x01)                 */
#define MSPI_CTRL_SENDI_Pos               (9UL)                     /*!< MSPI CTRL: SENDI (Bit 9)                              */
#define MSPI_CTRL_SENDI_Msk               (0x200UL)                 /*!< MSPI CTRL: SENDI (Bitfield-Mask: 0x01)                */
#define MSPI_CTRL_SENDA_Pos               (8UL)                     /*!< MSPI CTRL: SENDA (Bit 8)                              */
#define MSPI_CTRL_SENDA_Msk               (0x100UL)                 /*!< MSPI CTRL: SENDA (Bitfield-Mask: 0x01)                */
#define MSPI_CTRL_ENTURN_Pos              (7UL)                     /*!< MSPI CTRL: ENTURN (Bit 7)                             */
#define MSPI_CTRL_ENTURN_Msk              (0x80UL)                  /*!< MSPI CTRL: ENTURN (Bitfield-Mask: 0x01)               */
#define MSPI_CTRL_BIGENDIAN_Pos           (6UL)                     /*!< MSPI CTRL: BIGENDIAN (Bit 6)                          */
#define MSPI_CTRL_BIGENDIAN_Msk           (0x40UL)                  /*!< MSPI CTRL: BIGENDIAN (Bitfield-Mask: 0x01)            */
#define MSPI_CTRL_CONT_Pos                (5UL)                     /*!< MSPI CTRL: CONT (Bit 5)                               */
#define MSPI_CTRL_CONT_Msk                (0x20UL)                  /*!< MSPI CTRL: CONT (Bitfield-Mask: 0x01)                 */
#define MSPI_CTRL_QUADCMD_Pos             (3UL)                     /*!< MSPI CTRL: QUADCMD (Bit 3)                            */
#define MSPI_CTRL_QUADCMD_Msk             (0x8UL)                   /*!< MSPI CTRL: QUADCMD (Bitfield-Mask: 0x01)              */
#define MSPI_CTRL_BUSY_Pos                (2UL)                     /*!< MSPI CTRL: BUSY (Bit 2)                               */
#define MSPI_CTRL_BUSY_Msk                (0x4UL)                   /*!< MSPI CTRL: BUSY (Bitfield-Mask: 0x01)                 */
#define MSPI_CTRL_STATUS_Pos              (1UL)                     /*!< MSPI CTRL: STATUS (Bit 1)                             */
#define MSPI_CTRL_STATUS_Msk              (0x2UL)                   /*!< MSPI CTRL: STATUS (Bitfield-Mask: 0x01)               */
#define MSPI_CTRL_START_Pos               (0UL)                     /*!< MSPI CTRL: START (Bit 0)                              */
#define MSPI_CTRL_START_Msk               (0x1UL)                   /*!< MSPI CTRL: START (Bitfield-Mask: 0x01)                */
/* ==========================================================  CFG  ========================================================== */
#define MSPI_CFG_CPOL_Pos                 (17UL)                    /*!< MSPI CFG: CPOL (Bit 17)                               */
#define MSPI_CFG_CPOL_Msk                 (0x20000UL)               /*!< MSPI CFG: CPOL (Bitfield-Mask: 0x01)                  */
#define MSPI_CFG_CPHA_Pos                 (16UL)                    /*!< MSPI CFG: CPHA (Bit 16)                               */
#define MSPI_CFG_CPHA_Msk                 (0x10000UL)               /*!< MSPI CFG: CPHA (Bitfield-Mask: 0x01)                  */
#define MSPI_CFG_TURNAROUND_Pos           (8UL)                     /*!< MSPI CFG: TURNAROUND (Bit 8)                          */
#define MSPI_CFG_TURNAROUND_Msk           (0x3f00UL)                /*!< MSPI CFG: TURNAROUND (Bitfield-Mask: 0x3f)            */
#define MSPI_CFG_SEPIO_Pos                (7UL)                     /*!< MSPI CFG: SEPIO (Bit 7)                               */
#define MSPI_CFG_SEPIO_Msk                (0x80UL)                  /*!< MSPI CFG: SEPIO (Bitfield-Mask: 0x01)                 */
#define MSPI_CFG_ISIZE_Pos                (6UL)                     /*!< MSPI CFG: ISIZE (Bit 6)                               */
#define MSPI_CFG_ISIZE_Msk                (0x40UL)                  /*!< MSPI CFG: ISIZE (Bitfield-Mask: 0x01)                 */
#define MSPI_CFG_ASIZE_Pos                (4UL)                     /*!< MSPI CFG: ASIZE (Bit 4)                               */
#define MSPI_CFG_ASIZE_Msk                (0x30UL)                  /*!< MSPI CFG: ASIZE (Bitfield-Mask: 0x03)                 */
#define MSPI_CFG_DEVCFG_Pos               (0UL)                     /*!< MSPI CFG: DEVCFG (Bit 0)                              */
#define MSPI_CFG_DEVCFG_Msk               (0xfUL)                   /*!< MSPI CFG: DEVCFG (Bitfield-Mask: 0x0f)                */
/* =========================================================  ADDR  ========================================================== */
#define MSPI_ADDR_ADDR_Pos                (0UL)                     /*!< MSPI ADDR: ADDR (Bit 0)                               */
#define MSPI_ADDR_ADDR_Msk                (0xffffffffUL)            /*!< MSPI ADDR: ADDR (Bitfield-Mask: 0xffffffff)           */
/* =========================================================  INSTR  ========================================================= */
#define MSPI_INSTR_INSTR_Pos              (0UL)                     /*!< MSPI INSTR: INSTR (Bit 0)                             */
#define MSPI_INSTR_INSTR_Msk              (0xffffUL)                /*!< MSPI INSTR: INSTR (Bitfield-Mask: 0xffff)             */
/* ========================================================  TXFIFO  ========================================================= */
#define MSPI_TXFIFO_TXFIFO_Pos            (0UL)                     /*!< MSPI TXFIFO: TXFIFO (Bit 0)                           */
#define MSPI_TXFIFO_TXFIFO_Msk            (0xffffffffUL)            /*!< MSPI TXFIFO: TXFIFO (Bitfield-Mask: 0xffffffff)       */
/* ========================================================  RXFIFO  ========================================================= */
#define MSPI_RXFIFO_RXFIFO_Pos            (0UL)                     /*!< MSPI RXFIFO: RXFIFO (Bit 0)                           */
#define MSPI_RXFIFO_RXFIFO_Msk            (0xffffffffUL)            /*!< MSPI RXFIFO: RXFIFO (Bitfield-Mask: 0xffffffff)       */
/* =======================================================  TXENTRIES  ======================================================= */
#define MSPI_TXENTRIES_TXENTRIES_Pos      (0UL)                     /*!< MSPI TXENTRIES: TXENTRIES (Bit 0)                     */
#define MSPI_TXENTRIES_TXENTRIES_Msk      (0x1fUL)                  /*!< MSPI TXENTRIES: TXENTRIES (Bitfield-Mask: 0x1f)       */
/* =======================================================  RXENTRIES  ======================================================= */
#define MSPI_RXENTRIES_RXENTRIES_Pos      (0UL)                     /*!< MSPI RXENTRIES: RXENTRIES (Bit 0)                     */
#define MSPI_RXENTRIES_RXENTRIES_Msk      (0x1fUL)                  /*!< MSPI RXENTRIES: RXENTRIES (Bitfield-Mask: 0x1f)       */
/* =======================================================  THRESHOLD  ======================================================= */
#define MSPI_THRESHOLD_RXTHRESH_Pos       (8UL)                     /*!< MSPI THRESHOLD: RXTHRESH (Bit 8)                      */
#define MSPI_THRESHOLD_RXTHRESH_Msk       (0x1f00UL)                /*!< MSPI THRESHOLD: RXTHRESH (Bitfield-Mask: 0x1f)        */
#define MSPI_THRESHOLD_TXTHRESH_Pos       (0UL)                     /*!< MSPI THRESHOLD: TXTHRESH (Bit 0)                      */
#define MSPI_THRESHOLD_TXTHRESH_Msk       (0x1fUL)                  /*!< MSPI THRESHOLD: TXTHRESH (Bitfield-Mask: 0x1f)        */
/* ========================================================  MSPICFG  ======================================================== */
#define MSPI_MSPICFG_PRSTN_Pos            (31UL)                    /*!< MSPI MSPICFG: PRSTN (Bit 31)                          */
#define MSPI_MSPICFG_PRSTN_Msk            (0x80000000UL)            /*!< MSPI MSPICFG: PRSTN (Bitfield-Mask: 0x01)             */
#define MSPI_MSPICFG_IPRSTN_Pos           (30UL)                    /*!< MSPI MSPICFG: IPRSTN (Bit 30)                         */
#define MSPI_MSPICFG_IPRSTN_Msk           (0x40000000UL)            /*!< MSPI MSPICFG: IPRSTN (Bitfield-Mask: 0x01)            */
#define MSPI_MSPICFG_FIFORESET_Pos        (29UL)                    /*!< MSPI MSPICFG: FIFORESET (Bit 29)                      */
#define MSPI_MSPICFG_FIFORESET_Msk        (0x20000000UL)            /*!< MSPI MSPICFG: FIFORESET (Bitfield-Mask: 0x01)         */
#define MSPI_MSPICFG_CLKDIV_Pos           (8UL)                     /*!< MSPI MSPICFG: CLKDIV (Bit 8)                          */
#define MSPI_MSPICFG_CLKDIV_Msk           (0x3f00UL)                /*!< MSPI MSPICFG: CLKDIV (Bitfield-Mask: 0x3f)            */
#define MSPI_MSPICFG_IOMSEL_Pos           (4UL)                     /*!< MSPI MSPICFG: IOMSEL (Bit 4)                          */
#define MSPI_MSPICFG_IOMSEL_Msk           (0x70UL)                  /*!< MSPI MSPICFG: IOMSEL (Bitfield-Mask: 0x07)            */
#define MSPI_MSPICFG_TXNEG_Pos            (3UL)                     /*!< MSPI MSPICFG: TXNEG (Bit 3)                           */
#define MSPI_MSPICFG_TXNEG_Msk            (0x8UL)                   /*!< MSPI MSPICFG: TXNEG (Bitfield-Mask: 0x01)             */
#define MSPI_MSPICFG_RXNEG_Pos            (2UL)                     /*!< MSPI MSPICFG: RXNEG (Bit 2)                           */
#define MSPI_MSPICFG_RXNEG_Msk            (0x4UL)                   /*!< MSPI MSPICFG: RXNEG (Bitfield-Mask: 0x01)             */
#define MSPI_MSPICFG_RXCAP_Pos            (1UL)                     /*!< MSPI MSPICFG: RXCAP (Bit 1)                           */
#define MSPI_MSPICFG_RXCAP_Msk            (0x2UL)                   /*!< MSPI MSPICFG: RXCAP (Bitfield-Mask: 0x01)             */
#define MSPI_MSPICFG_APBCLK_Pos           (0UL)                     /*!< MSPI MSPICFG: APBCLK (Bit 0)                          */
#define MSPI_MSPICFG_APBCLK_Msk           (0x1UL)                   /*!< MSPI MSPICFG: APBCLK (Bitfield-Mask: 0x01)            */
/* ========================================================  PADCFG  ========================================================= */
#define MSPI_PADCFG_REVCS_Pos             (21UL)                    /*!< MSPI PADCFG: REVCS (Bit 21)                           */
#define MSPI_PADCFG_REVCS_Msk             (0x200000UL)              /*!< MSPI PADCFG: REVCS (Bitfield-Mask: 0x01)              */
#define MSPI_PADCFG_IN3_Pos               (20UL)                    /*!< MSPI PADCFG: IN3 (Bit 20)                             */
#define MSPI_PADCFG_IN3_Msk               (0x100000UL)              /*!< MSPI PADCFG: IN3 (Bitfield-Mask: 0x01)                */
#define MSPI_PADCFG_IN2_Pos               (19UL)                    /*!< MSPI PADCFG: IN2 (Bit 19)                             */
#define MSPI_PADCFG_IN2_Msk               (0x80000UL)               /*!< MSPI PADCFG: IN2 (Bitfield-Mask: 0x01)                */
#define MSPI_PADCFG_IN1_Pos               (18UL)                    /*!< MSPI PADCFG: IN1 (Bit 18)                             */
#define MSPI_PADCFG_IN1_Msk               (0x40000UL)               /*!< MSPI PADCFG: IN1 (Bitfield-Mask: 0x01)                */
#define MSPI_PADCFG_IN0_Pos               (16UL)                    /*!< MSPI PADCFG: IN0 (Bit 16)                             */
#define MSPI_PADCFG_IN0_Msk               (0x30000UL)               /*!< MSPI PADCFG: IN0 (Bitfield-Mask: 0x03)                */
#define MSPI_PADCFG_OUT7_Pos              (4UL)                     /*!< MSPI PADCFG: OUT7 (Bit 4)                             */
#define MSPI_PADCFG_OUT7_Msk              (0x10UL)                  /*!< MSPI PADCFG: OUT7 (Bitfield-Mask: 0x01)               */
#define MSPI_PADCFG_OUT6_Pos              (3UL)                     /*!< MSPI PADCFG: OUT6 (Bit 3)                             */
#define MSPI_PADCFG_OUT6_Msk              (0x8UL)                   /*!< MSPI PADCFG: OUT6 (Bitfield-Mask: 0x01)               */
#define MSPI_PADCFG_OUT5_Pos              (2UL)                     /*!< MSPI PADCFG: OUT5 (Bit 2)                             */
#define MSPI_PADCFG_OUT5_Msk              (0x4UL)                   /*!< MSPI PADCFG: OUT5 (Bitfield-Mask: 0x01)               */
#define MSPI_PADCFG_OUT4_Pos              (1UL)                     /*!< MSPI PADCFG: OUT4 (Bit 1)                             */
#define MSPI_PADCFG_OUT4_Msk              (0x2UL)                   /*!< MSPI PADCFG: OUT4 (Bitfield-Mask: 0x01)               */
#define MSPI_PADCFG_OUT3_Pos              (0UL)                     /*!< MSPI PADCFG: OUT3 (Bit 0)                             */
#define MSPI_PADCFG_OUT3_Msk              (0x1UL)                   /*!< MSPI PADCFG: OUT3 (Bitfield-Mask: 0x01)               */
/* =======================================================  PADOUTEN  ======================================================== */
#define MSPI_PADOUTEN_OUTEN_Pos           (0UL)                     /*!< MSPI PADOUTEN: OUTEN (Bit 0)                          */
#define MSPI_PADOUTEN_OUTEN_Msk           (0x1ffUL)                 /*!< MSPI PADOUTEN: OUTEN (Bitfield-Mask: 0x1ff)           */
/* =========================================================  FLASH  ========================================================= */
#define MSPI_FLASH_READINSTR_Pos          (24UL)                    /*!< MSPI FLASH: READINSTR (Bit 24)                        */
#define MSPI_FLASH_READINSTR_Msk          (0xff000000UL)            /*!< MSPI FLASH: READINSTR (Bitfield-Mask: 0xff)           */
#define MSPI_FLASH_WRITEINSTR_Pos         (16UL)                    /*!< MSPI FLASH: WRITEINSTR (Bit 16)                       */
#define MSPI_FLASH_WRITEINSTR_Msk         (0xff0000UL)              /*!< MSPI FLASH: WRITEINSTR (Bitfield-Mask: 0xff)          */
#define MSPI_FLASH_XIPMIXED_Pos           (8UL)                     /*!< MSPI FLASH: XIPMIXED (Bit 8)                          */
#define MSPI_FLASH_XIPMIXED_Msk           (0x700UL)                 /*!< MSPI FLASH: XIPMIXED (Bitfield-Mask: 0x07)            */
#define MSPI_FLASH_XIPSENDI_Pos           (7UL)                     /*!< MSPI FLASH: XIPSENDI (Bit 7)                          */
#define MSPI_FLASH_XIPSENDI_Msk           (0x80UL)                  /*!< MSPI FLASH: XIPSENDI (Bitfield-Mask: 0x01)            */
#define MSPI_FLASH_XIPSENDA_Pos           (6UL)                     /*!< MSPI FLASH: XIPSENDA (Bit 6)                          */
#define MSPI_FLASH_XIPSENDA_Msk           (0x40UL)                  /*!< MSPI FLASH: XIPSENDA (Bitfield-Mask: 0x01)            */
#define MSPI_FLASH_XIPENTURN_Pos          (5UL)                     /*!< MSPI FLASH: XIPENTURN (Bit 5)                         */
#define MSPI_FLASH_XIPENTURN_Msk          (0x20UL)                  /*!< MSPI FLASH: XIPENTURN (Bitfield-Mask: 0x01)           */
#define MSPI_FLASH_XIPBIGENDIAN_Pos       (4UL)                     /*!< MSPI FLASH: XIPBIGENDIAN (Bit 4)                      */
#define MSPI_FLASH_XIPBIGENDIAN_Msk       (0x10UL)                  /*!< MSPI FLASH: XIPBIGENDIAN (Bitfield-Mask: 0x01)        */
#define MSPI_FLASH_XIPACK_Pos             (2UL)                     /*!< MSPI FLASH: XIPACK (Bit 2)                            */
#define MSPI_FLASH_XIPACK_Msk             (0xcUL)                   /*!< MSPI FLASH: XIPACK (Bitfield-Mask: 0x03)              */
#define MSPI_FLASH_XIPEN_Pos              (0UL)                     /*!< MSPI FLASH: XIPEN (Bit 0)                             */
#define MSPI_FLASH_XIPEN_Msk              (0x1UL)                   /*!< MSPI FLASH: XIPEN (Bitfield-Mask: 0x01)               */
/* ======================================================  SCRAMBLING  ======================================================= */
#define MSPI_SCRAMBLING_SCRENABLE_Pos     (31UL)                    /*!< MSPI SCRAMBLING: SCRENABLE (Bit 31)                   */
#define MSPI_SCRAMBLING_SCRENABLE_Msk     (0x80000000UL)            /*!< MSPI SCRAMBLING: SCRENABLE (Bitfield-Mask: 0x01)      */
#define MSPI_SCRAMBLING_SCREND_Pos        (16UL)                    /*!< MSPI SCRAMBLING: SCREND (Bit 16)                      */
#define MSPI_SCRAMBLING_SCREND_Msk        (0x3ff0000UL)             /*!< MSPI SCRAMBLING: SCREND (Bitfield-Mask: 0x3ff)        */
#define MSPI_SCRAMBLING_SCRSTART_Pos      (0UL)                     /*!< MSPI SCRAMBLING: SCRSTART (Bit 0)                     */
#define MSPI_SCRAMBLING_SCRSTART_Msk      (0x3ffUL)                 /*!< MSPI SCRAMBLING: SCRSTART (Bitfield-Mask: 0x3ff)      */
/* =========================================================  INTEN  ========================================================= */
#define MSPI_INTEN_SCRERR_Pos             (12UL)                    /*!< MSPI INTEN: SCRERR (Bit 12)                           */
#define MSPI_INTEN_SCRERR_Msk             (0x1000UL)                /*!< MSPI INTEN: SCRERR (Bitfield-Mask: 0x01)              */
#define MSPI_INTEN_CQERR_Pos              (11UL)                    /*!< MSPI INTEN: CQERR (Bit 11)                            */
#define MSPI_INTEN_CQERR_Msk              (0x800UL)                 /*!< MSPI INTEN: CQERR (Bitfield-Mask: 0x01)               */
#define MSPI_INTEN_CQPAUSED_Pos           (10UL)                    /*!< MSPI INTEN: CQPAUSED (Bit 10)                         */
#define MSPI_INTEN_CQPAUSED_Msk           (0x400UL)                 /*!< MSPI INTEN: CQPAUSED (Bitfield-Mask: 0x01)            */
#define MSPI_INTEN_CQUPD_Pos              (9UL)                     /*!< MSPI INTEN: CQUPD (Bit 9)                             */
#define MSPI_INTEN_CQUPD_Msk              (0x200UL)                 /*!< MSPI INTEN: CQUPD (Bitfield-Mask: 0x01)               */
#define MSPI_INTEN_CQCMP_Pos              (8UL)                     /*!< MSPI INTEN: CQCMP (Bit 8)                             */
#define MSPI_INTEN_CQCMP_Msk              (0x100UL)                 /*!< MSPI INTEN: CQCMP (Bitfield-Mask: 0x01)               */
#define MSPI_INTEN_DERR_Pos               (7UL)                     /*!< MSPI INTEN: DERR (Bit 7)                              */
#define MSPI_INTEN_DERR_Msk               (0x80UL)                  /*!< MSPI INTEN: DERR (Bitfield-Mask: 0x01)                */
#define MSPI_INTEN_DCMP_Pos               (6UL)                     /*!< MSPI INTEN: DCMP (Bit 6)                              */
#define MSPI_INTEN_DCMP_Msk               (0x40UL)                  /*!< MSPI INTEN: DCMP (Bitfield-Mask: 0x01)                */
#define MSPI_INTEN_RXF_Pos                (5UL)                     /*!< MSPI INTEN: RXF (Bit 5)                               */
#define MSPI_INTEN_RXF_Msk                (0x20UL)                  /*!< MSPI INTEN: RXF (Bitfield-Mask: 0x01)                 */
#define MSPI_INTEN_RXO_Pos                (4UL)                     /*!< MSPI INTEN: RXO (Bit 4)                               */
#define MSPI_INTEN_RXO_Msk                (0x10UL)                  /*!< MSPI INTEN: RXO (Bitfield-Mask: 0x01)                 */
#define MSPI_INTEN_RXU_Pos                (3UL)                     /*!< MSPI INTEN: RXU (Bit 3)                               */
#define MSPI_INTEN_RXU_Msk                (0x8UL)                   /*!< MSPI INTEN: RXU (Bitfield-Mask: 0x01)                 */
#define MSPI_INTEN_TXO_Pos                (2UL)                     /*!< MSPI INTEN: TXO (Bit 2)                               */
#define MSPI_INTEN_TXO_Msk                (0x4UL)                   /*!< MSPI INTEN: TXO (Bitfield-Mask: 0x01)                 */
#define MSPI_INTEN_TXE_Pos                (1UL)                     /*!< MSPI INTEN: TXE (Bit 1)                               */
#define MSPI_INTEN_TXE_Msk                (0x2UL)                   /*!< MSPI INTEN: TXE (Bitfield-Mask: 0x01)                 */
#define MSPI_INTEN_CMDCMP_Pos             (0UL)                     /*!< MSPI INTEN: CMDCMP (Bit 0)                            */
#define MSPI_INTEN_CMDCMP_Msk             (0x1UL)                   /*!< MSPI INTEN: CMDCMP (Bitfield-Mask: 0x01)              */
/* ========================================================  INTSTAT  ======================================================== */
#define MSPI_INTSTAT_SCRERR_Pos           (12UL)                    /*!< MSPI INTSTAT: SCRERR (Bit 12)                         */
#define MSPI_INTSTAT_SCRERR_Msk           (0x1000UL)                /*!< MSPI INTSTAT: SCRERR (Bitfield-Mask: 0x01)            */
#define MSPI_INTSTAT_CQERR_Pos            (11UL)                    /*!< MSPI INTSTAT: CQERR (Bit 11)                          */
#define MSPI_INTSTAT_CQERR_Msk            (0x800UL)                 /*!< MSPI INTSTAT: CQERR (Bitfield-Mask: 0x01)             */
#define MSPI_INTSTAT_CQPAUSED_Pos         (10UL)                    /*!< MSPI INTSTAT: CQPAUSED (Bit 10)                       */
#define MSPI_INTSTAT_CQPAUSED_Msk         (0x400UL)                 /*!< MSPI INTSTAT: CQPAUSED (Bitfield-Mask: 0x01)          */
#define MSPI_INTSTAT_CQUPD_Pos            (9UL)                     /*!< MSPI INTSTAT: CQUPD (Bit 9)                           */
#define MSPI_INTSTAT_CQUPD_Msk            (0x200UL)                 /*!< MSPI INTSTAT: CQUPD (Bitfield-Mask: 0x01)             */
#define MSPI_INTSTAT_CQCMP_Pos            (8UL)                     /*!< MSPI INTSTAT: CQCMP (Bit 8)                           */
#define MSPI_INTSTAT_CQCMP_Msk            (0x100UL)                 /*!< MSPI INTSTAT: CQCMP (Bitfield-Mask: 0x01)             */
#define MSPI_INTSTAT_DERR_Pos             (7UL)                     /*!< MSPI INTSTAT: DERR (Bit 7)                            */
#define MSPI_INTSTAT_DERR_Msk             (0x80UL)                  /*!< MSPI INTSTAT: DERR (Bitfield-Mask: 0x01)              */
#define MSPI_INTSTAT_DCMP_Pos             (6UL)                     /*!< MSPI INTSTAT: DCMP (Bit 6)                            */
#define MSPI_INTSTAT_DCMP_Msk             (0x40UL)                  /*!< MSPI INTSTAT: DCMP (Bitfield-Mask: 0x01)              */
#define MSPI_INTSTAT_RXF_Pos              (5UL)                     /*!< MSPI INTSTAT: RXF (Bit 5)                             */
#define MSPI_INTSTAT_RXF_Msk              (0x20UL)                  /*!< MSPI INTSTAT: RXF (Bitfield-Mask: 0x01)               */
#define MSPI_INTSTAT_RXO_Pos              (4UL)                     /*!< MSPI INTSTAT: RXO (Bit 4)                             */
#define MSPI_INTSTAT_RXO_Msk              (0x10UL)                  /*!< MSPI INTSTAT: RXO (Bitfield-Mask: 0x01)               */
#define MSPI_INTSTAT_RXU_Pos              (3UL)                     /*!< MSPI INTSTAT: RXU (Bit 3)                             */
#define MSPI_INTSTAT_RXU_Msk              (0x8UL)                   /*!< MSPI INTSTAT: RXU (Bitfield-Mask: 0x01)               */
#define MSPI_INTSTAT_TXO_Pos              (2UL)                     /*!< MSPI INTSTAT: TXO (Bit 2)                             */
#define MSPI_INTSTAT_TXO_Msk              (0x4UL)                   /*!< MSPI INTSTAT: TXO (Bitfield-Mask: 0x01)               */
#define MSPI_INTSTAT_TXE_Pos              (1UL)                     /*!< MSPI INTSTAT: TXE (Bit 1)                             */
#define MSPI_INTSTAT_TXE_Msk              (0x2UL)                   /*!< MSPI INTSTAT: TXE (Bitfield-Mask: 0x01)               */
