tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
#define MSPI_INTSTAT_CMDCMP_Pos           (0UL)                     /*!< MSPI INTSTAT: CMDCMP (Bit 0)                          */
#define MSPI_INTSTAT_CMDCMP_Msk           (0x1UL)                   /*!< MSPI INTSTAT: CMDCMP (Bitfield-Mask: 0x01)            */
/* ========================================================  INTCLR  ========================================================= */
#define MSPI_INTCLR_SCRERR_Pos            (12UL)                    /*!< MSPI INTCLR: SCRERR (Bit 12)                          */
#define MSPI_INTCLR_SCRERR_Msk            (0x1000UL)                /*!< MSPI INTCLR: SCRERR (Bitfield-Mask: 0x01)             */
#define MSPI_INTCLR_CQERR_Pos             (11UL)                    /*!< MSPI INTCLR: CQERR (Bit 11)                           */
#define MSPI_INTCLR_CQERR_Msk             (0x800UL)                 /*!< MSPI INTCLR: CQERR (Bitfield-Mask: 0x01)              */
#define MSPI_INTCLR_CQPAUSED_Pos          (10UL)                    /*!< MSPI INTCLR: CQPAUSED (Bit 10)                        */
#define MSPI_INTCLR_CQPAUSED_Msk          (0x400UL)                 /*!< MSPI INTCLR: CQPAUSED (Bitfield-Mask: 0x01)           */
#define MSPI_INTCLR_CQUPD_Pos             (9UL)                     /*!< MSPI INTCLR: CQUPD (Bit 9)                            */
#define MSPI_INTCLR_CQUPD_Msk             (0x200UL)                 /*!< MSPI INTCLR: CQUPD (Bitfield-Mask: 0x01)              */
#define MSPI_INTCLR_CQCMP_Pos             (8UL)                     /*!< MSPI INTCLR: CQCMP (Bit 8)                            */
#define MSPI_INTCLR_CQCMP_Msk             (0x100UL)                 /*!< MSPI INTCLR: CQCMP (Bitfield-Mask: 0x01)              */
#define MSPI_INTCLR_DERR_Pos              (7UL)                     /*!< MSPI INTCLR: DERR (Bit 7)                             */
#define MSPI_INTCLR_DERR_Msk              (0x80UL)                  /*!< MSPI INTCLR: DERR (Bitfield-Mask: 0x01)               */
#define MSPI_INTCLR_DCMP_Pos              (6UL)                     /*!< MSPI INTCLR: DCMP (Bit 6)                             */
#define MSPI_INTCLR_DCMP_Msk              (0x40UL)                  /*!< MSPI INTCLR: DCMP (Bitfield-Mask: 0x01)               */
#define MSPI_INTCLR_RXF_Pos               (5UL)                     /*!< MSPI INTCLR: RXF (Bit 5)                              */
#define MSPI_INTCLR_RXF_Msk               (0x20UL)                  /*!< MSPI INTCLR: RXF (Bitfield-Mask: 0x01)                */
#define MSPI_INTCLR_RXO_Pos               (4UL)                     /*!< MSPI INTCLR: RXO (Bit 4)                              */
#define MSPI_INTCLR_RXO_Msk               (0x10UL)                  /*!< MSPI INTCLR: RXO (Bitfield-Mask: 0x01)                */
#define MSPI_INTCLR_RXU_Pos               (3UL)                     /*!< MSPI INTCLR: RXU (Bit 3)                              */
#define MSPI_INTCLR_RXU_Msk               (0x8UL)                   /*!< MSPI INTCLR: RXU (Bitfield-Mask: 0x01)                */
#define MSPI_INTCLR_TXO_Pos               (2UL)                     /*!< MSPI INTCLR: TXO (Bit 2)                              */
#define MSPI_INTCLR_TXO_Msk               (0x4UL)                   /*!< MSPI INTCLR: TXO (Bitfield-Mask: 0x01)                */
#define MSPI_INTCLR_TXE_Pos               (1UL)                     /*!< MSPI INTCLR: TXE (Bit 1)                              */
#define MSPI_INTCLR_TXE_Msk               (0x2UL)                   /*!< MSPI INTCLR: TXE (Bitfield-Mask: 0x01)                */
#define MSPI_INTCLR_CMDCMP_Pos            (0UL)                     /*!< MSPI INTCLR: CMDCMP (Bit 0)                           */
#define MSPI_INTCLR_CMDCMP_Msk            (0x1UL)                   /*!< MSPI INTCLR: CMDCMP (Bitfield-Mask: 0x01)             */
/* ========================================================  INTSET  ========================================================= */
#define MSPI_INTSET_SCRERR_Pos            (12UL)                    /*!< MSPI INTSET: SCRERR (Bit 12)                          */
#define MSPI_INTSET_SCRERR_Msk            (0x1000UL)                /*!< MSPI INTSET: SCRERR (Bitfield-Mask: 0x01)             */
#define MSPI_INTSET_CQERR_Pos             (11UL)                    /*!< MSPI INTSET: CQERR (Bit 11)                           */
#define MSPI_INTSET_CQERR_Msk             (0x800UL)                 /*!< MSPI INTSET: CQERR (Bitfield-Mask: 0x01)              */
#define MSPI_INTSET_CQPAUSED_Pos          (10UL)                    /*!< MSPI INTSET: CQPAUSED (Bit 10)                        */
#define MSPI_INTSET_CQPAUSED_Msk          (0x400UL)                 /*!< MSPI INTSET: CQPAUSED (Bitfield-Mask: 0x01)           */
#define MSPI_INTSET_CQUPD_Pos             (9UL)                     /*!< MSPI INTSET: CQUPD (Bit 9)                            */
#define MSPI_INTSET_CQUPD_Msk             (0x200UL)                 /*!< MSPI INTSET: CQUPD (Bitfield-Mask: 0x01)              */
#define MSPI_INTSET_CQCMP_Pos             (8UL)                     /*!< MSPI INTSET: CQCMP (Bit 8)                            */
#define MSPI_INTSET_CQCMP_Msk             (0x100UL)                 /*!< MSPI INTSET: CQCMP (Bitfield-Mask: 0x01)              */
#define MSPI_INTSET_DERR_Pos              (7UL)                     /*!< MSPI INTSET: DERR (Bit 7)                             */
#define MSPI_INTSET_DERR_Msk              (0x80UL)                  /*!< MSPI INTSET: DERR (Bitfield-Mask: 0x01)               */
#define MSPI_INTSET_DCMP_Pos              (6UL)                     /*!< MSPI INTSET: DCMP (Bit 6)                             */
#define MSPI_INTSET_DCMP_Msk              (0x40UL)                  /*!< MSPI INTSET: DCMP (Bitfield-Mask: 0x01)               */
#define MSPI_INTSET_RXF_Pos               (5UL)                     /*!< MSPI INTSET: RXF (Bit 5)                              */
#define MSPI_INTSET_RXF_Msk               (0x20UL)                  /*!< MSPI INTSET: RXF (Bitfield-Mask: 0x01)                */
#define MSPI_INTSET_RXO_Pos               (4UL)                     /*!< MSPI INTSET: RXO (Bit 4)                              */
#define MSPI_INTSET_RXO_Msk               (0x10UL)                  /*!< MSPI INTSET: RXO (Bitfield-Mask: 0x01)                */
#define MSPI_INTSET_RXU_Pos               (3UL)                     /*!< MSPI INTSET: RXU (Bit 3)                              */
#define MSPI_INTSET_RXU_Msk               (0x8UL)                   /*!< MSPI INTSET: RXU (Bitfield-Mask: 0x01)                */
#define MSPI_INTSET_TXO_Pos               (2UL)                     /*!< MSPI INTSET: TXO (Bit 2)                              */
#define MSPI_INTSET_TXO_Msk               (0x4UL)                   /*!< MSPI INTSET: TXO (Bitfield-Mask: 0x01)                */
#define MSPI_INTSET_TXE_Pos               (1UL)                     /*!< MSPI INTSET: TXE (Bit 1)                              */
#define MSPI_INTSET_TXE_Msk               (0x2UL)                   /*!< MSPI INTSET: TXE (Bitfield-Mask: 0x01)                */
#define MSPI_INTSET_CMDCMP_Pos            (0UL)                     /*!< MSPI INTSET: CMDCMP (Bit 0)                           */
#define MSPI_INTSET_CMDCMP_Msk            (0x1UL)                   /*!< MSPI INTSET: CMDCMP (Bitfield-Mask: 0x01)             */
/* ========================================================  DMACFG  ========================================================= */
#define MSPI_DMACFG_DMAPWROFF_Pos         (18UL)                    /*!< MSPI DMACFG: DMAPWROFF (Bit 18)                       */
#define MSPI_DMACFG_DMAPWROFF_Msk         (0x40000UL)               /*!< MSPI DMACFG: DMAPWROFF (Bitfield-Mask: 0x01)          */
#define MSPI_DMACFG_DMAPRI_Pos            (3UL)                     /*!< MSPI DMACFG: DMAPRI (Bit 3)                           */
#define MSPI_DMACFG_DMAPRI_Msk            (0x18UL)                  /*!< MSPI DMACFG: DMAPRI (Bitfield-Mask: 0x03)             */
#define MSPI_DMACFG_DMADIR_Pos            (2UL)                     /*!< MSPI DMACFG: DMADIR (Bit 2)                           */
#define MSPI_DMACFG_DMADIR_Msk            (0x4UL)                   /*!< MSPI DMACFG: DMADIR (Bitfield-Mask: 0x01)             */
#define MSPI_DMACFG_DMAEN_Pos             (0UL)                     /*!< MSPI DMACFG: DMAEN (Bit 0)                            */
#define MSPI_DMACFG_DMAEN_Msk             (0x3UL)                   /*!< MSPI DMACFG: DMAEN (Bitfield-Mask: 0x03)              */
/* ========================================================  DMASTAT  ======================================================== */
#define MSPI_DMASTAT_SCRERR_Pos           (3UL)                     /*!< MSPI DMASTAT: SCRERR (Bit 3)                          */
#define MSPI_DMASTAT_SCRERR_Msk           (0x8UL)                   /*!< MSPI DMASTAT: SCRERR (Bitfield-Mask: 0x01)            */
#define MSPI_DMASTAT_DMAERR_Pos           (2UL)                     /*!< MSPI DMASTAT: DMAERR (Bit 2)                          */
#define MSPI_DMASTAT_DMAERR_Msk           (0x4UL)                   /*!< MSPI DMASTAT: DMAERR (Bitfield-Mask: 0x01)            */
#define MSPI_DMASTAT_DMACPL_Pos           (1UL)                     /*!< MSPI DMASTAT: DMACPL (Bit 1)                          */
#define MSPI_DMASTAT_DMACPL_Msk           (0x2UL)                   /*!< MSPI DMASTAT: DMACPL (Bitfield-Mask: 0x01)            */
#define MSPI_DMASTAT_DMATIP_Pos           (0UL)                     /*!< MSPI DMASTAT: DMATIP (Bit 0)                          */
#define MSPI_DMASTAT_DMATIP_Msk           (0x1UL)                   /*!< MSPI DMASTAT: DMATIP (Bitfield-Mask: 0x01)            */
/* ======================================================  DMATARGADDR  ====================================================== */
#define MSPI_DMATARGADDR_TARGADDR_Pos     (0UL)                     /*!< MSPI DMATARGADDR: TARGADDR (Bit 0)                    */
#define MSPI_DMATARGADDR_TARGADDR_Msk     (0xffffffffUL)            /*!< MSPI DMATARGADDR: TARGADDR (Bitfield-Mask: 0xffffffff) */
/* ======================================================  DMADEVADDR  ======================================================= */
#define MSPI_DMADEVADDR_DEVADDR_Pos       (0UL)                     /*!< MSPI DMADEVADDR: DEVADDR (Bit 0)                      */
#define MSPI_DMADEVADDR_DEVADDR_Msk       (0xffffffffUL)            /*!< MSPI DMADEVADDR: DEVADDR (Bitfield-Mask: 0xffffffff)  */
/* ======================================================  DMATOTCOUNT  ====================================================== */
#define MSPI_DMATOTCOUNT_TOTCOUNT_Pos     (0UL)                     /*!< MSPI DMATOTCOUNT: TOTCOUNT (Bit 0)                    */
#define MSPI_DMATOTCOUNT_TOTCOUNT_Msk     (0xffffUL)                /*!< MSPI DMATOTCOUNT: TOTCOUNT (Bitfield-Mask: 0xffff)    */
/* =======================================================  DMABCOUNT  ======================================================= */
#define MSPI_DMABCOUNT_BCOUNT_Pos         (0UL)                     /*!< MSPI DMABCOUNT: BCOUNT (Bit 0)                        */
#define MSPI_DMABCOUNT_BCOUNT_Msk         (0xffUL)                  /*!< MSPI DMABCOUNT: BCOUNT (Bitfield-Mask: 0xff)          */
/* =======================================================  DMATHRESH  ======================================================= */
#define MSPI_DMATHRESH_DMATHRESH_Pos      (0UL)                     /*!< MSPI DMATHRESH: DMATHRESH (Bit 0)                     */
#define MSPI_DMATHRESH_DMATHRESH_Msk      (0xfUL)                   /*!< MSPI DMATHRESH: DMATHRESH (Bitfield-Mask: 0x0f)       */
/* =========================================================  CQCFG  ========================================================= */
#define MSPI_CQCFG_CQAUTOCLEARMASK_Pos    (3UL)                     /*!< MSPI CQCFG: CQAUTOCLEARMASK (Bit 3)                   */
#define MSPI_CQCFG_CQAUTOCLEARMASK_Msk    (0x8UL)                   /*!< MSPI CQCFG: CQAUTOCLEARMASK (Bitfield-Mask: 0x01)     */
#define MSPI_CQCFG_CQPWROFF_Pos           (2UL)                     /*!< MSPI CQCFG: CQPWROFF (Bit 2)                          */
#define MSPI_CQCFG_CQPWROFF_Msk           (0x4UL)                   /*!< MSPI CQCFG: CQPWROFF (Bitfield-Mask: 0x01)            */
#define MSPI_CQCFG_CQPRI_Pos              (1UL)                     /*!< MSPI CQCFG: CQPRI (Bit 1)                             */
#define MSPI_CQCFG_CQPRI_Msk              (0x2UL)                   /*!< MSPI CQCFG: CQPRI (Bitfield-Mask: 0x01)               */
#define MSPI_CQCFG_CQEN_Pos               (0UL)                     /*!< MSPI CQCFG: CQEN (Bit 0)                              */
#define MSPI_CQCFG_CQEN_Msk               (0x1UL)                   /*!< MSPI CQCFG: CQEN (Bitfield-Mask: 0x01)                */
/* ========================================================  CQADDR  ========================================================= */
#define MSPI_CQADDR_CQADDR_Pos            (0UL)                     /*!< MSPI CQADDR: CQADDR (Bit 0)                           */
#define MSPI_CQADDR_CQADDR_Msk            (0x1fffffffUL)            /*!< MSPI CQADDR: CQADDR (Bitfield-Mask: 0x1fffffff)       */
/* ========================================================  CQSTAT  ========================================================= */
#define MSPI_CQSTAT_CQPAUSED_Pos          (3UL)                     /*!< MSPI CQSTAT: CQPAUSED (Bit 3)                         */
#define MSPI_CQSTAT_CQPAUSED_Msk          (0x8UL)                   /*!< MSPI CQSTAT: CQPAUSED (Bitfield-Mask: 0x01)           */
#define MSPI_CQSTAT_CQERR_Pos             (2UL)                     /*!< MSPI CQSTAT: CQERR (Bit 2)                            */
#define MSPI_CQSTAT_CQERR_Msk             (0x4UL)                   /*!< MSPI CQSTAT: CQERR (Bitfield-Mask: 0x01)              */
#define MSPI_CQSTAT_CQCPL_Pos             (1UL)                     /*!< MSPI CQSTAT: CQCPL (Bit 1)                            */
#define MSPI_CQSTAT_CQCPL_Msk             (0x2UL)                   /*!< MSPI CQSTAT: CQCPL (Bitfield-Mask: 0x01)              */
#define MSPI_CQSTAT_CQTIP_Pos             (0UL)                     /*!< MSPI CQSTAT: CQTIP (Bit 0)                            */
#define MSPI_CQSTAT_CQTIP_Msk             (0x1UL)                   /*!< MSPI CQSTAT: CQTIP (Bitfield-Mask: 0x01)              */
/* ========================================================  CQFLAGS  ======================================================== */
#define MSPI_CQFLAGS_CQFLAGS_Pos          (0UL)                     /*!< MSPI CQFLAGS: CQFLAGS (Bit 0)                         */
#define MSPI_CQFLAGS_CQFLAGS_Msk          (0xffffUL)                /*!< MSPI CQFLAGS: CQFLAGS (Bitfield-Mask: 0xffff)         */
/* ======================================================  CQSETCLEAR  ======================================================= */
#define MSPI_CQSETCLEAR_CQFCLR_Pos        (16UL)                    /*!< MSPI CQSETCLEAR: CQFCLR (Bit 16)                      */
#define MSPI_CQSETCLEAR_CQFCLR_Msk        (0xff0000UL)              /*!< MSPI CQSETCLEAR: CQFCLR (Bitfield-Mask: 0xff)         */
#define MSPI_CQSETCLEAR_CQFTOGGLE_Pos     (8UL)                     /*!< MSPI CQSETCLEAR: CQFTOGGLE (Bit 8)                    */
#define MSPI_CQSETCLEAR_CQFTOGGLE_Msk     (0xff00UL)                /*!< MSPI CQSETCLEAR: CQFTOGGLE (Bitfield-Mask: 0xff)      */
#define MSPI_CQSETCLEAR_CQFSET_Pos        (0UL)                     /*!< MSPI CQSETCLEAR: CQFSET (Bit 0)                       */
#define MSPI_CQSETCLEAR_CQFSET_Msk        (0xffUL)                  /*!< MSPI CQSETCLEAR: CQFSET (Bitfield-Mask: 0xff)         */
/* ========================================================  CQPAUSE  ======================================================== */
#define MSPI_CQPAUSE_CQMASK_Pos           (0UL)                     /*!< MSPI CQPAUSE: CQMASK (Bit 0)                          */
#define MSPI_CQPAUSE_CQMASK_Msk           (0xffffUL)                /*!< MSPI CQPAUSE: CQMASK (Bitfield-Mask: 0xffff)          */
/* =======================================================  CQCURIDX  ======================================================== */
#define MSPI_CQCURIDX_CQCURIDX_Pos        (0UL)                     /*!< MSPI CQCURIDX: CQCURIDX (Bit 0)                       */
#define MSPI_CQCURIDX_CQCURIDX_Msk        (0xffUL)                  /*!< MSPI CQCURIDX: CQCURIDX (Bitfield-Mask: 0xff)         */
/* =======================================================  CQENDIDX  ======================================================== */
#define MSPI_CQENDIDX_CQENDIDX_Pos        (0UL)                     /*!< MSPI CQENDIDX: CQENDIDX (Bit 0)                       */
#define MSPI_CQENDIDX_CQENDIDX_Msk        (0xffUL)                  /*!< MSPI CQENDIDX: CQENDIDX (Bitfield-Mask: 0xff)         */


/* =========================================================================================================================== */
/* ================                                            PDM                                            ================ */
/* =========================================================================================================================== */

