tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* =======================================================  SUPPLYSRC  ======================================================= */
#define PWRCTRL_SUPPLYSRC_BLEBUCKEN_Pos   (0UL)                     /*!< PWRCTRL SUPPLYSRC: BLEBUCKEN (Bit 0)                  */
#define PWRCTRL_SUPPLYSRC_BLEBUCKEN_Msk   (0x1UL)                   /*!< PWRCTRL SUPPLYSRC: BLEBUCKEN (Bitfield-Mask: 0x01)    */
/* =====================================================  SUPPLYSTATUS  ====================================================== */
#define PWRCTRL_SUPPLYSTATUS_BLEBUCKON_Pos (1UL)                    /*!< PWRCTRL SUPPLYSTATUS: BLEBUCKON (Bit 1)               */
#define PWRCTRL_SUPPLYSTATUS_BLEBUCKON_Msk (0x2UL)                  /*!< PWRCTRL SUPPLYSTATUS: BLEBUCKON (Bitfield-Mask: 0x01) */
#define PWRCTRL_SUPPLYSTATUS_SIMOBUCKON_Pos (0UL)                   /*!< PWRCTRL SUPPLYSTATUS: SIMOBUCKON (Bit 0)              */
#define PWRCTRL_SUPPLYSTATUS_SIMOBUCKON_Msk (0x1UL)                 /*!< PWRCTRL SUPPLYSTATUS: SIMOBUCKON (Bitfield-Mask: 0x01) */
/* =======================================================  DEVPWREN  ======================================================== */
#define PWRCTRL_DEVPWREN_PWRBLEL_Pos      (13UL)                    /*!< PWRCTRL DEVPWREN: PWRBLEL (Bit 13)                    */
#define PWRCTRL_DEVPWREN_PWRBLEL_Msk      (0x2000UL)                /*!< PWRCTRL DEVPWREN: PWRBLEL (Bitfield-Mask: 0x01)       */
#define PWRCTRL_DEVPWREN_PWRPDM_Pos       (12UL)                    /*!< PWRCTRL DEVPWREN: PWRPDM (Bit 12)                     */
#define PWRCTRL_DEVPWREN_PWRPDM_Msk       (0x1000UL)                /*!< PWRCTRL DEVPWREN: PWRPDM (Bitfield-Mask: 0x01)        */
#define PWRCTRL_DEVPWREN_PWRMSPI_Pos      (11UL)                    /*!< PWRCTRL DEVPWREN: PWRMSPI (Bit 11)                    */
#define PWRCTRL_DEVPWREN_PWRMSPI_Msk      (0x800UL)                 /*!< PWRCTRL DEVPWREN: PWRMSPI (Bitfield-Mask: 0x01)       */
#define PWRCTRL_DEVPWREN_PWRSCARD_Pos     (10UL)                    /*!< PWRCTRL DEVPWREN: PWRSCARD (Bit 10)                   */
#define PWRCTRL_DEVPWREN_PWRSCARD_Msk     (0x400UL)                 /*!< PWRCTRL DEVPWREN: PWRSCARD (Bitfield-Mask: 0x01)      */
#define PWRCTRL_DEVPWREN_PWRADC_Pos       (9UL)                     /*!< PWRCTRL DEVPWREN: PWRADC (Bit 9)                      */
#define PWRCTRL_DEVPWREN_PWRADC_Msk       (0x200UL)                 /*!< PWRCTRL DEVPWREN: PWRADC (Bitfield-Mask: 0x01)        */
#define PWRCTRL_DEVPWREN_PWRUART1_Pos     (8UL)                     /*!< PWRCTRL DEVPWREN: PWRUART1 (Bit 8)                    */
#define PWRCTRL_DEVPWREN_PWRUART1_Msk     (0x100UL)                 /*!< PWRCTRL DEVPWREN: PWRUART1 (Bitfield-Mask: 0x01)      */
#define PWRCTRL_DEVPWREN_PWRUART0_Pos     (7UL)                     /*!< PWRCTRL DEVPWREN: PWRUART0 (Bit 7)                    */
#define PWRCTRL_DEVPWREN_PWRUART0_Msk     (0x80UL)                  /*!< PWRCTRL DEVPWREN: PWRUART0 (Bitfield-Mask: 0x01)      */
#define PWRCTRL_DEVPWREN_PWRIOM5_Pos      (6UL)                     /*!< PWRCTRL DEVPWREN: PWRIOM5 (Bit 6)                     */
#define PWRCTRL_DEVPWREN_PWRIOM5_Msk      (0x40UL)                  /*!< PWRCTRL DEVPWREN: PWRIOM5 (Bitfield-Mask: 0x01)       */
#define PWRCTRL_DEVPWREN_PWRIOM4_Pos      (5UL)                     /*!< PWRCTRL DEVPWREN: PWRIOM4 (Bit 5)                     */
#define PWRCTRL_DEVPWREN_PWRIOM4_Msk      (0x20UL)                  /*!< PWRCTRL DEVPWREN: PWRIOM4 (Bitfield-Mask: 0x01)       */
#define PWRCTRL_DEVPWREN_PWRIOM3_Pos      (4UL)                     /*!< PWRCTRL DEVPWREN: PWRIOM3 (Bit 4)                     */
#define PWRCTRL_DEVPWREN_PWRIOM3_Msk      (0x10UL)                  /*!< PWRCTRL DEVPWREN: PWRIOM3 (Bitfield-Mask: 0x01)       */
#define PWRCTRL_DEVPWREN_PWRIOM2_Pos      (3UL)                     /*!< PWRCTRL DEVPWREN: PWRIOM2 (Bit 3)                     */
#define PWRCTRL_DEVPWREN_PWRIOM2_Msk      (0x8UL)                   /*!< PWRCTRL DEVPWREN: PWRIOM2 (Bitfield-Mask: 0x01)       */
#define PWRCTRL_DEVPWREN_PWRIOM1_Pos      (2UL)                     /*!< PWRCTRL DEVPWREN: PWRIOM1 (Bit 2)                     */
#define PWRCTRL_DEVPWREN_PWRIOM1_Msk      (0x4UL)                   /*!< PWRCTRL DEVPWREN: PWRIOM1 (Bitfield-Mask: 0x01)       */
#define PWRCTRL_DEVPWREN_PWRIOM0_Pos      (1UL)                     /*!< PWRCTRL DEVPWREN: PWRIOM0 (Bit 1)                     */
#define PWRCTRL_DEVPWREN_PWRIOM0_Msk      (0x2UL)                   /*!< PWRCTRL DEVPWREN: PWRIOM0 (Bitfield-Mask: 0x01)       */
#define PWRCTRL_DEVPWREN_PWRIOS_Pos       (0UL)                     /*!< PWRCTRL DEVPWREN: PWRIOS (Bit 0)                      */
#define PWRCTRL_DEVPWREN_PWRIOS_Msk       (0x1UL)                   /*!< PWRCTRL DEVPWREN: PWRIOS (Bitfield-Mask: 0x01)        */
/* =====================================================  MEMPWDINSLEEP  ===================================================== */
#define PWRCTRL_MEMPWDINSLEEP_CACHEPWDSLP_Pos (31UL)                /*!< PWRCTRL MEMPWDINSLEEP: CACHEPWDSLP (Bit 31)           */
#define PWRCTRL_MEMPWDINSLEEP_CACHEPWDSLP_Msk (0x80000000UL)        /*!< PWRCTRL MEMPWDINSLEEP: CACHEPWDSLP (Bitfield-Mask: 0x01) */
#define PWRCTRL_MEMPWDINSLEEP_FLASH1PWDSLP_Pos (14UL)               /*!< PWRCTRL MEMPWDINSLEEP: FLASH1PWDSLP (Bit 14)          */
#define PWRCTRL_MEMPWDINSLEEP_FLASH1PWDSLP_Msk (0x4000UL)           /*!< PWRCTRL MEMPWDINSLEEP: FLASH1PWDSLP (Bitfield-Mask: 0x01) */
#define PWRCTRL_MEMPWDINSLEEP_FLASH0PWDSLP_Pos (13UL)               /*!< PWRCTRL MEMPWDINSLEEP: FLASH0PWDSLP (Bit 13)          */
#define PWRCTRL_MEMPWDINSLEEP_FLASH0PWDSLP_Msk (0x2000UL)           /*!< PWRCTRL MEMPWDINSLEEP: FLASH0PWDSLP (Bitfield-Mask: 0x01) */
#define PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_Pos (3UL)                  /*!< PWRCTRL MEMPWDINSLEEP: SRAMPWDSLP (Bit 3)             */
#define PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_Msk (0x1ff8UL)             /*!< PWRCTRL MEMPWDINSLEEP: SRAMPWDSLP (Bitfield-Mask: 0x3ff) */
#define PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_Pos (0UL)                  /*!< PWRCTRL MEMPWDINSLEEP: DTCMPWDSLP (Bit 0)             */
#define PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_Msk (0x7UL)                /*!< PWRCTRL MEMPWDINSLEEP: DTCMPWDSLP (Bitfield-Mask: 0x07) */
/* =======================================================  MEMPWREN  ======================================================== */
#define PWRCTRL_MEMPWREN_CACHEB2_Pos      (31UL)                    /*!< PWRCTRL MEMPWREN: CACHEB2 (Bit 31)                    */
#define PWRCTRL_MEMPWREN_CACHEB2_Msk      (0x80000000UL)            /*!< PWRCTRL MEMPWREN: CACHEB2 (Bitfield-Mask: 0x01)       */
#define PWRCTRL_MEMPWREN_CACHEB0_Pos      (30UL)                    /*!< PWRCTRL MEMPWREN: CACHEB0 (Bit 30)                    */
#define PWRCTRL_MEMPWREN_CACHEB0_Msk      (0x40000000UL)            /*!< PWRCTRL MEMPWREN: CACHEB0 (Bitfield-Mask: 0x01)       */
#define PWRCTRL_MEMPWREN_FLASH1_Pos       (14UL)                    /*!< PWRCTRL MEMPWREN: FLASH1 (Bit 14)                     */
#define PWRCTRL_MEMPWREN_FLASH1_Msk       (0x4000UL)                /*!< PWRCTRL MEMPWREN: FLASH1 (Bitfield-Mask: 0x01)        */
#define PWRCTRL_MEMPWREN_FLASH0_Pos       (13UL)                    /*!< PWRCTRL MEMPWREN: FLASH0 (Bit 13)                     */
#define PWRCTRL_MEMPWREN_FLASH0_Msk       (0x2000UL)                /*!< PWRCTRL MEMPWREN: FLASH0 (Bitfield-Mask: 0x01)        */
#define PWRCTRL_MEMPWREN_SRAM_Pos         (3UL)                     /*!< PWRCTRL MEMPWREN: SRAM (Bit 3)                        */
#define PWRCTRL_MEMPWREN_SRAM_Msk         (0x1ff8UL)                /*!< PWRCTRL MEMPWREN: SRAM (Bitfield-Mask: 0x3ff)         */
#define PWRCTRL_MEMPWREN_DTCM_Pos         (0UL)                     /*!< PWRCTRL MEMPWREN: DTCM (Bit 0)                        */
#define PWRCTRL_MEMPWREN_DTCM_Msk         (0x7UL)                   /*!< PWRCTRL MEMPWREN: DTCM (Bitfield-Mask: 0x07)          */
/* =====================================================  MEMPWRSTATUS  ====================================================== */
#define PWRCTRL_MEMPWRSTATUS_CACHEB2_Pos  (16UL)                    /*!< PWRCTRL MEMPWRSTATUS: CACHEB2 (Bit 16)                */
#define PWRCTRL_MEMPWRSTATUS_CACHEB2_Msk  (0x10000UL)               /*!< PWRCTRL MEMPWRSTATUS: CACHEB2 (Bitfield-Mask: 0x01)   */
#define PWRCTRL_MEMPWRSTATUS_CACHEB0_Pos  (15UL)                    /*!< PWRCTRL MEMPWRSTATUS: CACHEB0 (Bit 15)                */
#define PWRCTRL_MEMPWRSTATUS_CACHEB0_Msk  (0x8000UL)                /*!< PWRCTRL MEMPWRSTATUS: CACHEB0 (Bitfield-Mask: 0x01)   */
#define PWRCTRL_MEMPWRSTATUS_FLASH1_Pos   (14UL)                    /*!< PWRCTRL MEMPWRSTATUS: FLASH1 (Bit 14)                 */
#define PWRCTRL_MEMPWRSTATUS_FLASH1_Msk   (0x4000UL)                /*!< PWRCTRL MEMPWRSTATUS: FLASH1 (Bitfield-Mask: 0x01)    */
#define PWRCTRL_MEMPWRSTATUS_FLASH0_Pos   (13UL)                    /*!< PWRCTRL MEMPWRSTATUS: FLASH0 (Bit 13)                 */
#define PWRCTRL_MEMPWRSTATUS_FLASH0_Msk   (0x2000UL)                /*!< PWRCTRL MEMPWRSTATUS: FLASH0 (Bitfield-Mask: 0x01)    */
#define PWRCTRL_MEMPWRSTATUS_SRAM9_Pos    (12UL)                    /*!< PWRCTRL MEMPWRSTATUS: SRAM9 (Bit 12)                  */
#define PWRCTRL_MEMPWRSTATUS_SRAM9_Msk    (0x1000UL)                /*!< PWRCTRL MEMPWRSTATUS: SRAM9 (Bitfield-Mask: 0x01)     */
#define PWRCTRL_MEMPWRSTATUS_SRAM8_Pos    (11UL)                    /*!< PWRCTRL MEMPWRSTATUS: SRAM8 (Bit 11)                  */
#define PWRCTRL_MEMPWRSTATUS_SRAM8_Msk    (0x800UL)                 /*!< PWRCTRL MEMPWRSTATUS: SRAM8 (Bitfield-Mask: 0x01)     */
#define PWRCTRL_MEMPWRSTATUS_SRAM7_Pos    (10UL)                    /*!< PWRCTRL MEMPWRSTATUS: SRAM7 (Bit 10)                  */
#define PWRCTRL_MEMPWRSTATUS_SRAM7_Msk    (0x400UL)                 /*!< PWRCTRL MEMPWRSTATUS: SRAM7 (Bitfield-Mask: 0x01)     */
#define PWRCTRL_MEMPWRSTATUS_SRAM6_Pos    (9UL)                     /*!< PWRCTRL MEMPWRSTATUS: SRAM6 (Bit 9)                   */
#define PWRCTRL_MEMPWRSTATUS_SRAM6_Msk    (0x200UL)                 /*!< PWRCTRL MEMPWRSTATUS: SRAM6 (Bitfield-Mask: 0x01)     */
#define PWRCTRL_MEMPWRSTATUS_SRAM5_Pos    (8UL)                     /*!< PWRCTRL MEMPWRSTATUS: SRAM5 (Bit 8)                   */
#define PWRCTRL_MEMPWRSTATUS_SRAM5_Msk    (0x100UL)                 /*!< PWRCTRL MEMPWRSTATUS: SRAM5 (Bitfield-Mask: 0x01)     */
#define PWRCTRL_MEMPWRSTATUS_SRAM4_Pos    (7UL)                     /*!< PWRCTRL MEMPWRSTATUS: SRAM4 (Bit 7)                   */
#define PWRCTRL_MEMPWRSTATUS_SRAM4_Msk    (0x80UL)                  /*!< PWRCTRL MEMPWRSTATUS: SRAM4 (Bitfield-Mask: 0x01)     */
#define PWRCTRL_MEMPWRSTATUS_SRAM3_Pos    (6UL)                     /*!< PWRCTRL MEMPWRSTATUS: SRAM3 (Bit 6)                   */
#define PWRCTRL_MEMPWRSTATUS_SRAM3_Msk    (0x40UL)                  /*!< PWRCTRL MEMPWRSTATUS: SRAM3 (Bitfield-Mask: 0x01)     */
#define PWRCTRL_MEMPWRSTATUS_SRAM2_Pos    (5UL)                     /*!< PWRCTRL MEMPWRSTATUS: SRAM2 (Bit 5)                   */
#define PWRCTRL_MEMPWRSTATUS_SRAM2_Msk    (0x20UL)                  /*!< PWRCTRL MEMPWRSTATUS: SRAM2 (Bitfield-Mask: 0x01)     */
#define PWRCTRL_MEMPWRSTATUS_SRAM1_Pos    (4UL)                     /*!< PWRCTRL MEMPWRSTATUS: SRAM1 (Bit 4)                   */
#define PWRCTRL_MEMPWRSTATUS_SRAM1_Msk    (0x10UL)                  /*!< PWRCTRL MEMPWRSTATUS: SRAM1 (Bitfield-Mask: 0x01)     */
#define PWRCTRL_MEMPWRSTATUS_SRAM0_Pos    (3UL)                     /*!< PWRCTRL MEMPWRSTATUS: SRAM0 (Bit 3)                   */
#define PWRCTRL_MEMPWRSTATUS_SRAM0_Msk    (0x8UL)                   /*!< PWRCTRL MEMPWRSTATUS: SRAM0 (Bitfield-Mask: 0x01)     */
#define PWRCTRL_MEMPWRSTATUS_DTCM1_Pos    (2UL)                     /*!< PWRCTRL MEMPWRSTATUS: DTCM1 (Bit 2)                   */
#define PWRCTRL_MEMPWRSTATUS_DTCM1_Msk    (0x4UL)                   /*!< PWRCTRL MEMPWRSTATUS: DTCM1 (Bitfield-Mask: 0x01)     */
#define PWRCTRL_MEMPWRSTATUS_DTCM01_Pos   (1UL)                     /*!< PWRCTRL MEMPWRSTATUS: DTCM01 (Bit 1)                  */
#define PWRCTRL_MEMPWRSTATUS_DTCM01_Msk   (0x2UL)                   /*!< PWRCTRL MEMPWRSTATUS: DTCM01 (Bitfield-Mask: 0x01)    */
#define PWRCTRL_MEMPWRSTATUS_DTCM00_Pos   (0UL)                     /*!< PWRCTRL MEMPWRSTATUS: DTCM00 (Bit 0)                  */
#define PWRCTRL_MEMPWRSTATUS_DTCM00_Msk   (0x1UL)                   /*!< PWRCTRL MEMPWRSTATUS: DTCM00 (Bitfield-Mask: 0x01)    */
/* =====================================================  DEVPWRSTATUS  ====================================================== */
#define PWRCTRL_DEVPWRSTATUS_SYSDEEPSLEEP_Pos (31UL)                /*!< PWRCTRL DEVPWRSTATUS: SYSDEEPSLEEP (Bit 31)           */
#define PWRCTRL_DEVPWRSTATUS_SYSDEEPSLEEP_Msk (0x80000000UL)        /*!< PWRCTRL DEVPWRSTATUS: SYSDEEPSLEEP (Bitfield-Mask: 0x01) */
#define PWRCTRL_DEVPWRSTATUS_COREDEEPSLEEP_Pos (30UL)               /*!< PWRCTRL DEVPWRSTATUS: COREDEEPSLEEP (Bit 30)          */
#define PWRCTRL_DEVPWRSTATUS_COREDEEPSLEEP_Msk (0x40000000UL)       /*!< PWRCTRL DEVPWRSTATUS: COREDEEPSLEEP (Bitfield-Mask: 0x01) */
#define PWRCTRL_DEVPWRSTATUS_CORESLEEP_Pos (29UL)                   /*!< PWRCTRL DEVPWRSTATUS: CORESLEEP (Bit 29)              */
#define PWRCTRL_DEVPWRSTATUS_CORESLEEP_Msk (0x20000000UL)           /*!< PWRCTRL DEVPWRSTATUS: CORESLEEP (Bitfield-Mask: 0x01) */
#define PWRCTRL_DEVPWRSTATUS_BLEH_Pos     (9UL)                     /*!< PWRCTRL DEVPWRSTATUS: BLEH (Bit 9)                    */
#define PWRCTRL_DEVPWRSTATUS_BLEH_Msk     (0x200UL)                 /*!< PWRCTRL DEVPWRSTATUS: BLEH (Bitfield-Mask: 0x01)      */
#define PWRCTRL_DEVPWRSTATUS_BLEL_Pos     (8UL)                     /*!< PWRCTRL DEVPWRSTATUS: BLEL (Bit 8)                    */
#define PWRCTRL_DEVPWRSTATUS_BLEL_Msk     (0x100UL)                 /*!< PWRCTRL DEVPWRSTATUS: BLEL (Bitfield-Mask: 0x01)      */
#define PWRCTRL_DEVPWRSTATUS_PWRPDM_Pos   (7UL)                     /*!< PWRCTRL DEVPWRSTATUS: PWRPDM (Bit 7)                  */
#define PWRCTRL_DEVPWRSTATUS_PWRPDM_Msk   (0x80UL)                  /*!< PWRCTRL DEVPWRSTATUS: PWRPDM (Bitfield-Mask: 0x01)    */
#define PWRCTRL_DEVPWRSTATUS_PWRMSPI_Pos  (6UL)                     /*!< PWRCTRL DEVPWRSTATUS: PWRMSPI (Bit 6)                 */
#define PWRCTRL_DEVPWRSTATUS_PWRMSPI_Msk  (0x40UL)                  /*!< PWRCTRL DEVPWRSTATUS: PWRMSPI (Bitfield-Mask: 0x01)   */
#define PWRCTRL_DEVPWRSTATUS_PWRADC_Pos   (5UL)                     /*!< PWRCTRL DEVPWRSTATUS: PWRADC (Bit 5)                  */
#define PWRCTRL_DEVPWRSTATUS_PWRADC_Msk   (0x20UL)                  /*!< PWRCTRL DEVPWRSTATUS: PWRADC (Bitfield-Mask: 0x01)    */
#define PWRCTRL_DEVPWRSTATUS_HCPC_Pos     (4UL)                     /*!< PWRCTRL DEVPWRSTATUS: HCPC (Bit 4)                    */
#define PWRCTRL_DEVPWRSTATUS_HCPC_Msk     (0x10UL)                  /*!< PWRCTRL DEVPWRSTATUS: HCPC (Bitfield-Mask: 0x01)      */
#define PWRCTRL_DEVPWRSTATUS_HCPB_Pos     (3UL)                     /*!< PWRCTRL DEVPWRSTATUS: HCPB (Bit 3)                    */
#define PWRCTRL_DEVPWRSTATUS_HCPB_Msk     (0x8UL)                   /*!< PWRCTRL DEVPWRSTATUS: HCPB (Bitfield-Mask: 0x01)      */
#define PWRCTRL_DEVPWRSTATUS_HCPA_Pos     (2UL)                     /*!< PWRCTRL DEVPWRSTATUS: HCPA (Bit 2)                    */
#define PWRCTRL_DEVPWRSTATUS_HCPA_Msk     (0x4UL)                   /*!< PWRCTRL DEVPWRSTATUS: HCPA (Bitfield-Mask: 0x01)      */
#define PWRCTRL_DEVPWRSTATUS_MCUH_Pos     (1UL)                     /*!< PWRCTRL DEVPWRSTATUS: MCUH (Bit 1)                    */
#define PWRCTRL_DEVPWRSTATUS_MCUH_Msk     (0x2UL)                   /*!< PWRCTRL DEVPWRSTATUS: MCUH (Bitfield-Mask: 0x01)      */
#define PWRCTRL_DEVPWRSTATUS_MCUL_Pos     (0UL)                     /*!< PWRCTRL DEVPWRSTATUS: MCUL (Bit 0)                    */
#define PWRCTRL_DEVPWRSTATUS_MCUL_Msk     (0x1UL)                   /*!< PWRCTRL DEVPWRSTATUS: MCUL (Bitfield-Mask: 0x01)      */
/* =======================================================  SRAMCTRL  ======================================================== */
#define PWRCTRL_SRAMCTRL_SRAMLIGHTSLEEP_Pos (8UL)                   /*!< PWRCTRL SRAMCTRL: SRAMLIGHTSLEEP (Bit 8)              */
#define PWRCTRL_SRAMCTRL_SRAMLIGHTSLEEP_Msk (0xfff00UL)             /*!< PWRCTRL SRAMCTRL: SRAMLIGHTSLEEP (Bitfield-Mask: 0xfff) */
#define PWRCTRL_SRAMCTRL_SRAMMASTERCLKGATE_Pos (2UL)                /*!< PWRCTRL SRAMCTRL: SRAMMASTERCLKGATE (Bit 2)           */
#define PWRCTRL_SRAMCTRL_SRAMMASTERCLKGATE_Msk (0x4UL)              /*!< PWRCTRL SRAMCTRL: SRAMMASTERCLKGATE (Bitfield-Mask: 0x01) */
#define PWRCTRL_SRAMCTRL_SRAMCLKGATE_Pos  (1UL)                     /*!< PWRCTRL SRAMCTRL: SRAMCLKGATE (Bit 1)                 */
#define PWRCTRL_SRAMCTRL_SRAMCLKGATE_Msk  (0x2UL)                   /*!< PWRCTRL SRAMCTRL: SRAMCLKGATE (Bitfield-Mask: 0x01)   */
/* =======================================================  ADCSTATUS  ======================================================= */
#define PWRCTRL_ADCSTATUS_REFBUFPWD_Pos   (5UL)                     /*!< PWRCTRL ADCSTATUS: REFBUFPWD (Bit 5)                  */
#define PWRCTRL_ADCSTATUS_REFBUFPWD_Msk   (0x20UL)                  /*!< PWRCTRL ADCSTATUS: REFBUFPWD (Bitfield-Mask: 0x01)    */
#define PWRCTRL_ADCSTATUS_REFKEEPPWD_Pos  (4UL)                     /*!< PWRCTRL ADCSTATUS: REFKEEPPWD (Bit 4)                 */
#define PWRCTRL_ADCSTATUS_REFKEEPPWD_Msk  (0x10UL)                  /*!< PWRCTRL ADCSTATUS: REFKEEPPWD (Bitfield-Mask: 0x01)   */
#define PWRCTRL_ADCSTATUS_VBATPWD_Pos     (3UL)                     /*!< PWRCTRL ADCSTATUS: VBATPWD (Bit 3)                    */
#define PWRCTRL_ADCSTATUS_VBATPWD_Msk     (0x8UL)                   /*!< PWRCTRL ADCSTATUS: VBATPWD (Bitfield-Mask: 0x01)      */
#define PWRCTRL_ADCSTATUS_VPTATPWD_Pos    (2UL)                     /*!< PWRCTRL ADCSTATUS: VPTATPWD (Bit 2)                   */
#define PWRCTRL_ADCSTATUS_VPTATPWD_Msk    (0x4UL)                   /*!< PWRCTRL ADCSTATUS: VPTATPWD (Bitfield-Mask: 0x01)     */
#define PWRCTRL_ADCSTATUS_BGTPWD_Pos      (1UL)                     /*!< PWRCTRL ADCSTATUS: BGTPWD (Bit 1)                     */
#define PWRCTRL_ADCSTATUS_BGTPWD_Msk      (0x2UL)                   /*!< PWRCTRL ADCSTATUS: BGTPWD (Bitfield-Mask: 0x01)       */
#define PWRCTRL_ADCSTATUS_ADCPWD_Pos      (0UL)                     /*!< PWRCTRL ADCSTATUS: ADCPWD (Bit 0)                     */
#define PWRCTRL_ADCSTATUS_ADCPWD_Msk      (0x1UL)                   /*!< PWRCTRL ADCSTATUS: ADCPWD (Bitfield-Mask: 0x01)       */
/* =========================================================  MISC  ========================================================== */
#define PWRCTRL_MISC_FORCEBLEBUCKACT_Pos  (7UL)                     /*!< PWRCTRL MISC: FORCEBLEBUCKACT (Bit 7)                 */
#define PWRCTRL_MISC_FORCEBLEBUCKACT_Msk  (0x80UL)                  /*!< PWRCTRL MISC: FORCEBLEBUCKACT (Bitfield-Mask: 0x01)   */
#define PWRCTRL_MISC_MEMVRLPBLE_Pos       (6UL)                     /*!< PWRCTRL MISC: MEMVRLPBLE (Bit 6)                      */
#define PWRCTRL_MISC_MEMVRLPBLE_Msk       (0x40UL)                  /*!< PWRCTRL MISC: MEMVRLPBLE (Bitfield-Mask: 0x01)        */
#define PWRCTRL_MISC_FORCEMEMVRADC_Pos    (4UL)                     /*!< PWRCTRL MISC: FORCEMEMVRADC (Bit 4)                   */
#define PWRCTRL_MISC_FORCEMEMVRADC_Msk    (0x30UL)                  /*!< PWRCTRL MISC: FORCEMEMVRADC (Bitfield-Mask: 0x03)     */
#define PWRCTRL_MISC_FORCEMEMVRLPTIMERS_Pos (3UL)                   /*!< PWRCTRL MISC: FORCEMEMVRLPTIMERS (Bit 3)              */
#define PWRCTRL_MISC_FORCEMEMVRLPTIMERS_Msk (0x8UL)                 /*!< PWRCTRL MISC: FORCEMEMVRLPTIMERS (Bitfield-Mask: 0x01) */
#define PWRCTRL_MISC_FORCECOREVRLPTIMERS_Pos (2UL)                  /*!< PWRCTRL MISC: FORCECOREVRLPTIMERS (Bit 2)             */
#define PWRCTRL_MISC_FORCECOREVRLPTIMERS_Msk (0x4UL)                /*!< PWRCTRL MISC: FORCECOREVRLPTIMERS (Bitfield-Mask: 0x01) */
#define PWRCTRL_MISC_FORCECOREVRLPPDM_Pos (1UL)                     /*!< PWRCTRL MISC: FORCECOREVRLPPDM (Bit 1)                */
#define PWRCTRL_MISC_FORCECOREVRLPPDM_Msk (0x2UL)                   /*!< PWRCTRL MISC: FORCECOREVRLPPDM (Bitfield-Mask: 0x01)  */
#define PWRCTRL_MISC_SIMOBUCKEN_Pos       (0UL)                     /*!< PWRCTRL MISC: SIMOBUCKEN (Bit 0)                      */
#define PWRCTRL_MISC_SIMOBUCKEN_Msk       (0x1UL)                   /*!< PWRCTRL MISC: SIMOBUCKEN (Bitfield-Mask: 0x01)        */
/* =====================================================  DEVPWREVENTEN  ===================================================== */
#define PWRCTRL_DEVPWREVENTEN_BURSTEVEN_Pos (31UL)                  /*!< PWRCTRL DEVPWREVENTEN: BURSTEVEN (Bit 31)             */
#define PWRCTRL_DEVPWREVENTEN_BURSTEVEN_Msk (0x80000000UL)          /*!< PWRCTRL DEVPWREVENTEN: BURSTEVEN (Bitfield-Mask: 0x01) */
#define PWRCTRL_DEVPWREVENTEN_BURSTFEATUREEVEN_Pos (30UL)           /*!< PWRCTRL DEVPWREVENTEN: BURSTFEATUREEVEN (Bit 30)      */
#define PWRCTRL_DEVPWREVENTEN_BURSTFEATUREEVEN_Msk (0x40000000UL)   /*!< PWRCTRL DEVPWREVENTEN: BURSTFEATUREEVEN (Bitfield-Mask: 0x01) */
#define PWRCTRL_DEVPWREVENTEN_BLEFEATUREEVEN_Pos (29UL)             /*!< PWRCTRL DEVPWREVENTEN: BLEFEATUREEVEN (Bit 29)        */
#define PWRCTRL_DEVPWREVENTEN_BLEFEATUREEVEN_Msk (0x20000000UL)     /*!< PWRCTRL DEVPWREVENTEN: BLEFEATUREEVEN (Bitfield-Mask: 0x01) */
#define PWRCTRL_DEVPWREVENTEN_BLELEVEN_Pos (8UL)                    /*!< PWRCTRL DEVPWREVENTEN: BLELEVEN (Bit 8)               */
#define PWRCTRL_DEVPWREVENTEN_BLELEVEN_Msk (0x100UL)                /*!< PWRCTRL DEVPWREVENTEN: BLELEVEN (Bitfield-Mask: 0x01) */
#define PWRCTRL_DEVPWREVENTEN_PDMEVEN_Pos (7UL)                     /*!< PWRCTRL DEVPWREVENTEN: PDMEVEN (Bit 7)                */
#define PWRCTRL_DEVPWREVENTEN_PDMEVEN_Msk (0x80UL)                  /*!< PWRCTRL DEVPWREVENTEN: PDMEVEN (Bitfield-Mask: 0x01)  */
#define PWRCTRL_DEVPWREVENTEN_MSPIEVEN_Pos (6UL)                    /*!< PWRCTRL DEVPWREVENTEN: MSPIEVEN (Bit 6)               */
#define PWRCTRL_DEVPWREVENTEN_MSPIEVEN_Msk (0x40UL)                 /*!< PWRCTRL DEVPWREVENTEN: MSPIEVEN (Bitfield-Mask: 0x01) */
#define PWRCTRL_DEVPWREVENTEN_ADCEVEN_Pos (5UL)                     /*!< PWRCTRL DEVPWREVENTEN: ADCEVEN (Bit 5)                */
#define PWRCTRL_DEVPWREVENTEN_ADCEVEN_Msk (0x20UL)                  /*!< PWRCTRL DEVPWREVENTEN: ADCEVEN (Bitfield-Mask: 0x01)  */
#define PWRCTRL_DEVPWREVENTEN_HCPCEVEN_Pos (4UL)                    /*!< PWRCTRL DEVPWREVENTEN: HCPCEVEN (Bit 4)               */
#define PWRCTRL_DEVPWREVENTEN_HCPCEVEN_Msk (0x10UL)                 /*!< PWRCTRL DEVPWREVENTEN: HCPCEVEN (Bitfield-Mask: 0x01) */
#define PWRCTRL_DEVPWREVENTEN_HCPBEVEN_Pos (3UL)                    /*!< PWRCTRL DEVPWREVENTEN: HCPBEVEN (Bit 3)               */
#define PWRCTRL_DEVPWREVENTEN_HCPBEVEN_Msk (0x8UL)                  /*!< PWRCTRL DEVPWREVENTEN: HCPBEVEN (Bitfield-Mask: 0x01) */
#define PWRCTRL_DEVPWREVENTEN_HCPAEVEN_Pos (2UL)                    /*!< PWRCTRL DEVPWREVENTEN: HCPAEVEN (Bit 2)               */
#define PWRCTRL_DEVPWREVENTEN_HCPAEVEN_Msk (0x4UL)                  /*!< PWRCTRL DEVPWREVENTEN: HCPAEVEN (Bitfield-Mask: 0x01) */
#define PWRCTRL_DEVPWREVENTEN_MCUHEVEN_Pos (1UL)                    /*!< PWRCTRL DEVPWREVENTEN: MCUHEVEN (Bit 1)               */
#define PWRCTRL_DEVPWREVENTEN_MCUHEVEN_Msk (0x2UL)                  /*!< PWRCTRL DEVPWREVENTEN: MCUHEVEN (Bitfield-Mask: 0x01) */
#define PWRCTRL_DEVPWREVENTEN_MCULEVEN_Pos (0UL)                    /*!< PWRCTRL DEVPWREVENTEN: MCULEVEN (Bit 0)               */
#define PWRCTRL_DEVPWREVENTEN_MCULEVEN_Msk (0x1UL)                  /*!< PWRCTRL DEVPWREVENTEN: MCULEVEN (Bitfield-Mask: 0x01) */
/* =====================================================  MEMPWREVENTEN  ===================================================== */
