tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
#define PWRCTRL_MEMPWREVENTEN_CACHEB2EN_Pos (31UL)                  /*!< PWRCTRL MEMPWREVENTEN: CACHEB2EN (Bit 31)             */
#define PWRCTRL_MEMPWREVENTEN_CACHEB2EN_Msk (0x80000000UL)          /*!< PWRCTRL MEMPWREVENTEN: CACHEB2EN (Bitfield-Mask: 0x01) */
#define PWRCTRL_MEMPWREVENTEN_CACHEB0EN_Pos (30UL)                  /*!< PWRCTRL MEMPWREVENTEN: CACHEB0EN (Bit 30)             */
#define PWRCTRL_MEMPWREVENTEN_CACHEB0EN_Msk (0x40000000UL)          /*!< PWRCTRL MEMPWREVENTEN: CACHEB0EN (Bitfield-Mask: 0x01) */
#define PWRCTRL_MEMPWREVENTEN_FLASH1EN_Pos (14UL)                   /*!< PWRCTRL MEMPWREVENTEN: FLASH1EN (Bit 14)              */
#define PWRCTRL_MEMPWREVENTEN_FLASH1EN_Msk (0x4000UL)               /*!< PWRCTRL MEMPWREVENTEN: FLASH1EN (Bitfield-Mask: 0x01) */
#define PWRCTRL_MEMPWREVENTEN_FLASH0EN_Pos (13UL)                   /*!< PWRCTRL MEMPWREVENTEN: FLASH0EN (Bit 13)              */
#define PWRCTRL_MEMPWREVENTEN_FLASH0EN_Msk (0x2000UL)               /*!< PWRCTRL MEMPWREVENTEN: FLASH0EN (Bitfield-Mask: 0x01) */
#define PWRCTRL_MEMPWREVENTEN_SRAMEN_Pos  (3UL)                     /*!< PWRCTRL MEMPWREVENTEN: SRAMEN (Bit 3)                 */
#define PWRCTRL_MEMPWREVENTEN_SRAMEN_Msk  (0x1ff8UL)                /*!< PWRCTRL MEMPWREVENTEN: SRAMEN (Bitfield-Mask: 0x3ff)  */
#define PWRCTRL_MEMPWREVENTEN_DTCMEN_Pos  (0UL)                     /*!< PWRCTRL MEMPWREVENTEN: DTCMEN (Bit 0)                 */
#define PWRCTRL_MEMPWREVENTEN_DTCMEN_Msk  (0x7UL)                   /*!< PWRCTRL MEMPWREVENTEN: DTCMEN (Bitfield-Mask: 0x07)   */


/* =========================================================================================================================== */
/* ================                                          RSTGEN                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
#define RSTGEN_CFG_WDREN_Pos              (1UL)                     /*!< RSTGEN CFG: WDREN (Bit 1)                             */
#define RSTGEN_CFG_WDREN_Msk              (0x2UL)                   /*!< RSTGEN CFG: WDREN (Bitfield-Mask: 0x01)               */
#define RSTGEN_CFG_BODHREN_Pos            (0UL)                     /*!< RSTGEN CFG: BODHREN (Bit 0)                           */
#define RSTGEN_CFG_BODHREN_Msk            (0x1UL)                   /*!< RSTGEN CFG: BODHREN (Bitfield-Mask: 0x01)             */
/* =========================================================  SWPOI  ========================================================= */
#define RSTGEN_SWPOI_SWPOIKEY_Pos         (0UL)                     /*!< RSTGEN SWPOI: SWPOIKEY (Bit 0)                        */
#define RSTGEN_SWPOI_SWPOIKEY_Msk         (0xffUL)                  /*!< RSTGEN SWPOI: SWPOIKEY (Bitfield-Mask: 0xff)          */
/* =========================================================  SWPOR  ========================================================= */
#define RSTGEN_SWPOR_SWPORKEY_Pos         (0UL)                     /*!< RSTGEN SWPOR: SWPORKEY (Bit 0)                        */
#define RSTGEN_SWPOR_SWPORKEY_Msk         (0xffUL)                  /*!< RSTGEN SWPOR: SWPORKEY (Bitfield-Mask: 0xff)          */
/* ========================================================  TPIURST  ======================================================== */
#define RSTGEN_TPIURST_TPIURST_Pos        (0UL)                     /*!< RSTGEN TPIURST: TPIURST (Bit 0)                       */
#define RSTGEN_TPIURST_TPIURST_Msk        (0x1UL)                   /*!< RSTGEN TPIURST: TPIURST (Bitfield-Mask: 0x01)         */
/* =========================================================  INTEN  ========================================================= */
#define RSTGEN_INTEN_BODH_Pos             (0UL)                     /*!< RSTGEN INTEN: BODH (Bit 0)                            */
#define RSTGEN_INTEN_BODH_Msk             (0x1UL)                   /*!< RSTGEN INTEN: BODH (Bitfield-Mask: 0x01)              */
/* ========================================================  INTSTAT  ======================================================== */
#define RSTGEN_INTSTAT_BODH_Pos           (0UL)                     /*!< RSTGEN INTSTAT: BODH (Bit 0)                          */
#define RSTGEN_INTSTAT_BODH_Msk           (0x1UL)                   /*!< RSTGEN INTSTAT: BODH (Bitfield-Mask: 0x01)            */
/* ========================================================  INTCLR  ========================================================= */
#define RSTGEN_INTCLR_BODH_Pos            (0UL)                     /*!< RSTGEN INTCLR: BODH (Bit 0)                           */
#define RSTGEN_INTCLR_BODH_Msk            (0x1UL)                   /*!< RSTGEN INTCLR: BODH (Bitfield-Mask: 0x01)             */
/* ========================================================  INTSET  ========================================================= */
#define RSTGEN_INTSET_BODH_Pos            (0UL)                     /*!< RSTGEN INTSET: BODH (Bit 0)                           */
#define RSTGEN_INTSET_BODH_Msk            (0x1UL)                   /*!< RSTGEN INTSET: BODH (Bitfield-Mask: 0x01)             */
/* =========================================================  STAT  ========================================================== */
#define RSTGEN_STAT_SBOOT_Pos             (31UL)                    /*!< RSTGEN STAT: SBOOT (Bit 31)                           */
#define RSTGEN_STAT_SBOOT_Msk             (0x80000000UL)            /*!< RSTGEN STAT: SBOOT (Bitfield-Mask: 0x01)              */
#define RSTGEN_STAT_FBOOT_Pos             (30UL)                    /*!< RSTGEN STAT: FBOOT (Bit 30)                           */
#define RSTGEN_STAT_FBOOT_Msk             (0x40000000UL)            /*!< RSTGEN STAT: FBOOT (Bitfield-Mask: 0x01)              */
#define RSTGEN_STAT_BOBSTAT_Pos           (10UL)                    /*!< RSTGEN STAT: BOBSTAT (Bit 10)                         */
#define RSTGEN_STAT_BOBSTAT_Msk           (0x400UL)                 /*!< RSTGEN STAT: BOBSTAT (Bitfield-Mask: 0x01)            */
#define RSTGEN_STAT_BOFSTAT_Pos           (9UL)                     /*!< RSTGEN STAT: BOFSTAT (Bit 9)                          */
#define RSTGEN_STAT_BOFSTAT_Msk           (0x200UL)                 /*!< RSTGEN STAT: BOFSTAT (Bitfield-Mask: 0x01)            */
#define RSTGEN_STAT_BOCSTAT_Pos           (8UL)                     /*!< RSTGEN STAT: BOCSTAT (Bit 8)                          */
#define RSTGEN_STAT_BOCSTAT_Msk           (0x100UL)                 /*!< RSTGEN STAT: BOCSTAT (Bitfield-Mask: 0x01)            */
#define RSTGEN_STAT_BOUSTAT_Pos           (7UL)                     /*!< RSTGEN STAT: BOUSTAT (Bit 7)                          */
#define RSTGEN_STAT_BOUSTAT_Msk           (0x80UL)                  /*!< RSTGEN STAT: BOUSTAT (Bitfield-Mask: 0x01)            */
#define RSTGEN_STAT_WDRSTAT_Pos           (6UL)                     /*!< RSTGEN STAT: WDRSTAT (Bit 6)                          */
#define RSTGEN_STAT_WDRSTAT_Msk           (0x40UL)                  /*!< RSTGEN STAT: WDRSTAT (Bitfield-Mask: 0x01)            */
#define RSTGEN_STAT_DBGRSTAT_Pos          (5UL)                     /*!< RSTGEN STAT: DBGRSTAT (Bit 5)                         */
#define RSTGEN_STAT_DBGRSTAT_Msk          (0x20UL)                  /*!< RSTGEN STAT: DBGRSTAT (Bitfield-Mask: 0x01)           */
#define RSTGEN_STAT_POIRSTAT_Pos          (4UL)                     /*!< RSTGEN STAT: POIRSTAT (Bit 4)                         */
#define RSTGEN_STAT_POIRSTAT_Msk          (0x10UL)                  /*!< RSTGEN STAT: POIRSTAT (Bitfield-Mask: 0x01)           */
#define RSTGEN_STAT_SWRSTAT_Pos           (3UL)                     /*!< RSTGEN STAT: SWRSTAT (Bit 3)                          */
#define RSTGEN_STAT_SWRSTAT_Msk           (0x8UL)                   /*!< RSTGEN STAT: SWRSTAT (Bitfield-Mask: 0x01)            */
#define RSTGEN_STAT_BORSTAT_Pos           (2UL)                     /*!< RSTGEN STAT: BORSTAT (Bit 2)                          */
#define RSTGEN_STAT_BORSTAT_Msk           (0x4UL)                   /*!< RSTGEN STAT: BORSTAT (Bitfield-Mask: 0x01)            */
#define RSTGEN_STAT_PORSTAT_Pos           (1UL)                     /*!< RSTGEN STAT: PORSTAT (Bit 1)                          */
#define RSTGEN_STAT_PORSTAT_Msk           (0x2UL)                   /*!< RSTGEN STAT: PORSTAT (Bitfield-Mask: 0x01)            */
#define RSTGEN_STAT_EXRSTAT_Pos           (0UL)                     /*!< RSTGEN STAT: EXRSTAT (Bit 0)                          */
#define RSTGEN_STAT_EXRSTAT_Msk           (0x1UL)                   /*!< RSTGEN STAT: EXRSTAT (Bitfield-Mask: 0x01)            */


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  CTRLOW  ========================================================= */
#define RTC_CTRLOW_CTRHR_Pos              (24UL)                    /*!< RTC CTRLOW: CTRHR (Bit 24)                            */
#define RTC_CTRLOW_CTRHR_Msk              (0x3f000000UL)            /*!< RTC CTRLOW: CTRHR (Bitfield-Mask: 0x3f)               */
#define RTC_CTRLOW_CTRMIN_Pos             (16UL)                    /*!< RTC CTRLOW: CTRMIN (Bit 16)                           */
#define RTC_CTRLOW_CTRMIN_Msk             (0x7f0000UL)              /*!< RTC CTRLOW: CTRMIN (Bitfield-Mask: 0x7f)              */
#define RTC_CTRLOW_CTRSEC_Pos             (8UL)                     /*!< RTC CTRLOW: CTRSEC (Bit 8)                            */
#define RTC_CTRLOW_CTRSEC_Msk             (0x7f00UL)                /*!< RTC CTRLOW: CTRSEC (Bitfield-Mask: 0x7f)              */
#define RTC_CTRLOW_CTR100_Pos             (0UL)                     /*!< RTC CTRLOW: CTR100 (Bit 0)                            */
#define RTC_CTRLOW_CTR100_Msk             (0xffUL)                  /*!< RTC CTRLOW: CTR100 (Bitfield-Mask: 0xff)              */
/* =========================================================  CTRUP  ========================================================= */
#define RTC_CTRUP_CTERR_Pos               (31UL)                    /*!< RTC CTRUP: CTERR (Bit 31)                             */
#define RTC_CTRUP_CTERR_Msk               (0x80000000UL)            /*!< RTC CTRUP: CTERR (Bitfield-Mask: 0x01)                */
#define RTC_CTRUP_CEB_Pos                 (28UL)                    /*!< RTC CTRUP: CEB (Bit 28)                               */
#define RTC_CTRUP_CEB_Msk                 (0x10000000UL)            /*!< RTC CTRUP: CEB (Bitfield-Mask: 0x01)                  */
#define RTC_CTRUP_CB_Pos                  (27UL)                    /*!< RTC CTRUP: CB (Bit 27)                                */
#define RTC_CTRUP_CB_Msk                  (0x8000000UL)             /*!< RTC CTRUP: CB (Bitfield-Mask: 0x01)                   */
#define RTC_CTRUP_CTRWKDY_Pos             (24UL)                    /*!< RTC CTRUP: CTRWKDY (Bit 24)                           */
#define RTC_CTRUP_CTRWKDY_Msk             (0x7000000UL)             /*!< RTC CTRUP: CTRWKDY (Bitfield-Mask: 0x07)              */
#define RTC_CTRUP_CTRYR_Pos               (16UL)                    /*!< RTC CTRUP: CTRYR (Bit 16)                             */
#define RTC_CTRUP_CTRYR_Msk               (0xff0000UL)              /*!< RTC CTRUP: CTRYR (Bitfield-Mask: 0xff)                */
#define RTC_CTRUP_CTRMO_Pos               (8UL)                     /*!< RTC CTRUP: CTRMO (Bit 8)                              */
#define RTC_CTRUP_CTRMO_Msk               (0x1f00UL)                /*!< RTC CTRUP: CTRMO (Bitfield-Mask: 0x1f)                */
#define RTC_CTRUP_CTRDATE_Pos             (0UL)                     /*!< RTC CTRUP: CTRDATE (Bit 0)                            */
#define RTC_CTRUP_CTRDATE_Msk             (0x3fUL)                  /*!< RTC CTRUP: CTRDATE (Bitfield-Mask: 0x3f)              */
/* ========================================================  ALMLOW  ========================================================= */
#define RTC_ALMLOW_ALMHR_Pos              (24UL)                    /*!< RTC ALMLOW: ALMHR (Bit 24)                            */
#define RTC_ALMLOW_ALMHR_Msk              (0x3f000000UL)            /*!< RTC ALMLOW: ALMHR (Bitfield-Mask: 0x3f)               */
#define RTC_ALMLOW_ALMMIN_Pos             (16UL)                    /*!< RTC ALMLOW: ALMMIN (Bit 16)                           */
#define RTC_ALMLOW_ALMMIN_Msk             (0x7f0000UL)              /*!< RTC ALMLOW: ALMMIN (Bitfield-Mask: 0x7f)              */
#define RTC_ALMLOW_ALMSEC_Pos             (8UL)                     /*!< RTC ALMLOW: ALMSEC (Bit 8)                            */
#define RTC_ALMLOW_ALMSEC_Msk             (0x7f00UL)                /*!< RTC ALMLOW: ALMSEC (Bitfield-Mask: 0x7f)              */
#define RTC_ALMLOW_ALM100_Pos             (0UL)                     /*!< RTC ALMLOW: ALM100 (Bit 0)                            */
#define RTC_ALMLOW_ALM100_Msk             (0xffUL)                  /*!< RTC ALMLOW: ALM100 (Bitfield-Mask: 0xff)              */
/* =========================================================  ALMUP  ========================================================= */
#define RTC_ALMUP_ALMWKDY_Pos             (16UL)                    /*!< RTC ALMUP: ALMWKDY (Bit 16)                           */
#define RTC_ALMUP_ALMWKDY_Msk             (0x70000UL)               /*!< RTC ALMUP: ALMWKDY (Bitfield-Mask: 0x07)              */
#define RTC_ALMUP_ALMMO_Pos               (8UL)                     /*!< RTC ALMUP: ALMMO (Bit 8)                              */
#define RTC_ALMUP_ALMMO_Msk               (0x1f00UL)                /*!< RTC ALMUP: ALMMO (Bitfield-Mask: 0x1f)                */
#define RTC_ALMUP_ALMDATE_Pos             (0UL)                     /*!< RTC ALMUP: ALMDATE (Bit 0)                            */
#define RTC_ALMUP_ALMDATE_Msk             (0x3fUL)                  /*!< RTC ALMUP: ALMDATE (Bitfield-Mask: 0x3f)              */
/* ========================================================  RTCCTL  ========================================================= */
#define RTC_RTCCTL_HR1224_Pos             (5UL)                     /*!< RTC RTCCTL: HR1224 (Bit 5)                            */
#define RTC_RTCCTL_HR1224_Msk             (0x20UL)                  /*!< RTC RTCCTL: HR1224 (Bitfield-Mask: 0x01)              */
#define RTC_RTCCTL_RSTOP_Pos              (4UL)                     /*!< RTC RTCCTL: RSTOP (Bit 4)                             */
#define RTC_RTCCTL_RSTOP_Msk              (0x10UL)                  /*!< RTC RTCCTL: RSTOP (Bitfield-Mask: 0x01)               */
#define RTC_RTCCTL_RPT_Pos                (1UL)                     /*!< RTC RTCCTL: RPT (Bit 1)                               */
#define RTC_RTCCTL_RPT_Msk                (0xeUL)                   /*!< RTC RTCCTL: RPT (Bitfield-Mask: 0x07)                 */
#define RTC_RTCCTL_WRTC_Pos               (0UL)                     /*!< RTC RTCCTL: WRTC (Bit 0)                              */
#define RTC_RTCCTL_WRTC_Msk               (0x1UL)                   /*!< RTC RTCCTL: WRTC (Bitfield-Mask: 0x01)                */
/* =========================================================  INTEN  ========================================================= */
#define RTC_INTEN_ALM_Pos                 (0UL)                     /*!< RTC INTEN: ALM (Bit 0)                                */
#define RTC_INTEN_ALM_Msk                 (0x1UL)                   /*!< RTC INTEN: ALM (Bitfield-Mask: 0x01)                  */
/* ========================================================  INTSTAT  ======================================================== */
#define RTC_INTSTAT_ALM_Pos               (0UL)                     /*!< RTC INTSTAT: ALM (Bit 0)                              */
#define RTC_INTSTAT_ALM_Msk               (0x1UL)                   /*!< RTC INTSTAT: ALM (Bitfield-Mask: 0x01)                */
/* ========================================================  INTCLR  ========================================================= */
#define RTC_INTCLR_ALM_Pos                (0UL)                     /*!< RTC INTCLR: ALM (Bit 0)                               */
#define RTC_INTCLR_ALM_Msk                (0x1UL)                   /*!< RTC INTCLR: ALM (Bitfield-Mask: 0x01)                 */
/* ========================================================  INTSET  ========================================================= */
#define RTC_INTSET_ALM_Pos                (0UL)                     /*!< RTC INTSET: ALM (Bit 0)                               */
#define RTC_INTSET_ALM_Msk                (0x1UL)                   /*!< RTC INTSET: ALM (Bitfield-Mask: 0x01)                 */


/* =========================================================================================================================== */
/* ================                                           SCARD                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  SR  =========================================================== */
#define SCARD_SR_FHF_Pos                  (6UL)                     /*!< SCARD SR: FHF (Bit 6)                                 */
#define SCARD_SR_FHF_Msk                  (0x40UL)                  /*!< SCARD SR: FHF (Bitfield-Mask: 0x01)                   */
#define SCARD_SR_FT2REND_Pos              (5UL)                     /*!< SCARD SR: FT2REND (Bit 5)                             */
#define SCARD_SR_FT2REND_Msk              (0x20UL)                  /*!< SCARD SR: FT2REND (Bitfield-Mask: 0x01)               */
#define SCARD_SR_PE_Pos                   (4UL)                     /*!< SCARD SR: PE (Bit 4)                                  */
#define SCARD_SR_PE_Msk                   (0x10UL)                  /*!< SCARD SR: PE (Bitfield-Mask: 0x01)                    */
#define SCARD_SR_OVR_Pos                  (3UL)                     /*!< SCARD SR: OVR (Bit 3)                                 */
#define SCARD_SR_OVR_Msk                  (0x8UL)                   /*!< SCARD SR: OVR (Bitfield-Mask: 0x01)                   */
#define SCARD_SR_FER_Pos                  (2UL)                     /*!< SCARD SR: FER (Bit 2)                                 */
#define SCARD_SR_FER_Msk                  (0x4UL)                   /*!< SCARD SR: FER (Bitfield-Mask: 0x01)                   */
#define SCARD_SR_TBERBF_Pos               (1UL)                     /*!< SCARD SR: TBERBF (Bit 1)                              */
#define SCARD_SR_TBERBF_Msk               (0x2UL)                   /*!< SCARD SR: TBERBF (Bitfield-Mask: 0x01)                */
#define SCARD_SR_FNE_Pos                  (0UL)                     /*!< SCARD SR: FNE (Bit 0)                                 */
#define SCARD_SR_FNE_Msk                  (0x1UL)                   /*!< SCARD SR: FNE (Bitfield-Mask: 0x01)                   */
/* ==========================================================  DR  =========================================================== */
#define SCARD_DR_DR_Pos                   (0UL)                     /*!< SCARD DR: DR (Bit 0)                                  */
#define SCARD_DR_DR_Msk                   (0xffUL)                  /*!< SCARD DR: DR (Bitfield-Mask: 0xff)                    */
/* ==========================================================  SR1  ========================================================== */
#define SCARD_SR1_IDLE_Pos                (3UL)                     /*!< SCARD SR1: IDLE (Bit 3)                               */
#define SCARD_SR1_IDLE_Msk                (0x8UL)                   /*!< SCARD SR1: IDLE (Bitfield-Mask: 0x01)                 */
#define SCARD_SR1_SYNCEND_Pos             (2UL)                     /*!< SCARD SR1: SYNCEND (Bit 2)                            */
#define SCARD_SR1_SYNCEND_Msk             (0x4UL)                   /*!< SCARD SR1: SYNCEND (Bitfield-Mask: 0x01)              */
#define SCARD_SR1_PRL_Pos                 (1UL)                     /*!< SCARD SR1: PRL (Bit 1)                                */
#define SCARD_SR1_PRL_Msk                 (0x2UL)                   /*!< SCARD SR1: PRL (Bitfield-Mask: 0x01)                  */
#define SCARD_SR1_ECNTOVER_Pos            (0UL)                     /*!< SCARD SR1: ECNTOVER (Bit 0)                           */
#define SCARD_SR1_ECNTOVER_Msk            (0x1UL)                   /*!< SCARD SR1: ECNTOVER (Bitfield-Mask: 0x01)             */
/* ======================================================  RETXCNTRMI  ======================================================= */
#define SCARD_RETXCNTRMI_RETXCNTRMI_Pos   (0UL)                     /*!< SCARD RETXCNTRMI: RETXCNTRMI (Bit 0)                  */
#define SCARD_RETXCNTRMI_RETXCNTRMI_Msk   (0xfUL)                   /*!< SCARD RETXCNTRMI: RETXCNTRMI (Bitfield-Mask: 0x0f)    */
/* ========================================================  CLKCTRL  ======================================================== */
#define SCARD_CLKCTRL_APBCLKEN_Pos        (1UL)                     /*!< SCARD CLKCTRL: APBCLKEN (Bit 1)                       */
#define SCARD_CLKCTRL_APBCLKEN_Msk        (0x2UL)                   /*!< SCARD CLKCTRL: APBCLKEN (Bitfield-Mask: 0x01)         */
#define SCARD_CLKCTRL_CLKEN_Pos           (0UL)                     /*!< SCARD CLKCTRL: CLKEN (Bit 0)                          */
#define SCARD_CLKCTRL_CLKEN_Msk           (0x1UL)                   /*!< SCARD CLKCTRL: CLKEN (Bitfield-Mask: 0x01)            */


/* =========================================================================================================================== */
/* ================                                         SECURITY                                          ================ */
/* =========================================================================================================================== */

