tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* =======================================================  DMATRIGEN  ======================================================= */
/* ======================================================  DMATRIGSTAT  ====================================================== */
/* ========================================================  DMACFG  ========================================================= */
/* ==============================================  BLEIF DMACFG DPWROFF [9..9]  ============================================== */
typedef enum {                                  /*!< BLEIF_DMACFG_DPWROFF                                                      */
  BLEIF_DMACFG_DPWROFF_DIS             = 0,     /*!< DIS : Power off disabled value.                                           */
  BLEIF_DMACFG_DPWROFF_EN              = 1,     /*!< EN : Power off enabled value.                                             */
} BLEIF_DMACFG_DPWROFF_Enum;

/* ==============================================  BLEIF DMACFG DMAPRI [8..8]  =============================================== */
typedef enum {                                  /*!< BLEIF_DMACFG_DMAPRI                                                       */
  BLEIF_DMACFG_DMAPRI_LOW              = 0,     /*!< LOW : Low Priority (service as best effort) value.                        */
  BLEIF_DMACFG_DMAPRI_HIGH             = 1,     /*!< HIGH : High Priority (service immediately) value.                         */
} BLEIF_DMACFG_DMAPRI_Enum;

/* ==============================================  BLEIF DMACFG DMADIR [1..1]  =============================================== */
typedef enum {                                  /*!< BLEIF_DMACFG_DMADIR                                                       */
  BLEIF_DMACFG_DMADIR_P2M              = 0,     /*!< P2M : Peripheral to Memory (SRAM) transaction. To be set when
                                                     doing IOM read operations, ie reading data from external
                                                     devices. value.                                                           */
  BLEIF_DMACFG_DMADIR_M2P              = 1,     /*!< M2P : Memory to Peripheral transaction. To be set when doing
                                                     IOM write operations, ie writing data to external devices.
                                                     value.                                                                    */
} BLEIF_DMACFG_DMADIR_Enum;

/* ===============================================  BLEIF DMACFG DMAEN [0..0]  =============================================== */
typedef enum {                                  /*!< BLEIF_DMACFG_DMAEN                                                        */
  BLEIF_DMACFG_DMAEN_DIS               = 0,     /*!< DIS : Disable DMA Function value.                                         */
  BLEIF_DMACFG_DMAEN_EN                = 1,     /*!< EN : Enable DMA Function value.                                           */
} BLEIF_DMACFG_DMAEN_Enum;

/* ======================================================  DMATOTCOUNT  ====================================================== */
/* ======================================================  DMATARGADDR  ====================================================== */
/* ========================================================  DMASTAT  ======================================================== */
/* =========================================================  CQCFG  ========================================================= */
/* ===============================================  BLEIF CQCFG CQPRI [1..1]  ================================================ */
typedef enum {                                  /*!< BLEIF_CQCFG_CQPRI                                                         */
  BLEIF_CQCFG_CQPRI_LOW                = 0,     /*!< LOW : Low Priority (service as best effort) value.                        */
  BLEIF_CQCFG_CQPRI_HIGH               = 1,     /*!< HIGH : High Priority (service immediately) value.                         */
} BLEIF_CQCFG_CQPRI_Enum;

/* ================================================  BLEIF CQCFG CQEN [0..0]  ================================================ */
typedef enum {                                  /*!< BLEIF_CQCFG_CQEN                                                          */
  BLEIF_CQCFG_CQEN_DIS                 = 0,     /*!< DIS : Disable CQ Function value.                                          */
  BLEIF_CQCFG_CQEN_EN                  = 1,     /*!< EN : Enable CQ Function value.                                            */
} BLEIF_CQCFG_CQEN_Enum;

/* ========================================================  CQADDR  ========================================================= */
/* ========================================================  CQSTAT  ========================================================= */
/* ========================================================  CQFLAGS  ======================================================== */
/* ======================================================  CQSETCLEAR  ======================================================= */
/* =======================================================  CQPAUSEEN  ======================================================= */
/* =============================================  BLEIF CQPAUSEEN CQPEN [0..15]  ============================================= */
typedef enum {                                  /*!< BLEIF_CQPAUSEEN_CQPEN                                                     */
  BLEIF_CQPAUSEEN_CQPEN_CNTEQ          = 32768, /*!< CNTEQ : Pauses command queue processing when HWCNT matches SWCNT
                                                     value.                                                                    */
  BLEIF_CQPAUSEEN_CQPEN_BLEXOREN       = 16384, /*!< BLEXOREN : Pause command queue when input BLE bit XORed with
                                                     SWFLAG4 is '1' value.                                                     */
  BLEIF_CQPAUSEEN_CQPEN_IOMXOREN       = 8192,  /*!< IOMXOREN : Pause command queue when input IOM bit XORed with
                                                     SWFLAG3 is '1' value.                                                     */
  BLEIF_CQPAUSEEN_CQPEN_GPIOXOREN      = 4096,  /*!< GPIOXOREN : Pause command queue when input GPIO irq_bit XORed
                                                     with SWFLAG2 is '1' value.                                                */
  BLEIF_CQPAUSEEN_CQPEN_MSPI1XNOREN    = 2048,  /*!< MSPI1XNOREN : Pause command queue when input MSPI1 bit XNORed
                                                     with SWFLAG1 is '1' value.                                                */
  BLEIF_CQPAUSEEN_CQPEN_MSPI0XNOREN    = 1024,  /*!< MSPI0XNOREN : Pause command queue when input MSPI0 bit XNORed
                                                     with SWFLAG0 is '1' value.                                                */
  BLEIF_CQPAUSEEN_CQPEN_MSPI1XOREN     = 512,   /*!< MSPI1XOREN : Pause command queue when input MSPI1 bit XORed
                                                     with SWFLAG1 is '1' value.                                                */
  BLEIF_CQPAUSEEN_CQPEN_MSPI0XOREN     = 256,   /*!< MSPI0XOREN : Pause command queue when input MSPI0 bit XORed
                                                     with SWFLAG0 is '1' value.                                                */
  BLEIF_CQPAUSEEN_CQPEN_SWFLAGEN7      = 128,   /*!< SWFLAGEN7 : Pause the command queue when software flag bit 7
                                                     is '1'. value.                                                            */
  BLEIF_CQPAUSEEN_CQPEN_SWFLAGEN6      = 64,    /*!< SWFLAGEN6 : Pause the command queue when software flag bit 7
                                                     is '1' value.                                                             */
  BLEIF_CQPAUSEEN_CQPEN_SWFLAGEN5      = 32,    /*!< SWFLAGEN5 : Pause the command queue when software flag bit 7
                                                     is '1' value.                                                             */
  BLEIF_CQPAUSEEN_CQPEN_SWFLAGEN4      = 16,    /*!< SWFLAGEN4 : Pause the command queue when software flag bit 7
                                                     is '1' value.                                                             */
  BLEIF_CQPAUSEEN_CQPEN_SWFLAGEN3      = 8,     /*!< SWFLAGEN3 : Pause the command queue when software flag bit 7
                                                     is '1' value.                                                             */
  BLEIF_CQPAUSEEN_CQPEN_SWFLAGEN2      = 4,     /*!< SWFLAGEN2 : Pause the command queue when software flag bit 7
                                                     is '1' value.                                                             */
  BLEIF_CQPAUSEEN_CQPEN_SWFLAGEN1      = 2,     /*!< SWFLAGEN1 : Pause the command queue when software flag bit 7
                                                     is '1' value.                                                             */
  BLEIF_CQPAUSEEN_CQPEN_SWFLGEN0       = 1,     /*!< SWFLGEN0 : Pause the command queue when software flag bit 7
                                                     is '1' value.                                                             */
} BLEIF_CQPAUSEEN_CQPEN_Enum;

