tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* =======================================================  CQCURIDX  ======================================================== */
/* =======================================================  CQENDIDX  ======================================================== */
/* ========================================================  STATUS  ========================================================= */
/* ==============================================  BLEIF STATUS IDLEST [2..2]  =============================================== */
typedef enum {                                  /*!< BLEIF_STATUS_IDLEST                                                       */
  BLEIF_STATUS_IDLEST_IDLE             = 1,     /*!< IDLE : The I/O state machine is in the idle state. value.                 */
} BLEIF_STATUS_IDLEST_Enum;

/* ==============================================  BLEIF STATUS CMDACT [1..1]  =============================================== */
typedef enum {                                  /*!< BLEIF_STATUS_CMDACT                                                       */
  BLEIF_STATUS_CMDACT_ACTIVE           = 1,     /*!< ACTIVE : An I/O command is active. Indicates the active module
                                                     has an active command and is processing this. De-asserted
                                                     when the command is completed. value.                                     */
} BLEIF_STATUS_CMDACT_Enum;

/* ================================================  BLEIF STATUS ERR [0..0]  ================================================ */
typedef enum {                                  /*!< BLEIF_STATUS_ERR                                                          */
  BLEIF_STATUS_ERR_ERROR               = 1,     /*!< ERROR : Bit has been deprecated and will always return 0. value.          */
} BLEIF_STATUS_ERR_Enum;

/* ========================================================  MSPICFG  ======================================================== */
/* =============================================  BLEIF MSPICFG SPILSB [23..23]  ============================================= */
typedef enum {                                  /*!< BLEIF_MSPICFG_SPILSB                                                      */
  BLEIF_MSPICFG_SPILSB_MSB             = 0,     /*!< MSB : Send and receive MSB bit first value.                               */
  BLEIF_MSPICFG_SPILSB_LSB             = 1,     /*!< LSB : Send and receive LSB bit first value.                               */
} BLEIF_MSPICFG_SPILSB_Enum;

/* ============================================  BLEIF MSPICFG RDFCPOL [22..22]  ============================================= */
typedef enum {                                  /*!< BLEIF_MSPICFG_RDFCPOL                                                     */
  BLEIF_MSPICFG_RDFCPOL_NORMAL         = 0,     /*!< NORMAL : SPI_STATUS signal from BLE Core high(1) creates flow
                                                     control and new read spi transactions will not be started
                                                     until the signal goes low.(default) value.                                */
  BLEIF_MSPICFG_RDFCPOL_INVERTED       = 1,     /*!< INVERTED : SPI_STATUS signal from BLE Core low(0) creates flow
                                                     control and new read spi transactions will not be started
                                                     until the signal goes high. value.                                        */
} BLEIF_MSPICFG_RDFCPOL_Enum;

/* ============================================  BLEIF MSPICFG WTFCPOL [21..21]  ============================================= */
typedef enum {                                  /*!< BLEIF_MSPICFG_WTFCPOL                                                     */
  BLEIF_MSPICFG_WTFCPOL_NORMAL         = 0,     /*!< NORMAL : SPI_STATUS signal from BLE Core high(1) creates flow
                                                     control and new write spi transactions will not be started
                                                     until the signal goes low.(default) value.                                */
  BLEIF_MSPICFG_WTFCPOL_INVERTED       = 1,     /*!< INVERTED : SPI_STATUS signal from BLE Core high(1) creates low(0)
                                                     control and new write spi transactions will not be started
                                                     until the signal goes high. value.                                        */
} BLEIF_MSPICFG_WTFCPOL_Enum;

/* ==============================================  BLEIF MSPICFG RDFC [17..17]  ============================================== */
typedef enum {                                  /*!< BLEIF_MSPICFG_RDFC                                                        */
  BLEIF_MSPICFG_RDFC_DIS               = 0,     /*!< DIS : Read mode flow control disabled. value.                             */
  BLEIF_MSPICFG_RDFC_EN                = 1,     /*!< EN : Read mode flow control enabled. value.                               */
} BLEIF_MSPICFG_RDFC_Enum;

/* ==============================================  BLEIF MSPICFG WTFC [16..16]  ============================================== */
typedef enum {                                  /*!< BLEIF_MSPICFG_WTFC                                                        */
  BLEIF_MSPICFG_WTFC_DIS               = 0,     /*!< DIS : Write mode flow control disabled. value.                            */
  BLEIF_MSPICFG_WTFC_EN                = 1,     /*!< EN : Write mode flow control enabled. value.                              */
} BLEIF_MSPICFG_WTFC_Enum;

/* ===============================================  BLEIF MSPICFG SPHA [1..1]  =============================================== */
typedef enum {                                  /*!< BLEIF_MSPICFG_SPHA                                                        */
  BLEIF_MSPICFG_SPHA_SAMPLE_LEADING_EDGE = 0,   /*!< SAMPLE_LEADING_EDGE : Sample on the leading (first) clock edge,
                                                     rising or falling dependant on the value of SPOL value.                   */
  BLEIF_MSPICFG_SPHA_SAMPLE_TRAILING_EDGE = 1,  /*!< SAMPLE_TRAILING_EDGE : Sample on the trailing (second) clock
                                                     edge, rising of falling dependant on the value of SPOL
                                                     value.                                                                    */
} BLEIF_MSPICFG_SPHA_Enum;

