tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ==============================================  CTIMER CTRL0 TMRA0EN [0..0]  ============================================== */
typedef enum {                                  /*!< CTIMER_CTRL0_TMRA0EN                                                      */
  CTIMER_CTRL0_TMRA0EN_DIS             = 0,     /*!< DIS : Counter/Timer A0 Disable. value.                                    */
  CTIMER_CTRL0_TMRA0EN_EN              = 1,     /*!< EN : Counter/Timer A0 Enable. value.                                      */
} CTIMER_CTRL0_TMRA0EN_Enum;

/* =======================================================  CMPRAUXA0  ======================================================= */
/* =======================================================  CMPRAUXB0  ======================================================= */
/* =========================================================  AUX0  ========================================================== */
/* ============================================  CTIMER AUX0 TMRB0EN23 [30..30]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX0_TMRB0EN23                                                     */
  CTIMER_AUX0_TMRB0EN23_DIS            = 1,     /*!< DIS : Disable enhanced functions. value.                                  */
  CTIMER_AUX0_TMRB0EN23_EN             = 0,     /*!< EN : Enable enhanced functions. value.                                    */
} CTIMER_AUX0_TMRB0EN23_Enum;

/* ============================================  CTIMER AUX0 TMRB0POL23 [29..29]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX0_TMRB0POL23                                                    */
  CTIMER_AUX0_TMRB0POL23_NORM          = 0,     /*!< NORM : Upper output normal polarity value.                                */
  CTIMER_AUX0_TMRB0POL23_INV           = 1,     /*!< INV : Upper output inverted polarity. value.                              */
} CTIMER_AUX0_TMRB0POL23_Enum;

/* ============================================  CTIMER AUX0 TMRB0TINV [28..28]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX0_TMRB0TINV                                                     */
  CTIMER_AUX0_TMRB0TINV_DIS            = 0,     /*!< DIS : Disable invert on trigger value.                                    */
  CTIMER_AUX0_TMRB0TINV_EN             = 1,     /*!< EN : Enable invert on trigger value.                                      */
} CTIMER_AUX0_TMRB0TINV_Enum;

/* ===========================================  CTIMER AUX0 TMRB0NOSYNC [27..27]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX0_TMRB0NOSYNC                                                   */
  CTIMER_AUX0_TMRB0NOSYNC_DIS          = 0,     /*!< DIS : Synchronization on source clock value.                              */
  CTIMER_AUX0_TMRB0NOSYNC_NOSYNC       = 1,     /*!< NOSYNC : No synchronization on source clock value.                        */
} CTIMER_AUX0_TMRB0NOSYNC_Enum;

/* ============================================  CTIMER AUX0 TMRB0TRIG [23..26]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX0_TMRB0TRIG                                                     */
  CTIMER_AUX0_TMRB0TRIG_DIS            = 0,     /*!< DIS : Trigger source is disabled. value.                                  */
  CTIMER_AUX0_TMRB0TRIG_A0OUT          = 1,     /*!< A0OUT : Trigger source is CTIMERA0 OUT. value.                            */
  CTIMER_AUX0_TMRB0TRIG_B3OUT          = 2,     /*!< B3OUT : Trigger source is CTIMERB3 OUT. value.                            */
  CTIMER_AUX0_TMRB0TRIG_A3OUT          = 3,     /*!< A3OUT : Trigger source is CTIMERA3 OUT. value.                            */
  CTIMER_AUX0_TMRB0TRIG_B2OUT          = 4,     /*!< B2OUT : Trigger source is CTIMERB2 OUT. value.                            */
  CTIMER_AUX0_TMRB0TRIG_B5OUT          = 5,     /*!< B5OUT : Trigger source is CTIMERB5 OUT. value.                            */
  CTIMER_AUX0_TMRB0TRIG_A4OUT          = 6,     /*!< A4OUT : Trigger source is CTIMERA4 OUT. value.                            */
  CTIMER_AUX0_TMRB0TRIG_B4OUT          = 7,     /*!< B4OUT : Trigger source is CTIMERB4 OUT. value.                            */
  CTIMER_AUX0_TMRB0TRIG_B3OUT2         = 8,     /*!< B3OUT2 : Trigger source is CTIMERB3 OUT2. value.                          */
  CTIMER_AUX0_TMRB0TRIG_A3OUT2         = 9,     /*!< A3OUT2 : Trigger source is CTIMERA3 OUT2. value.                          */
  CTIMER_AUX0_TMRB0TRIG_B7OUT2         = 10,    /*!< B7OUT2 : Trigger source is CTIMERB7 OUT2. value.                          */
  CTIMER_AUX0_TMRB0TRIG_A2OUT2         = 11,    /*!< A2OUT2 : Trigger source is CTIMERA2 OUT2. value.                          */
  CTIMER_AUX0_TMRB0TRIG_A6OUT2DUAL     = 12,    /*!< A6OUT2DUAL : Trigger source is CTIMERA6 OUT2, dual edge. value.           */
  CTIMER_AUX0_TMRB0TRIG_A7OUT2DUAL     = 13,    /*!< A7OUT2DUAL : Trigger source is CTIMERA7 OUT2, dual edge. value.           */
  CTIMER_AUX0_TMRB0TRIG_B5OUT2DUAL     = 14,    /*!< B5OUT2DUAL : Trigger source is CTIMERB5 OUT2, dual edge. value.           */
  CTIMER_AUX0_TMRB0TRIG_A5OUT2DUAL     = 15,    /*!< A5OUT2DUAL : Trigger source is CTIMERA5 OUT2, dual edge. value.           */
} CTIMER_AUX0_TMRB0TRIG_Enum;

/* ============================================  CTIMER AUX0 TMRA0EN23 [14..14]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX0_TMRA0EN23                                                     */
  CTIMER_AUX0_TMRA0EN23_DIS            = 1,     /*!< DIS : Disable enhanced functions. value.                                  */
  CTIMER_AUX0_TMRA0EN23_EN             = 0,     /*!< EN : Enable enhanced functions. value.                                    */
} CTIMER_AUX0_TMRA0EN23_Enum;

/* ============================================  CTIMER AUX0 TMRA0POL23 [13..13]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX0_TMRA0POL23                                                    */
  CTIMER_AUX0_TMRA0POL23_NORM          = 0,     /*!< NORM : Upper output normal polarity value.                                */
  CTIMER_AUX0_TMRA0POL23_INV           = 1,     /*!< INV : Upper output inverted polarity. value.                              */
} CTIMER_AUX0_TMRA0POL23_Enum;

