tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* =======================================================  CMPRAUXA2  ======================================================= */
/* =======================================================  CMPRAUXB2  ======================================================= */
/* =========================================================  AUX2  ========================================================== */
/* ============================================  CTIMER AUX2 TMRB2EN23 [30..30]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX2_TMRB2EN23                                                     */
  CTIMER_AUX2_TMRB2EN23_DIS            = 1,     /*!< DIS : Disable enhanced functions. value.                                  */
  CTIMER_AUX2_TMRB2EN23_EN             = 0,     /*!< EN : Enable enhanced functions. value.                                    */
} CTIMER_AUX2_TMRB2EN23_Enum;

/* ============================================  CTIMER AUX2 TMRB2POL23 [29..29]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX2_TMRB2POL23                                                    */
  CTIMER_AUX2_TMRB2POL23_NORM          = 0,     /*!< NORM : Upper output normal polarity value.                                */
  CTIMER_AUX2_TMRB2POL23_INV           = 1,     /*!< INV : Upper output inverted polarity. value.                              */
} CTIMER_AUX2_TMRB2POL23_Enum;

/* ============================================  CTIMER AUX2 TMRB2TINV [28..28]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX2_TMRB2TINV                                                     */
  CTIMER_AUX2_TMRB2TINV_DIS            = 0,     /*!< DIS : Disable invert on trigger value.                                    */
  CTIMER_AUX2_TMRB2TINV_EN             = 1,     /*!< EN : Enable invert on trigger value.                                      */
} CTIMER_AUX2_TMRB2TINV_Enum;

/* ===========================================  CTIMER AUX2 TMRB2NOSYNC [27..27]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX2_TMRB2NOSYNC                                                   */
  CTIMER_AUX2_TMRB2NOSYNC_DIS          = 0,     /*!< DIS : Synchronization on source clock value.                              */
  CTIMER_AUX2_TMRB2NOSYNC_NOSYNC       = 1,     /*!< NOSYNC : No synchronization on source clock value.                        */
} CTIMER_AUX2_TMRB2NOSYNC_Enum;

/* ============================================  CTIMER AUX2 TMRB2TRIG [23..26]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX2_TMRB2TRIG                                                     */
  CTIMER_AUX2_TMRB2TRIG_DIS            = 0,     /*!< DIS : Trigger source is disabled. value.                                  */
  CTIMER_AUX2_TMRB2TRIG_A2OUT          = 1,     /*!< A2OUT : Trigger source is CTIMERA2 OUT. value.                            */
  CTIMER_AUX2_TMRB2TRIG_B3OUT          = 2,     /*!< B3OUT : Trigger source is CTIMERB3 OUT. value.                            */
  CTIMER_AUX2_TMRB2TRIG_A3OUT          = 3,     /*!< A3OUT : Trigger source is CTIMERA3 OUT. value.                            */
  CTIMER_AUX2_TMRB2TRIG_A1OUT          = 4,     /*!< A1OUT : Trigger source is CTIMERA1 OUT. value.                            */
  CTIMER_AUX2_TMRB2TRIG_B1OUT          = 5,     /*!< B1OUT : Trigger source is CTIMERB1 OUT. value.                            */
  CTIMER_AUX2_TMRB2TRIG_A4OUT          = 6,     /*!< A4OUT : Trigger source is CTIMERA4 OUT. value.                            */
  CTIMER_AUX2_TMRB2TRIG_B4OUT          = 7,     /*!< B4OUT : Trigger source is CTIMERB4 OUT. value.                            */
  CTIMER_AUX2_TMRB2TRIG_B3OUT2         = 8,     /*!< B3OUT2 : Trigger source is CTIMERB3 OUT2. value.                          */
  CTIMER_AUX2_TMRB2TRIG_A3OUT2         = 9,     /*!< A3OUT2 : Trigger source is CTIMERA3 OUT2. value.                          */
  CTIMER_AUX2_TMRB2TRIG_A5OUT2         = 10,    /*!< A5OUT2 : Trigger source is CTIMERA5 OUT2. value.                          */
  CTIMER_AUX2_TMRB2TRIG_B5OUT2         = 11,    /*!< B5OUT2 : Trigger source is CTIMERB5 OUT2. value.                          */
  CTIMER_AUX2_TMRB2TRIG_A6OUT2DUAL     = 12,    /*!< A6OUT2DUAL : Trigger source is CTIMERA6 OUT2, dual edge. value.           */
  CTIMER_AUX2_TMRB2TRIG_A7OUT2DUAL     = 13,    /*!< A7OUT2DUAL : Trigger source is CTIMERA7 OUT2, dual edge. value.           */
  CTIMER_AUX2_TMRB2TRIG_B4OUT2DUAL     = 14,    /*!< B4OUT2DUAL : Trigger source is CTIMERB4 OUT2, dual edge. value.           */
  CTIMER_AUX2_TMRB2TRIG_A4OUT2DUAL     = 15,    /*!< A4OUT2DUAL : Trigger source is CTIMERA4 OUT2, dual edge. value.           */
} CTIMER_AUX2_TMRB2TRIG_Enum;

/* ============================================  CTIMER AUX2 TMRA2EN23 [14..14]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX2_TMRA2EN23                                                     */
  CTIMER_AUX2_TMRA2EN23_DIS            = 1,     /*!< DIS : Disable enhanced functions. value.                                  */
  CTIMER_AUX2_TMRA2EN23_EN             = 0,     /*!< EN : Enable enhanced functions. value.                                    */
} CTIMER_AUX2_TMRA2EN23_Enum;

/* ============================================  CTIMER AUX2 TMRA2POL23 [13..13]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX2_TMRA2POL23                                                    */
  CTIMER_AUX2_TMRA2POL23_NORM          = 0,     /*!< NORM : Upper output normal polarity value.                                */
  CTIMER_AUX2_TMRA2POL23_INV           = 1,     /*!< INV : Upper output inverted polarity. value.                              */
} CTIMER_AUX2_TMRA2POL23_Enum;

/* ============================================  CTIMER AUX2 TMRA2TINV [12..12]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX2_TMRA2TINV                                                     */
  CTIMER_AUX2_TMRA2TINV_DIS            = 0,     /*!< DIS : Disable invert on trigger value.                                    */
  CTIMER_AUX2_TMRA2TINV_EN             = 1,     /*!< EN : Enable invert on trigger value.                                      */
} CTIMER_AUX2_TMRA2TINV_Enum;

