tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ============================================  CTIMER AUX4 TMRB4TINV [28..28]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX4_TMRB4TINV                                                     */
  CTIMER_AUX4_TMRB4TINV_DIS            = 0,     /*!< DIS : Disable invert on trigger value.                                    */
  CTIMER_AUX4_TMRB4TINV_EN             = 1,     /*!< EN : Enable invert on trigger value.                                      */
} CTIMER_AUX4_TMRB4TINV_Enum;

/* ===========================================  CTIMER AUX4 TMRB4NOSYNC [27..27]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX4_TMRB4NOSYNC                                                   */
  CTIMER_AUX4_TMRB4NOSYNC_DIS          = 0,     /*!< DIS : Synchronization on source clock value.                              */
  CTIMER_AUX4_TMRB4NOSYNC_NOSYNC       = 1,     /*!< NOSYNC : No synchronization on source clock value.                        */
} CTIMER_AUX4_TMRB4NOSYNC_Enum;

/* ============================================  CTIMER AUX4 TMRB4TRIG [23..26]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX4_TMRB4TRIG                                                     */
  CTIMER_AUX4_TMRB4TRIG_DIS            = 0,     /*!< DIS : Trigger source is disabled. value.                                  */
  CTIMER_AUX4_TMRB4TRIG_A4OUT          = 1,     /*!< A4OUT : Trigger source is CTIMERA4 OUT. value.                            */
  CTIMER_AUX4_TMRB4TRIG_B3OUT          = 2,     /*!< B3OUT : Trigger source is CTIMERB3 OUT. value.                            */
  CTIMER_AUX4_TMRB4TRIG_A3OUT          = 3,     /*!< A3OUT : Trigger source is CTIMERA3 OUT. value.                            */
  CTIMER_AUX4_TMRB4TRIG_A7OUT          = 4,     /*!< A7OUT : Trigger source is CTIMERA7 OUT. value.                            */
  CTIMER_AUX4_TMRB4TRIG_B7OUT          = 5,     /*!< B7OUT : Trigger source is CTIMERB7 OUT. value.                            */
  CTIMER_AUX4_TMRB4TRIG_A1OUT          = 6,     /*!< A1OUT : Trigger source is CTIMERA1 OUT. value.                            */
  CTIMER_AUX4_TMRB4TRIG_B1OUT          = 7,     /*!< B1OUT : Trigger source is CTIMERB1 OUT. value.                            */
  CTIMER_AUX4_TMRB4TRIG_B3OUT2         = 8,     /*!< B3OUT2 : Trigger source is CTIMERB3 OUT2. value.                          */
  CTIMER_AUX4_TMRB4TRIG_A3OUT2         = 9,     /*!< A3OUT2 : Trigger source is CTIMERA3 OUT2. value.                          */
  CTIMER_AUX4_TMRB4TRIG_A1OUT2         = 10,    /*!< A1OUT2 : Trigger source is CTIMERA1 OUT2. value.                          */
  CTIMER_AUX4_TMRB4TRIG_B1OUT2         = 11,    /*!< B1OUT2 : Trigger source is CTIMERB1 OUT2. value.                          */
  CTIMER_AUX4_TMRB4TRIG_A6OUT2DUAL     = 12,    /*!< A6OUT2DUAL : Trigger source is CTIMERA6 OUT2, dual edge. value.           */
  CTIMER_AUX4_TMRB4TRIG_A7OUT2DUAL     = 13,    /*!< A7OUT2DUAL : Trigger source is CTIMERA7 OUT2, dual edge. value.           */
  CTIMER_AUX4_TMRB4TRIG_B5OUT2DUAL     = 14,    /*!< B5OUT2DUAL : Trigger source is CTIMERB5 OUT2, dual edge. value.           */
  CTIMER_AUX4_TMRB4TRIG_A5OUT2DUAL     = 15,    /*!< A5OUT2DUAL : Trigger source is CTIMERA5 OUT2, dual edge. value.           */
} CTIMER_AUX4_TMRB4TRIG_Enum;

/* ============================================  CTIMER AUX4 TMRA4EN23 [14..14]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX4_TMRA4EN23                                                     */
  CTIMER_AUX4_TMRA4EN23_DIS            = 1,     /*!< DIS : Disable enhanced functions. value.                                  */
  CTIMER_AUX4_TMRA4EN23_EN             = 0,     /*!< EN : Enable enhanced functions. value.                                    */
} CTIMER_AUX4_TMRA4EN23_Enum;

/* ============================================  CTIMER AUX4 TMRA4POL23 [13..13]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX4_TMRA4POL23                                                    */
  CTIMER_AUX4_TMRA4POL23_NORM          = 0,     /*!< NORM : Upper output normal polarity value.                                */
  CTIMER_AUX4_TMRA4POL23_INV           = 1,     /*!< INV : Upper output inverted polarity. value.                              */
} CTIMER_AUX4_TMRA4POL23_Enum;

/* ============================================  CTIMER AUX4 TMRA4TINV [12..12]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX4_TMRA4TINV                                                     */
  CTIMER_AUX4_TMRA4TINV_DIS            = 0,     /*!< DIS : Disable invert on trigger value.                                    */
  CTIMER_AUX4_TMRA4TINV_EN             = 1,     /*!< EN : Enable invert on trigger value.                                      */
} CTIMER_AUX4_TMRA4TINV_Enum;

/* ===========================================  CTIMER AUX4 TMRA4NOSYNC [11..11]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX4_TMRA4NOSYNC                                                   */
  CTIMER_AUX4_TMRA4NOSYNC_DIS          = 0,     /*!< DIS : Synchronization on source clock value.                              */
  CTIMER_AUX4_TMRA4NOSYNC_NOSYNC       = 1,     /*!< NOSYNC : No synchronization on source clock value.                        */
} CTIMER_AUX4_TMRA4NOSYNC_Enum;

/* =============================================  CTIMER AUX4 TMRA4TRIG [7..10]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX4_TMRA4TRIG                                                     */
  CTIMER_AUX4_TMRA4TRIG_DIS            = 0,     /*!< DIS : Trigger source is disabled. value.                                  */
  CTIMER_AUX4_TMRA4TRIG_B4OUT          = 1,     /*!< B4OUT : Trigger source is CTIMERB4 OUT. value.                            */
  CTIMER_AUX4_TMRA4TRIG_B3OUT          = 2,     /*!< B3OUT : Trigger source is CTIMERB3 OUT. value.                            */
  CTIMER_AUX4_TMRA4TRIG_A3OUT          = 3,     /*!< A3OUT : Trigger source is CTIMERA3 OUT. value.                            */
  CTIMER_AUX4_TMRA4TRIG_A6OUT          = 4,     /*!< A6OUT : Trigger source is CTIMERA6 OUT. value.                            */
  CTIMER_AUX4_TMRA4TRIG_B6OUT          = 5,     /*!< B6OUT : Trigger source is CTIMERB6 OUT. value.                            */
  CTIMER_AUX4_TMRA4TRIG_A2OUT          = 6,     /*!< A2OUT : Trigger source is CTIMERA2 OUT. value.                            */
  CTIMER_AUX4_TMRA4TRIG_B2OUT          = 7,     /*!< B2OUT : Trigger source is CTIMERB2 OUT. value.                            */
  CTIMER_AUX4_TMRA4TRIG_B3OUT2         = 8,     /*!< B3OUT2 : Trigger source is CTIMERB3 OUT2. value.                          */
  CTIMER_AUX4_TMRA4TRIG_A3OUT2         = 9,     /*!< A3OUT2 : Trigger source is CTIMERA3 OUT2. value.                          */
  CTIMER_AUX4_TMRA4TRIG_A1OUT2         = 10,    /*!< A1OUT2 : Trigger source is CTIMERA1 OUT2. value.                          */
  CTIMER_AUX4_TMRA4TRIG_B1OUT2         = 11,    /*!< B1OUT2 : Trigger source is CTIMERB1 OUT2. value.                          */
  CTIMER_AUX4_TMRA4TRIG_A6OUT2DUAL     = 12,    /*!< A6OUT2DUAL : Trigger source is CTIMERA6 OUT2, dual edge. value.           */
  CTIMER_AUX4_TMRA4TRIG_A7OUT2DUAL     = 13,    /*!< A7OUT2DUAL : Trigger source is CTIMERA7 OUT2, dual edge. value.           */
  CTIMER_AUX4_TMRA4TRIG_B5OUT2DUAL     = 14,    /*!< B5OUT2DUAL : Trigger source is CTIMERB5 OUT2, dual edge. value.           */
  CTIMER_AUX4_TMRA4TRIG_A5OUT2DUAL     = 15,    /*!< A5OUT2DUAL : Trigger source is CTIMERA5 OUT2, dual edge. value.           */
} CTIMER_AUX4_TMRA4TRIG_Enum;

/* =========================================================  TMR5  ========================================================== */
/* ========================================================  CMPRA5  ========================================================= */
/* ========================================================  CMPRB5  ========================================================= */
/* =========================================================  CTRL5  ========================================================= */
/* =============================================  CTIMER CTRL5 CTLINK5 [31..31]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL5_CTLINK5                                                      */
  CTIMER_CTRL5_CTLINK5_TWO_16BIT_TIMERS = 0,    /*!< TWO_16BIT_TIMERS : Use A5/B5 timers as two independent 16-bit
                                                     timers (default). value.                                                  */
  CTIMER_CTRL5_CTLINK5_32BIT_TIMER     = 1,     /*!< 32BIT_TIMER : Link A5/B5 timers into a single 32-bit timer.
                                                     value.                                                                    */
} CTIMER_CTRL5_CTLINK5_Enum;

/* ============================================  CTIMER CTRL5 TMRB5POL [28..28]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL5_TMRB5POL                                                     */
  CTIMER_CTRL5_TMRB5POL_NORMAL         = 0,     /*!< NORMAL : The polarity of the TMRPINB5 pin is the same as the
                                                     timer output. value.                                                      */
  CTIMER_CTRL5_TMRB5POL_INVERTED       = 1,     /*!< INVERTED : The polarity of the TMRPINB5 pin is the inverse of
                                                     the timer output. value.                                                  */
} CTIMER_CTRL5_TMRB5POL_Enum;

/* ============================================  CTIMER CTRL5 TMRB5CLR [27..27]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL5_TMRB5CLR                                                     */
  CTIMER_CTRL5_TMRB5CLR_RUN            = 0,     /*!< RUN : Allow counter/timer B5 to run value.                                */
  CTIMER_CTRL5_TMRB5CLR_CLEAR          = 1,     /*!< CLEAR : Holds counter/timer B5 at 0x0000. value.                          */
} CTIMER_CTRL5_TMRB5CLR_Enum;

