tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ============================================  CTIMER AUX5 TMRA5TINV [12..12]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX5_TMRA5TINV                                                     */
  CTIMER_AUX5_TMRA5TINV_DIS            = 0,     /*!< DIS : Disable invert on trigger value.                                    */
  CTIMER_AUX5_TMRA5TINV_EN             = 1,     /*!< EN : Enable invert on trigger value.                                      */
} CTIMER_AUX5_TMRA5TINV_Enum;

/* ===========================================  CTIMER AUX5 TMRA5NOSYNC [11..11]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX5_TMRA5NOSYNC                                                   */
  CTIMER_AUX5_TMRA5NOSYNC_DIS          = 0,     /*!< DIS : Synchronization on source clock value.                              */
  CTIMER_AUX5_TMRA5NOSYNC_NOSYNC       = 1,     /*!< NOSYNC : No synchronization on source clock value.                        */
} CTIMER_AUX5_TMRA5NOSYNC_Enum;

/* =============================================  CTIMER AUX5 TMRA5TRIG [7..10]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX5_TMRA5TRIG                                                     */
  CTIMER_AUX5_TMRA5TRIG_DIS            = 0,     /*!< DIS : Trigger source is disabled. value.                                  */
  CTIMER_AUX5_TMRA5TRIG_B5OUT          = 1,     /*!< B5OUT : Trigger source is CTIMERB5 OUT. value.                            */
  CTIMER_AUX5_TMRA5TRIG_B3OUT          = 2,     /*!< B3OUT : Trigger source is CTIMERB3 OUT. value.                            */
  CTIMER_AUX5_TMRA5TRIG_A3OUT          = 3,     /*!< A3OUT : Trigger source is CTIMERA3 OUT. value.                            */
  CTIMER_AUX5_TMRA5TRIG_A4OUT          = 4,     /*!< A4OUT : Trigger source is CTIMERA4 OUT. value.                            */
  CTIMER_AUX5_TMRA5TRIG_B4OUT          = 5,     /*!< B4OUT : Trigger source is CTIMERB4 OUT. value.                            */
  CTIMER_AUX5_TMRA5TRIG_A2OUT          = 6,     /*!< A2OUT : Trigger source is CTIMERA2 OUT. value.                            */
  CTIMER_AUX5_TMRA5TRIG_B2OUT          = 7,     /*!< B2OUT : Trigger source is CTIMERB2 OUT. value.                            */
  CTIMER_AUX5_TMRA5TRIG_B3OUT2         = 8,     /*!< B3OUT2 : Trigger source is CTIMERB3 OUT2. value.                          */
  CTIMER_AUX5_TMRA5TRIG_A3OUT2         = 9,     /*!< A3OUT2 : Trigger source is CTIMERA3 OUT2. value.                          */
  CTIMER_AUX5_TMRA5TRIG_A0OUT2         = 10,    /*!< A0OUT2 : Trigger source is CTIMERA0 OUT2. value.                          */
  CTIMER_AUX5_TMRA5TRIG_B0OUT2         = 11,    /*!< B0OUT2 : Trigger source is CTIMERB0 OUT2. value.                          */
  CTIMER_AUX5_TMRA5TRIG_A6OUT2DUAL     = 12,    /*!< A6OUT2DUAL : Trigger source is CTIMERA6 OUT2, dual edge. value.           */
  CTIMER_AUX5_TMRA5TRIG_A7OUT2DUAL     = 13,    /*!< A7OUT2DUAL : Trigger source is CTIMERA7 OUT2, dual edge. value.           */
  CTIMER_AUX5_TMRA5TRIG_B4OUT2DUAL     = 14,    /*!< B4OUT2DUAL : Trigger source is CTIMERB4 OUT2, dual edge. value.           */
  CTIMER_AUX5_TMRA5TRIG_A4OUT2DUAL     = 15,    /*!< A4OUT2DUAL : Trigger source is CTIMERA4 OUT2, dual edge. value.           */
} CTIMER_AUX5_TMRA5TRIG_Enum;

/* =========================================================  TMR6  ========================================================== */
/* ========================================================  CMPRA6  ========================================================= */
/* ========================================================  CMPRB6  ========================================================= */
/* =========================================================  CTRL6  ========================================================= */
/* =============================================  CTIMER CTRL6 CTLINK6 [31..31]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL6_CTLINK6                                                      */
  CTIMER_CTRL6_CTLINK6_TWO_16BIT_TIMERS = 0,    /*!< TWO_16BIT_TIMERS : Use A6/B6 timers as two independent 16-bit
                                                     timers (default). value.                                                  */
  CTIMER_CTRL6_CTLINK6_32BIT_TIMER     = 1,     /*!< 32BIT_TIMER : Link A6/B6 timers into a single 32-bit timer.
                                                     value.                                                                    */
} CTIMER_CTRL6_CTLINK6_Enum;

/* ============================================  CTIMER CTRL6 TMRB6POL [28..28]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL6_TMRB6POL                                                     */
  CTIMER_CTRL6_TMRB6POL_NORMAL         = 0,     /*!< NORMAL : The polarity of the TMRPINB6 pin is the same as the
                                                     timer output. value.                                                      */
  CTIMER_CTRL6_TMRB6POL_INVERTED       = 1,     /*!< INVERTED : The polarity of the TMRPINB6 pin is the inverse of
                                                     the timer output. value.                                                  */
} CTIMER_CTRL6_TMRB6POL_Enum;

/* ============================================  CTIMER CTRL6 TMRB6CLR [27..27]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL6_TMRB6CLR                                                     */
  CTIMER_CTRL6_TMRB6CLR_RUN            = 0,     /*!< RUN : Allow counter/timer B6 to run value.                                */
  CTIMER_CTRL6_TMRB6CLR_CLEAR          = 1,     /*!< CLEAR : Holds counter/timer B6 at 0x0000. value.                          */
} CTIMER_CTRL6_TMRB6CLR_Enum;

/* ============================================  CTIMER CTRL6 TMRB6IE1 [26..26]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL6_TMRB6IE1                                                     */
  CTIMER_CTRL6_TMRB6IE1_DIS            = 0,     /*!< DIS : Disable counter/timer B6 from generating an interrupt
                                                     based on COMPR1. value.                                                   */
  CTIMER_CTRL6_TMRB6IE1_EN             = 1,     /*!< EN : Enable counter/timer B6 to generate an interrupt based
                                                     on COMPR1. value.                                                         */
} CTIMER_CTRL6_TMRB6IE1_Enum;

