tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ============================================  CTIMER AUX6 TMRB6TRIG [23..26]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX6_TMRB6TRIG                                                     */
  CTIMER_AUX6_TMRB6TRIG_DIS            = 0,     /*!< DIS : Trigger source is disabled. value.                                  */
  CTIMER_AUX6_TMRB6TRIG_A6OUT          = 1,     /*!< A6OUT : Trigger source is CTIMERA6 OUT. value.                            */
  CTIMER_AUX6_TMRB6TRIG_B3OUT          = 2,     /*!< B3OUT : Trigger source is CTIMERB3 OUT. value.                            */
  CTIMER_AUX6_TMRB6TRIG_A3OUT          = 3,     /*!< A3OUT : Trigger source is CTIMERA3 OUT. value.                            */
  CTIMER_AUX6_TMRB6TRIG_A4OUT          = 4,     /*!< A4OUT : Trigger source is CTIMERA4 OUT. value.                            */
  CTIMER_AUX6_TMRB6TRIG_B4OUT          = 5,     /*!< B4OUT : Trigger source is CTIMERB4 OUT. value.                            */
  CTIMER_AUX6_TMRB6TRIG_A1OUT          = 6,     /*!< A1OUT : Trigger source is CTIMERA1 OUT. value.                            */
  CTIMER_AUX6_TMRB6TRIG_B1OUT          = 7,     /*!< B1OUT : Trigger source is CTIMERB1 OUT. value.                            */
  CTIMER_AUX6_TMRB6TRIG_B3OUT2         = 8,     /*!< B3OUT2 : Trigger source is CTIMERB3 OUT2. value.                          */
  CTIMER_AUX6_TMRB6TRIG_A3OUT2         = 9,     /*!< A3OUT2 : Trigger source is CTIMERA3 OUT2. value.                          */
  CTIMER_AUX6_TMRB6TRIG_A2OUT2         = 10,    /*!< A2OUT2 : Trigger source is CTIMERA2 OUT2. value.                          */
  CTIMER_AUX6_TMRB6TRIG_B2OUT2         = 11,    /*!< B2OUT2 : Trigger source is CTIMERB2 OUT2. value.                          */
  CTIMER_AUX6_TMRB6TRIG_A6OUT2DUAL     = 12,    /*!< A6OUT2DUAL : Trigger source is CTIMERA6 OUT2, dual edge. value.           */
  CTIMER_AUX6_TMRB6TRIG_A7OUT2DUAL     = 13,    /*!< A7OUT2DUAL : Trigger source is CTIMERA7 OUT2, dual edge. value.           */
  CTIMER_AUX6_TMRB6TRIG_B0OUT2DUAL     = 14,    /*!< B0OUT2DUAL : Trigger source is CTIMERB0 OUT2, dual edge. value.           */
  CTIMER_AUX6_TMRB6TRIG_A0OUT2DUAL     = 15,    /*!< A0OUT2DUAL : Trigger source is CTIMERA0 OUT2, dual edge. value.           */
} CTIMER_AUX6_TMRB6TRIG_Enum;

/* ============================================  CTIMER AUX6 TMRA6EN23 [14..14]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX6_TMRA6EN23                                                     */
  CTIMER_AUX6_TMRA6EN23_DIS            = 1,     /*!< DIS : Disable enhanced functions. value.                                  */
  CTIMER_AUX6_TMRA6EN23_EN             = 0,     /*!< EN : Enable enhanced functions. value.                                    */
} CTIMER_AUX6_TMRA6EN23_Enum;

/* ============================================  CTIMER AUX6 TMRA6POL23 [13..13]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX6_TMRA6POL23                                                    */
  CTIMER_AUX6_TMRA6POL23_NORM          = 0,     /*!< NORM : Upper output normal polarity value.                                */
  CTIMER_AUX6_TMRA6POL23_INV           = 1,     /*!< INV : Upper output inverted polarity. value.                              */
} CTIMER_AUX6_TMRA6POL23_Enum;

/* ============================================  CTIMER AUX6 TMRA6TINV [12..12]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX6_TMRA6TINV                                                     */
  CTIMER_AUX6_TMRA6TINV_DIS            = 0,     /*!< DIS : Disable invert on trigger value.                                    */
  CTIMER_AUX6_TMRA6TINV_EN             = 1,     /*!< EN : Enable invert on trigger value.                                      */
} CTIMER_AUX6_TMRA6TINV_Enum;

/* ===========================================  CTIMER AUX6 TMRA6NOSYNC [11..11]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX6_TMRA6NOSYNC                                                   */
  CTIMER_AUX6_TMRA6NOSYNC_DIS          = 0,     /*!< DIS : Synchronization on source clock value.                              */
  CTIMER_AUX6_TMRA6NOSYNC_NOSYNC       = 1,     /*!< NOSYNC : No synchronization on source clock value.                        */
} CTIMER_AUX6_TMRA6NOSYNC_Enum;

/* =============================================  CTIMER AUX6 TMRA6TRIG [7..10]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX6_TMRA6TRIG                                                     */
  CTIMER_AUX6_TMRA6TRIG_DIS            = 0,     /*!< DIS : Trigger source is disabled. value.                                  */
  CTIMER_AUX6_TMRA6TRIG_B6OUT          = 1,     /*!< B6OUT : Trigger source is CTIMERB6 OUT. value.                            */
  CTIMER_AUX6_TMRA6TRIG_B3OUT          = 2,     /*!< B3OUT : Trigger source is CTIMERB3 OUT. value.                            */
  CTIMER_AUX6_TMRA6TRIG_A3OUT          = 3,     /*!< A3OUT : Trigger source is CTIMERA3 OUT. value.                            */
  CTIMER_AUX6_TMRA6TRIG_A5OUT          = 4,     /*!< A5OUT : Trigger source is CTIMERA5 OUT. value.                            */
  CTIMER_AUX6_TMRA6TRIG_B5OUT          = 5,     /*!< B5OUT : Trigger source is CTIMERB5 OUT. value.                            */
  CTIMER_AUX6_TMRA6TRIG_A1OUT          = 6,     /*!< A1OUT : Trigger source is CTIMERA1 OUT. value.                            */
  CTIMER_AUX6_TMRA6TRIG_B1OUT          = 7,     /*!< B1OUT : Trigger source is CTIMERB1 OUT. value.                            */
  CTIMER_AUX6_TMRA6TRIG_B3OUT2         = 8,     /*!< B3OUT2 : Trigger source is CTIMERB3 OUT2. value.                          */
  CTIMER_AUX6_TMRA6TRIG_A3OUT2         = 9,     /*!< A3OUT2 : Trigger source is CTIMERA3 OUT2. value.                          */
  CTIMER_AUX6_TMRA6TRIG_A2OUT2         = 10,    /*!< A2OUT2 : Trigger source is CTIMERA2 OUT2. value.                          */
  CTIMER_AUX6_TMRA6TRIG_B2OUT2         = 11,    /*!< B2OUT2 : Trigger source is CTIMERBb OUT2. value.                          */
  CTIMER_AUX6_TMRA6TRIG_A5OUT2DUAL     = 12,    /*!< A5OUT2DUAL : Trigger source is CTIMERA5 OUT2, dual edge. value.           */
  CTIMER_AUX6_TMRA6TRIG_A7OUT2DUAL     = 13,    /*!< A7OUT2DUAL : Trigger source is CTIMERA7 OUT2, dual edge. value.           */
  CTIMER_AUX6_TMRA6TRIG_B0OUT2DUAL     = 14,    /*!< B0OUT2DUAL : Trigger source is CTIMERB0 OUT2, dual edge. value.           */
  CTIMER_AUX6_TMRA6TRIG_A0OUT2DUAL     = 15,    /*!< A0OUT2DUAL : Trigger source is CTIMERA0 OUT2, dual edge. value.           */
} CTIMER_AUX6_TMRA6TRIG_Enum;

/* =========================================================  TMR7  ========================================================== */
/* ========================================================  CMPRA7  ========================================================= */
/* ========================================================  CMPRB7  ========================================================= */
/* =========================================================  CTRL7  ========================================================= */
/* =============================================  CTIMER CTRL7 CTLINK7 [31..31]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL7_CTLINK7                                                      */
  CTIMER_CTRL7_CTLINK7_TWO_16BIT_TIMERS = 0,    /*!< TWO_16BIT_TIMERS : Use A7/B7 timers as two independent 16-bit
                                                     timers (default). value.                                                  */
  CTIMER_CTRL7_CTLINK7_32BIT_TIMER     = 1,     /*!< 32BIT_TIMER : Link A7/B7 timers into a single 32-bit timer.
                                                     value.                                                                    */
} CTIMER_CTRL7_CTLINK7_Enum;

/* ============================================  CTIMER CTRL7 TMRB7POL [28..28]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL7_TMRB7POL                                                     */
  CTIMER_CTRL7_TMRB7POL_NORMAL         = 0,     /*!< NORMAL : The polarity of the TMRPINB7 pin is the same as the
                                                     timer output. value.                                                      */
  CTIMER_CTRL7_TMRB7POL_INVERTED       = 1,     /*!< INVERTED : The polarity of the TMRPINB7 pin is the inverse of
                                                     the timer output. value.                                                  */
} CTIMER_CTRL7_TMRB7POL_Enum;

/* ============================================  CTIMER CTRL7 TMRB7CLR [27..27]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL7_TMRB7CLR                                                     */
  CTIMER_CTRL7_TMRB7CLR_RUN            = 0,     /*!< RUN : Allow counter/timer B7 to run value.                                */
  CTIMER_CTRL7_TMRB7CLR_CLEAR          = 1,     /*!< CLEAR : Holds counter/timer B7 at 0x0000. value.                          */
} CTIMER_CTRL7_TMRB7CLR_Enum;

/* ============================================  CTIMER CTRL7 TMRB7IE1 [26..26]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL7_TMRB7IE1                                                     */
  CTIMER_CTRL7_TMRB7IE1_DIS            = 0,     /*!< DIS : Disable counter/timer B7 from generating an interrupt
                                                     based on COMPR1. value.                                                   */
  CTIMER_CTRL7_TMRB7IE1_EN             = 1,     /*!< EN : Enable counter/timer B7 to generate an interrupt based
                                                     on COMPR1. value.                                                         */
} CTIMER_CTRL7_TMRB7IE1_Enum;

