tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ============================================  CTIMER AUX7 TMRB7POL23 [29..29]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX7_TMRB7POL23                                                    */
  CTIMER_AUX7_TMRB7POL23_NORM          = 0,     /*!< NORM : Upper output normal polarity value.                                */
  CTIMER_AUX7_TMRB7POL23_INV           = 1,     /*!< INV : Upper output inverted polarity. value.                              */
} CTIMER_AUX7_TMRB7POL23_Enum;

/* ============================================  CTIMER AUX7 TMRB7TINV [28..28]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX7_TMRB7TINV                                                     */
  CTIMER_AUX7_TMRB7TINV_DIS            = 0,     /*!< DIS : Disable invert on trigger value.                                    */
  CTIMER_AUX7_TMRB7TINV_EN             = 1,     /*!< EN : Enable invert on trigger value.                                      */
} CTIMER_AUX7_TMRB7TINV_Enum;

/* ===========================================  CTIMER AUX7 TMRB7NOSYNC [27..27]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX7_TMRB7NOSYNC                                                   */
  CTIMER_AUX7_TMRB7NOSYNC_DIS          = 0,     /*!< DIS : Synchronization on source clock value.                              */
  CTIMER_AUX7_TMRB7NOSYNC_NOSYNC       = 1,     /*!< NOSYNC : No synchronization on source clock value.                        */
} CTIMER_AUX7_TMRB7NOSYNC_Enum;

/* ============================================  CTIMER AUX7 TMRB7TRIG [23..26]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX7_TMRB7TRIG                                                     */
  CTIMER_AUX7_TMRB7TRIG_DIS            = 0,     /*!< DIS : Trigger source is disabled. value.                                  */
  CTIMER_AUX7_TMRB7TRIG_A7OUT          = 1,     /*!< A7OUT : Trigger source is CTIMERA7 OUT. value.                            */
  CTIMER_AUX7_TMRB7TRIG_B3OUT          = 2,     /*!< B3OUT : Trigger source is CTIMERB3 OUT. value.                            */
  CTIMER_AUX7_TMRB7TRIG_A3OUT          = 3,     /*!< A3OUT : Trigger source is CTIMERA3 OUT. value.                            */
  CTIMER_AUX7_TMRB7TRIG_A5OUT          = 4,     /*!< A5OUT : Trigger source is CTIMERA5 OUT. value.                            */
  CTIMER_AUX7_TMRB7TRIG_B5OUT          = 5,     /*!< B5OUT : Trigger source is CTIMERB5 OUT. value.                            */
  CTIMER_AUX7_TMRB7TRIG_A2OUT          = 6,     /*!< A2OUT : Trigger source is CTIMERA2 OUT. value.                            */
  CTIMER_AUX7_TMRB7TRIG_B2OUT          = 7,     /*!< B2OUT : Trigger source is CTIMERB2 OUT. value.                            */
  CTIMER_AUX7_TMRB7TRIG_B3OUT2         = 8,     /*!< B3OUT2 : Trigger source is CTIMERB3 OUT2. value.                          */
  CTIMER_AUX7_TMRB7TRIG_A3OUT2         = 9,     /*!< A3OUT2 : Trigger source is CTIMERA3 OUT2. value.                          */
  CTIMER_AUX7_TMRB7TRIG_A2OUT2         = 10,    /*!< A2OUT2 : Trigger source is CTIMERA2 OUT2. value.                          */
  CTIMER_AUX7_TMRB7TRIG_B2OUT2         = 11,    /*!< B2OUT2 : Trigger source is CTIMERB2 OUT2. value.                          */
  CTIMER_AUX7_TMRB7TRIG_A6OUT2DUAL     = 12,    /*!< A6OUT2DUAL : Trigger source is CTIMERA6 OUT2, dual edge. value.           */
  CTIMER_AUX7_TMRB7TRIG_A7OUT2DUAL     = 13,    /*!< A7OUT2DUAL : Trigger source is CTIMERA7 OUT2, dual edge. value.           */
  CTIMER_AUX7_TMRB7TRIG_B1OUT2DUAL     = 14,    /*!< B1OUT2DUAL : Trigger source is CTIMERB1 OUT2, dual edge. value.           */
  CTIMER_AUX7_TMRB7TRIG_A1OUT2DUAL     = 15,    /*!< A1OUT2DUAL : Trigger source is CTIMERA1 OUT2, dual edge. value.           */
} CTIMER_AUX7_TMRB7TRIG_Enum;

/* ============================================  CTIMER AUX7 TMRA7EN23 [14..14]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX7_TMRA7EN23                                                     */
  CTIMER_AUX7_TMRA7EN23_DIS            = 1,     /*!< DIS : Disable enhanced functions. value.                                  */
  CTIMER_AUX7_TMRA7EN23_EN             = 0,     /*!< EN : Enable enhanced functions. value.                                    */
} CTIMER_AUX7_TMRA7EN23_Enum;

/* ============================================  CTIMER AUX7 TMRA7POL23 [13..13]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX7_TMRA7POL23                                                    */
  CTIMER_AUX7_TMRA7POL23_NORM          = 0,     /*!< NORM : Upper output normal polarity value.                                */
  CTIMER_AUX7_TMRA7POL23_INV           = 1,     /*!< INV : Upper output inverted polarity. value.                              */
} CTIMER_AUX7_TMRA7POL23_Enum;

/* ============================================  CTIMER AUX7 TMRA7TINV [12..12]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX7_TMRA7TINV                                                     */
  CTIMER_AUX7_TMRA7TINV_DIS            = 0,     /*!< DIS : Disable invert on trigger value.                                    */
  CTIMER_AUX7_TMRA7TINV_EN             = 1,     /*!< EN : Enable invert on trigger value.                                      */
} CTIMER_AUX7_TMRA7TINV_Enum;

/* ===========================================  CTIMER AUX7 TMRA7NOSYNC [11..11]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX7_TMRA7NOSYNC                                                   */
  CTIMER_AUX7_TMRA7NOSYNC_DIS          = 0,     /*!< DIS : Synchronization on source clock value.                              */
  CTIMER_AUX7_TMRA7NOSYNC_NOSYNC       = 1,     /*!< NOSYNC : No synchronization on source clock value.                        */
} CTIMER_AUX7_TMRA7NOSYNC_Enum;

/* =============================================  CTIMER AUX7 TMRA7TRIG [7..10]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX7_TMRA7TRIG                                                     */
  CTIMER_AUX7_TMRA7TRIG_DIS            = 0,     /*!< DIS : Trigger source is disabled. value.                                  */
  CTIMER_AUX7_TMRA7TRIG_B7OUT          = 1,     /*!< B7OUT : Trigger source is CTIMERB7 OUT. value.                            */
  CTIMER_AUX7_TMRA7TRIG_B3OUT          = 2,     /*!< B3OUT : Trigger source is CTIMERB3 OUT. value.                            */
  CTIMER_AUX7_TMRA7TRIG_A3OUT          = 3,     /*!< A3OUT : Trigger source is CTIMERA3 OUT. value.                            */
  CTIMER_AUX7_TMRA7TRIG_A1OUT          = 4,     /*!< A1OUT : Trigger source is CTIMERA1 OUT. value.                            */
  CTIMER_AUX7_TMRA7TRIG_B1OUT          = 5,     /*!< B1OUT : Trigger source is CTIMERB1 OUT. value.                            */
  CTIMER_AUX7_TMRA7TRIG_A4OUT          = 6,     /*!< A4OUT : Trigger source is CTIMERA4 OUT. value.                            */
  CTIMER_AUX7_TMRA7TRIG_B4OUT          = 7,     /*!< B4OUT : Trigger source is CTIMERB4 OUT. value.                            */
  CTIMER_AUX7_TMRA7TRIG_B3OUT2         = 8,     /*!< B3OUT2 : Trigger source is CTIMERB3 OUT2. value.                          */
  CTIMER_AUX7_TMRA7TRIG_A3OUT2         = 9,     /*!< A3OUT2 : Trigger source is CTIMERA3 OUT2. value.                          */
  CTIMER_AUX7_TMRA7TRIG_A2OUT2         = 10,    /*!< A2OUT2 : Trigger source is CTIMERA2 OUT2. value.                          */
  CTIMER_AUX7_TMRA7TRIG_B2OUT2         = 11,    /*!< B2OUT2 : Trigger source is CTIMERB2 OUT2. value.                          */
  CTIMER_AUX7_TMRA7TRIG_A6OUT2DUAL     = 12,    /*!< A6OUT2DUAL : Trigger source is CTIMERA6 OUT2, dual edge. value.           */
  CTIMER_AUX7_TMRA7TRIG_A5OUT2DUAL     = 13,    /*!< A5OUT2DUAL : Trigger source is CTIMERA5 OUT2, dual edge. value.           */
  CTIMER_AUX7_TMRA7TRIG_B4OUT2DUAL     = 14,    /*!< B4OUT2DUAL : Trigger source is CTIMERB4 OUT2, dual edge. value.           */
  CTIMER_AUX7_TMRA7TRIG_A4OUT2DUAL     = 15,    /*!< A4OUT2DUAL : Trigger source is CTIMERA4 OUT2, dual edge. value.           */
} CTIMER_AUX7_TMRA7TRIG_Enum;

/* ========================================================  GLOBEN  ========================================================= */
/* ==============================================  CTIMER GLOBEN ENB7 [15..15]  ============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENB7                                                        */
  CTIMER_GLOBEN_ENB7_LCO               = 1,     /*!< LCO : Use local enable. value.                                            */
  CTIMER_GLOBEN_ENB7_DIS               = 0,     /*!< DIS : Disable CTIMER. value.                                              */
} CTIMER_GLOBEN_ENB7_Enum;

/* ==============================================  CTIMER GLOBEN ENA7 [14..14]  ============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENA7                                                        */
  CTIMER_GLOBEN_ENA7_LCO               = 1,     /*!< LCO : Use local enable. value.                                            */
  CTIMER_GLOBEN_ENA7_DIS               = 0,     /*!< DIS : Disable CTIMER. value.                                              */
} CTIMER_GLOBEN_ENA7_Enum;

/* ==============================================  CTIMER GLOBEN ENB6 [13..13]  ============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENB6                                                        */
  CTIMER_GLOBEN_ENB6_LCO               = 1,     /*!< LCO : Use local enable. value.                                            */
  CTIMER_GLOBEN_ENB6_DIS               = 0,     /*!< DIS : Disable CTIMER. value.                                              */
} CTIMER_GLOBEN_ENB6_Enum;

/* ==============================================  CTIMER GLOBEN ENA6 [12..12]  ============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENA6                                                        */
  CTIMER_GLOBEN_ENA6_LCO               = 1,     /*!< LCO : Use local enable. value.                                            */
  CTIMER_GLOBEN_ENA6_DIS               = 0,     /*!< DIS : Disable CTIMER. value.                                              */
} CTIMER_GLOBEN_ENA6_Enum;

/* ==============================================  CTIMER GLOBEN ENB5 [11..11]  ============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENB5                                                        */
  CTIMER_GLOBEN_ENB5_LCO               = 1,     /*!< LCO : Use local enable. value.                                            */
  CTIMER_GLOBEN_ENB5_DIS               = 0,     /*!< DIS : Disable CTIMER. value.                                              */
} CTIMER_GLOBEN_ENB5_Enum;

/* ==============================================  CTIMER GLOBEN ENA5 [10..10]  ============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENA5                                                        */
  CTIMER_GLOBEN_ENA5_LCO               = 1,     /*!< LCO : Use local enable. value.                                            */
  CTIMER_GLOBEN_ENA5_DIS               = 0,     /*!< DIS : Disable CTIMER. value.                                              */
} CTIMER_GLOBEN_ENA5_Enum;

/* ===============================================  CTIMER GLOBEN ENB4 [9..9]  =============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENB4                                                        */
  CTIMER_GLOBEN_ENB4_LCO               = 1,     /*!< LCO : Use local enable. value.                                            */
  CTIMER_GLOBEN_ENB4_DIS               = 0,     /*!< DIS : Disable CTIMER. value.                                              */
} CTIMER_GLOBEN_ENB4_Enum;

