tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* =============================================  CTIMER OUTCFG0 CFG7 [22..24]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG0_CFG7                                                       */
  CTIMER_OUTCFG0_CFG7_A7OUT2           = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG7_A6OUT2           = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG7_A7OUT            = 5,     /*!< A7OUT : Output is A7OUT. value.                                           */
  CTIMER_OUTCFG0_CFG7_B5OUT            = 4,     /*!< B5OUT : Output is B5OUT. value.                                           */
  CTIMER_OUTCFG0_CFG7_B1OUT            = 3,     /*!< B1OUT : Output is B1OUT. value.                                           */
  CTIMER_OUTCFG0_CFG7_B1OUT2           = 2,     /*!< B1OUT2 : Output is B1OUT2 value.                                          */
  CTIMER_OUTCFG0_CFG7_ONE              = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG0_CFG7_ZERO             = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG0_CFG7_Enum;

/* =============================================  CTIMER OUTCFG0 CFG6 [19..21]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG0_CFG6                                                       */
  CTIMER_OUTCFG0_CFG6_A7OUT2           = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG6_A6OUT2           = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG6_B7OUT            = 5,     /*!< B7OUT : Output is B7OUT. value.                                           */
  CTIMER_OUTCFG0_CFG6_B5OUT2           = 4,     /*!< B5OUT2 : Output is B5OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG6_A1OUT            = 3,     /*!< A1OUT : Output is A1OUT. value.                                           */
  CTIMER_OUTCFG0_CFG6_B1OUT            = 2,     /*!< B1OUT : Output is B1OUT value.                                            */
  CTIMER_OUTCFG0_CFG6_ONE              = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG0_CFG6_ZERO             = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG0_CFG6_Enum;

/* =============================================  CTIMER OUTCFG0 CFG5 [16..18]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG0_CFG5                                                       */
  CTIMER_OUTCFG0_CFG5_A7OUT2           = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG5_A6OUT2           = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG5_A7OUT            = 5,     /*!< A7OUT : Output is A7OUT. value.                                           */
  CTIMER_OUTCFG0_CFG5_B6OUT            = 4,     /*!< B6OUT : Output is A5OUT. value.                                           */
  CTIMER_OUTCFG0_CFG5_A1OUT            = 3,     /*!< A1OUT : Output is A1OUT. value.                                           */
  CTIMER_OUTCFG0_CFG5_A1OUT2           = 2,     /*!< A1OUT2 : Output is A1OUT2 value.                                          */
  CTIMER_OUTCFG0_CFG5_ONE              = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG0_CFG5_ZERO             = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG0_CFG5_Enum;

/* =============================================  CTIMER OUTCFG0 CFG4 [12..14]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG0_CFG4                                                       */
  CTIMER_OUTCFG0_CFG4_A7OUT2           = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG4_A6OUT2           = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG4_B5OUT            = 5,     /*!< B5OUT : Output is B5OUT. value.                                           */
  CTIMER_OUTCFG0_CFG4_A5OUT2           = 4,     /*!< A5OUT2 : Output is A5OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG4_A2OUT2           = 3,     /*!< A2OUT2 : Output is A2OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG4_A1OUT            = 2,     /*!< A1OUT : Output is A1OUT value.                                            */
  CTIMER_OUTCFG0_CFG4_ONE              = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG0_CFG4_ZERO             = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG0_CFG4_Enum;

/* ==============================================  CTIMER OUTCFG0 CFG3 [9..11]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG0_CFG3                                                       */
  CTIMER_OUTCFG0_CFG3_A7OUT2           = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG3_A6OUT2           = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG3_A6OUT            = 5,     /*!< A6OUT : Output is A6OUT. value.                                           */
  CTIMER_OUTCFG0_CFG3_A1OUT            = 4,     /*!< A1OUT : Output is A1OUT. value.                                           */
  CTIMER_OUTCFG0_CFG3_B0OUT            = 3,     /*!< B0OUT : Output is B0OUT. value.                                           */
  CTIMER_OUTCFG0_CFG3_B0OUT2           = 2,     /*!< B0OUT2 : Output is B0OUT2 value.                                          */
  CTIMER_OUTCFG0_CFG3_ONE              = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG0_CFG3_ZERO             = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG0_CFG3_Enum;

/* ==============================================  CTIMER OUTCFG0 CFG2 [6..8]  =============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG0_CFG2                                                       */
  CTIMER_OUTCFG0_CFG2_A7OUT2           = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG2_A6OUT2           = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG2_A7OUT            = 5,     /*!< A7OUT : Output is A7OUT. value.                                           */
  CTIMER_OUTCFG0_CFG2_B6OUT2           = 4,     /*!< B6OUT2 : Output is B6OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG2_B1OUT2           = 3,     /*!< B1OUT2 : Output is B1OUT2. value.                                         */
  CTIMER_OUTCFG0_CFG2_B0OUT            = 2,     /*!< B0OUT : Output is B0OUT value.                                            */
  CTIMER_OUTCFG0_CFG2_ONE              = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG0_CFG2_ZERO             = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG0_CFG2_Enum;

