tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* =============================================  CTIMER OUTCFG1 CFG15 [16..18]  ============================================= */
typedef enum {                                  /*!< CTIMER_OUTCFG1_CFG15                                                      */
  CTIMER_OUTCFG1_CFG15_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG15_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG15_A4OUT2          = 5,     /*!< A4OUT2 : Output is A4OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG15_A7OUT           = 4,     /*!< A7OUT : Output is B1OUT. value.                                           */
  CTIMER_OUTCFG1_CFG15_B3OUT           = 3,     /*!< B3OUT : Output is B3OUT. value.                                           */
  CTIMER_OUTCFG1_CFG15_B3OUT2          = 2,     /*!< B3OUT2 : Output is B3OUT2 value.                                          */
  CTIMER_OUTCFG1_CFG15_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG1_CFG15_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG1_CFG15_Enum;

/* =============================================  CTIMER OUTCFG1 CFG14 [12..14]  ============================================= */
typedef enum {                                  /*!< CTIMER_OUTCFG1_CFG14                                                      */
  CTIMER_OUTCFG1_CFG14_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG14_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG14_A7OUT           = 5,     /*!< A7OUT : Output is A7OUT. value.                                           */
  CTIMER_OUTCFG1_CFG14_B7OUT2          = 4,     /*!< B7OUT2 : Output is B7OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG14_B1OUT           = 3,     /*!< B1OUT : Output is B1OUT. value.                                           */
  CTIMER_OUTCFG1_CFG14_B3OUT           = 2,     /*!< B3OUT : Output is B3OUT value.                                            */
  CTIMER_OUTCFG1_CFG14_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG1_CFG14_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG1_CFG14_Enum;

/* =============================================  CTIMER OUTCFG1 CFG13 [9..11]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG1_CFG13                                                      */
  CTIMER_OUTCFG1_CFG13_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG13_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG13_B4OUT2          = 5,     /*!< B4OUT2 : Output is B4OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG13_A6OUT           = 4,     /*!< A6OUT : Output is B1OUT. value.                                           */
  CTIMER_OUTCFG1_CFG13_A3OUT           = 3,     /*!< A3OUT : Output is A3OUT. value.                                           */
  CTIMER_OUTCFG1_CFG13_A3OUT2          = 2,     /*!< A3OUT2 : Output is A3OUT2 value.                                          */
  CTIMER_OUTCFG1_CFG13_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG1_CFG13_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG1_CFG13_Enum;

/* ==============================================  CTIMER OUTCFG1 CFG12 [6..8]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG1_CFG12                                                      */
  CTIMER_OUTCFG1_CFG12_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG12_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG12_B6OUT2          = 5,     /*!< B6OUT2 : Output is B6OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG12_B0OUT2          = 4,     /*!< B0OUT2 : Output is B0OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG12_B1OUT           = 3,     /*!< B1OUT : Output is B1OUT. value.                                           */
  CTIMER_OUTCFG1_CFG12_A3OUT           = 2,     /*!< A3OUT : Output is A3OUT value.                                            */
  CTIMER_OUTCFG1_CFG12_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG1_CFG12_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG1_CFG12_Enum;

/* ==============================================  CTIMER OUTCFG1 CFG11 [3..5]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG1_CFG11                                                      */
  CTIMER_OUTCFG1_CFG11_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG11_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG11_B5OUT2          = 5,     /*!< B5OUT2 : Output is B5OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG11_B4OUT           = 4,     /*!< B4OUT : Output is B4OUT. value.                                           */
  CTIMER_OUTCFG1_CFG11_B2OUT           = 3,     /*!< B2OUT : Output is B2OUT. value.                                           */
  CTIMER_OUTCFG1_CFG11_B2OUT2          = 2,     /*!< B2OUT2 : Output is B2OUT2 value.                                          */
  CTIMER_OUTCFG1_CFG11_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG1_CFG11_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG1_CFG11_Enum;

/* ==============================================  CTIMER OUTCFG1 CFG10 [0..2]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG1_CFG10                                                      */
  CTIMER_OUTCFG1_CFG10_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG10_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG10_A6OUT           = 5,     /*!< A6OUT : Output is A6OUT. value.                                           */
  CTIMER_OUTCFG1_CFG10_B4OUT2          = 4,     /*!< B4OUT2 : Output is B4OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG10_B3OUT2          = 3,     /*!< B3OUT2 : Output is B3OUT2. value.                                         */
  CTIMER_OUTCFG1_CFG10_B2OUT           = 2,     /*!< B2OUT : Output is B2OUT value.                                            */
  CTIMER_OUTCFG1_CFG10_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG1_CFG10_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG1_CFG10_Enum;

