tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ========================================================  OUTCFG2  ======================================================== */
/* =============================================  CTIMER OUTCFG2 CFG29 [28..30]  ============================================= */
typedef enum {                                  /*!< CTIMER_OUTCFG2_CFG29                                                      */
  CTIMER_OUTCFG2_CFG29_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG29_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG29_A3OUT2          = 5,     /*!< A3OUT2 : Output is A3OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG29_A7OUT           = 4,     /*!< A7OUT : Output is A7OUT. value.                                           */
  CTIMER_OUTCFG2_CFG29_A1OUT           = 3,     /*!< A1OUT : Output is A1OUT. value.                                           */
  CTIMER_OUTCFG2_CFG29_B5OUT2          = 2,     /*!< B5OUT2 : Output is B5OUT2 value.                                          */
  CTIMER_OUTCFG2_CFG29_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG2_CFG29_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG2_CFG29_Enum;

/* =============================================  CTIMER OUTCFG2 CFG28 [25..27]  ============================================= */
typedef enum {                                  /*!< CTIMER_OUTCFG2_CFG28                                                      */
  CTIMER_OUTCFG2_CFG28_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG28_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG28_B0OUT2          = 5,     /*!< B0OUT2 : Output is B0OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG28_A5OUT2          = 4,     /*!< A5OUT2 : Output is A5OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG28_A3OUT           = 3,     /*!< A3OUT : Output is A3OUT. value.                                           */
  CTIMER_OUTCFG2_CFG28_A7OUT           = 2,     /*!< A7OUT : Output is A7OUT value.                                            */
  CTIMER_OUTCFG2_CFG28_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG2_CFG28_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG2_CFG28_Enum;

/* =============================================  CTIMER OUTCFG2 CFG27 [22..24]  ============================================= */
typedef enum {                                  /*!< CTIMER_OUTCFG2_CFG27                                                      */
  CTIMER_OUTCFG2_CFG27_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG27_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG27_B2OUT2          = 5,     /*!< B2OUT2 : Output is B2OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG27_B6OUT           = 4,     /*!< B6OUT : Output is B6OUT. value.                                           */
  CTIMER_OUTCFG2_CFG27_A1OUT           = 3,     /*!< A1OUT : Output is A1OUT. value.                                           */
  CTIMER_OUTCFG2_CFG27_B6OUT2          = 2,     /*!< B6OUT2 : Output is B6OUT2 value.                                          */
  CTIMER_OUTCFG2_CFG27_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG2_CFG27_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG2_CFG27_Enum;

/* =============================================  CTIMER OUTCFG2 CFG26 [19..21]  ============================================= */
typedef enum {                                  /*!< CTIMER_OUTCFG2_CFG26                                                      */
  CTIMER_OUTCFG2_CFG26_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG26_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG26_A1OUT2          = 5,     /*!< A1OUT2 : Output is A1OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG26_A5OUT           = 4,     /*!< A5OUT : Output is A5OUT. value.                                           */
  CTIMER_OUTCFG2_CFG26_B2OUT           = 3,     /*!< B2OUT : Output is B2OUT. value.                                           */
  CTIMER_OUTCFG2_CFG26_B6OUT           = 2,     /*!< B6OUT : Output is B6OUT value.                                            */
  CTIMER_OUTCFG2_CFG26_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG2_CFG26_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG2_CFG26_Enum;

/* =============================================  CTIMER OUTCFG2 CFG25 [16..18]  ============================================= */
typedef enum {                                  /*!< CTIMER_OUTCFG2_CFG25                                                      */
  CTIMER_OUTCFG2_CFG25_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG25_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG25_A2OUT2          = 5,     /*!< A2OUT2 : Output is A2OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG25_A6OUT           = 4,     /*!< A6OUT : Output is A6OUT. value.                                           */
  CTIMER_OUTCFG2_CFG25_B2OUT           = 3,     /*!< B2OUT : Output is B2OUT. value.                                           */
  CTIMER_OUTCFG2_CFG25_B4OUT2          = 2,     /*!< B4OUT2 : Output is B4OUT2 value.                                          */
  CTIMER_OUTCFG2_CFG25_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG2_CFG25_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG2_CFG25_Enum;

