tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* =============================================  CTIMER OUTCFG2 CFG24 [12..14]  ============================================= */
typedef enum {                                  /*!< CTIMER_OUTCFG2_CFG24                                                      */
  CTIMER_OUTCFG2_CFG24_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG24_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG24_B1OUT2          = 5,     /*!< B1OUT2 : Output is B1OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG24_A1OUT           = 4,     /*!< A1OUT : Output is A1OUT. value.                                           */
  CTIMER_OUTCFG2_CFG24_A2OUT           = 3,     /*!< A2OUT : Output is A2OUT. value.                                           */
  CTIMER_OUTCFG2_CFG24_A6OUT           = 2,     /*!< A6OUT : Output is A6OUT value.                                            */
  CTIMER_OUTCFG2_CFG24_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG2_CFG24_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG2_CFG24_Enum;

/* =============================================  CTIMER OUTCFG2 CFG23 [9..11]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG2_CFG23                                                      */
  CTIMER_OUTCFG2_CFG23_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG23_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG23_B0OUT2          = 5,     /*!< B0OUT2 : Output is B0OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG23_A5OUT           = 4,     /*!< A5OUT : Output is A5OUT. value.                                           */
  CTIMER_OUTCFG2_CFG23_A7OUT           = 3,     /*!< A7OUT : Output is B1OUT. value.                                           */
  CTIMER_OUTCFG2_CFG23_B5OUT2          = 2,     /*!< B5OUT2 : Output is B5OUT2 value.                                          */
  CTIMER_OUTCFG2_CFG23_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG2_CFG23_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG2_CFG23_Enum;

/* ==============================================  CTIMER OUTCFG2 CFG22 [6..8]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG2_CFG22                                                      */
  CTIMER_OUTCFG2_CFG22_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG22_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG22_A2OUT2          = 5,     /*!< A2OUT2 : Output is A2OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG22_A1OUT           = 4,     /*!< A1OUT : Output is A1OUT. value.                                           */
  CTIMER_OUTCFG2_CFG22_A6OUT           = 3,     /*!< A6OUT : Output is B1OUT. value.                                           */
  CTIMER_OUTCFG2_CFG22_B5OUT           = 2,     /*!< B5OUT : Output is B5OUT value.                                            */
  CTIMER_OUTCFG2_CFG22_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG2_CFG22_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG2_CFG22_Enum;

/* ==============================================  CTIMER OUTCFG2 CFG21 [3..5]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG2_CFG21                                                      */
  CTIMER_OUTCFG2_CFG21_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG21_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG21_A0OUT2          = 5,     /*!< A0OUT2 : Output is A0OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG21_B5OUT           = 4,     /*!< B5OUT : Output is B5OUT. value.                                           */
  CTIMER_OUTCFG2_CFG21_A1OUT           = 3,     /*!< A1OUT : Output is A1OUT. value.                                           */
  CTIMER_OUTCFG2_CFG21_A5OUT2          = 2,     /*!< A5OUT2 : Output is A5OUT2 value.                                          */
  CTIMER_OUTCFG2_CFG21_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG2_CFG21_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG2_CFG21_Enum;

/* ==============================================  CTIMER OUTCFG2 CFG20 [0..2]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG2_CFG20                                                      */
  CTIMER_OUTCFG2_CFG20_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG20_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG20_B2OUT2          = 5,     /*!< B2OUT2 : Output is B2OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG20_A1OUT2          = 4,     /*!< A1OUT2 : Output is A1OUT2. value.                                         */
  CTIMER_OUTCFG2_CFG20_A1OUT           = 3,     /*!< A1OUT : Output is A1OUT. value.                                           */
  CTIMER_OUTCFG2_CFG20_A5OUT           = 2,     /*!< A5OUT : Output is A5OUT value.                                            */
  CTIMER_OUTCFG2_CFG20_ONE             = 1,     /*!< ONE : Force output to 1. value.                                           */
  CTIMER_OUTCFG2_CFG20_ZERO            = 0,     /*!< ZERO : Force output to 0 value.                                           */
} CTIMER_OUTCFG2_CFG20_Enum;

