tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ===============================================  CTIMER INCFG CFGB3 [7..7]  =============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGB3                                                        */
  CTIMER_INCFG_CFGB3_CT15              = 1,     /*!< CT15 : Input is CT15 value.                                               */
  CTIMER_INCFG_CFGB3_CT14              = 0,     /*!< CT14 : Input is CT14 value.                                               */
} CTIMER_INCFG_CFGB3_Enum;

/* ===============================================  CTIMER INCFG CFGA3 [6..6]  =============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGA3                                                        */
  CTIMER_INCFG_CFGA3_CT13              = 1,     /*!< CT13 : Input is CT13 value.                                               */
  CTIMER_INCFG_CFGA3_CT12              = 0,     /*!< CT12 : Input is CT12 value.                                               */
} CTIMER_INCFG_CFGA3_Enum;

/* ===============================================  CTIMER INCFG CFGB2 [5..5]  =============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGB2                                                        */
  CTIMER_INCFG_CFGB2_CT11              = 1,     /*!< CT11 : Input is CT11 value.                                               */
  CTIMER_INCFG_CFGB2_CT10              = 0,     /*!< CT10 : Input is CT10 value.                                               */
} CTIMER_INCFG_CFGB2_Enum;

/* ===============================================  CTIMER INCFG CFGA2 [4..4]  =============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGA2                                                        */
  CTIMER_INCFG_CFGA2_CT9               = 1,     /*!< CT9 : Input is CT9 value.                                                 */
  CTIMER_INCFG_CFGA2_CT8               = 0,     /*!< CT8 : Input is CT8 value.                                                 */
} CTIMER_INCFG_CFGA2_Enum;

/* ===============================================  CTIMER INCFG CFGB1 [3..3]  =============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGB1                                                        */
  CTIMER_INCFG_CFGB1_CT7               = 1,     /*!< CT7 : Input is CT7 value.                                                 */
  CTIMER_INCFG_CFGB1_CT6               = 0,     /*!< CT6 : Input is CT6 value.                                                 */
} CTIMER_INCFG_CFGB1_Enum;

/* ===============================================  CTIMER INCFG CFGA1 [2..2]  =============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGA1                                                        */
  CTIMER_INCFG_CFGA1_CT5               = 1,     /*!< CT5 : Input is CT5 value.                                                 */
  CTIMER_INCFG_CFGA1_CT4               = 0,     /*!< CT4 : Input is CT4 value.                                                 */
} CTIMER_INCFG_CFGA1_Enum;

/* ===============================================  CTIMER INCFG CFGB0 [1..1]  =============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGB0                                                        */
  CTIMER_INCFG_CFGB0_CT3               = 1,     /*!< CT3 : Input is CT3 value.                                                 */
  CTIMER_INCFG_CFGB0_CT2               = 0,     /*!< CT2 : Input is CT2 value.                                                 */
} CTIMER_INCFG_CFGB0_Enum;

/* ===============================================  CTIMER INCFG CFGA0 [0..0]  =============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGA0                                                        */
  CTIMER_INCFG_CFGA0_CT1               = 1,     /*!< CT1 : Input is CT1 value.                                                 */
  CTIMER_INCFG_CFGA0_CT0               = 0,     /*!< CT0 : Input is CT0 value.                                                 */
} CTIMER_INCFG_CFGA0_Enum;

/* =========================================================  STCFG  ========================================================= */
/* =============================================  CTIMER STCFG FREEZE [31..31]  ============================================== */
typedef enum {                                  /*!< CTIMER_STCFG_FREEZE                                                       */
  CTIMER_STCFG_FREEZE_THAW             = 0,     /*!< THAW : Let the COUNTER register run on its input clock. value.            */
  CTIMER_STCFG_FREEZE_FREEZE           = 1,     /*!< FREEZE : Stop the COUNTER register for loading. value.                    */
} CTIMER_STCFG_FREEZE_Enum;

/* ==============================================  CTIMER STCFG CLEAR [30..30]  ============================================== */
typedef enum {                                  /*!< CTIMER_STCFG_CLEAR                                                        */
  CTIMER_STCFG_CLEAR_RUN               = 0,     /*!< RUN : Let the COUNTER register run on its input clock. value.             */
  CTIMER_STCFG_CLEAR_CLEAR             = 1,     /*!< CLEAR : Stop the COUNTER register for loading. value.                     */
} CTIMER_STCFG_CLEAR_Enum;

/* ==========================================  CTIMER STCFG COMPARE_H_EN [15..15]  =========================================== */
typedef enum {                                  /*!< CTIMER_STCFG_COMPARE_H_EN                                                 */
  CTIMER_STCFG_COMPARE_H_EN_DISABLE    = 0,     /*!< DISABLE : Compare H disabled. value.                                      */
  CTIMER_STCFG_COMPARE_H_EN_ENABLE     = 1,     /*!< ENABLE : Compare H enabled. value.                                        */
} CTIMER_STCFG_COMPARE_H_EN_Enum;

/* ==========================================  CTIMER STCFG COMPARE_G_EN [14..14]  =========================================== */
typedef enum {                                  /*!< CTIMER_STCFG_COMPARE_G_EN                                                 */
  CTIMER_STCFG_COMPARE_G_EN_DISABLE    = 0,     /*!< DISABLE : Compare G disabled. value.                                      */
  CTIMER_STCFG_COMPARE_G_EN_ENABLE     = 1,     /*!< ENABLE : Compare G enabled. value.                                        */
} CTIMER_STCFG_COMPARE_G_EN_Enum;

/* ==========================================  CTIMER STCFG COMPARE_F_EN [13..13]  =========================================== */
typedef enum {                                  /*!< CTIMER_STCFG_COMPARE_F_EN                                                 */
  CTIMER_STCFG_COMPARE_F_EN_DISABLE    = 0,     /*!< DISABLE : Compare F disabled. value.                                      */
  CTIMER_STCFG_COMPARE_F_EN_ENABLE     = 1,     /*!< ENABLE : Compare F enabled. value.                                        */
} CTIMER_STCFG_COMPARE_F_EN_Enum;

/* ==========================================  CTIMER STCFG COMPARE_E_EN [12..12]  =========================================== */
typedef enum {                                  /*!< CTIMER_STCFG_COMPARE_E_EN                                                 */
  CTIMER_STCFG_COMPARE_E_EN_DISABLE    = 0,     /*!< DISABLE : Compare E disabled. value.                                      */
  CTIMER_STCFG_COMPARE_E_EN_ENABLE     = 1,     /*!< ENABLE : Compare E enabled. value.                                        */
} CTIMER_STCFG_COMPARE_E_EN_Enum;

/* ==========================================  CTIMER STCFG COMPARE_D_EN [11..11]  =========================================== */
typedef enum {                                  /*!< CTIMER_STCFG_COMPARE_D_EN                                                 */
  CTIMER_STCFG_COMPARE_D_EN_DISABLE    = 0,     /*!< DISABLE : Compare D disabled. value.                                      */
  CTIMER_STCFG_COMPARE_D_EN_ENABLE     = 1,     /*!< ENABLE : Compare D enabled. value.                                        */
} CTIMER_STCFG_COMPARE_D_EN_Enum;

/* ==========================================  CTIMER STCFG COMPARE_C_EN [10..10]  =========================================== */
typedef enum {                                  /*!< CTIMER_STCFG_COMPARE_C_EN                                                 */
  CTIMER_STCFG_COMPARE_C_EN_DISABLE    = 0,     /*!< DISABLE : Compare C disabled. value.                                      */
  CTIMER_STCFG_COMPARE_C_EN_ENABLE     = 1,     /*!< ENABLE : Compare C enabled. value.                                        */
} CTIMER_STCFG_COMPARE_C_EN_Enum;

