tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ==============================================  GPIO CFGF GPIO41INTD [7..7]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGF_GPIO41INTD                                                      */
  GPIO_CFGF_GPIO41INTD_nCELOW          = 0,     /*!< nCELOW : FNCSEL = 0x0 - nCE polarity active low value.                    */
  GPIO_CFGF_GPIO41INTD_nCEHIGH         = 1,     /*!< nCEHIGH : FNCSEL = 0x0 - nCE polarity active high value.                  */
} GPIO_CFGF_GPIO41INTD_Enum;

/* =============================================  GPIO CFGF GPIO41OUTCFG [5..6]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO41OUTCFG                                                    */
  GPIO_CFGF_GPIO41OUTCFG_DIS           = 0,     /*!< DIS : FNCSEL = 0x3 - Output disabled value.                               */
  GPIO_CFGF_GPIO41OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : FNCSEL = 0x3 - Output is push-pull value.                      */
  GPIO_CFGF_GPIO41OUTCFG_OD            = 2,     /*!< OD : FNCSEL = 0x3 - Output is open drain value.                           */
  GPIO_CFGF_GPIO41OUTCFG_TS            = 3,     /*!< TS : FNCSEL = 0x3 - Output is tri-state value.                            */
} GPIO_CFGF_GPIO41OUTCFG_Enum;

/* =============================================  GPIO CFGF GPIO41INCFG [4..4]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGF_GPIO41INCFG                                                     */
  GPIO_CFGF_GPIO41INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data value.                                      */
  GPIO_CFGF_GPIO41INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero value.                   */
} GPIO_CFGF_GPIO41INCFG_Enum;

/* ==============================================  GPIO CFGF GPIO40INTD [3..3]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGF_GPIO40INTD                                                      */
  GPIO_CFGF_GPIO40INTD_INTDIS          = 0,     /*!< INTDIS : INCFG = 1 - No interrupt on GPIO transition value.               */
  GPIO_CFGF_GPIO40INTD_INTBOTH         = 1,     /*!< INTBOTH : INCFG = 1 - Interrupt on either low to high or high
                                                     to low GPIO transition value.                                             */
} GPIO_CFGF_GPIO40INTD_Enum;

/* =============================================  GPIO CFGF GPIO40OUTCFG [1..2]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO40OUTCFG                                                    */
  GPIO_CFGF_GPIO40OUTCFG_DIS           = 0,     /*!< DIS : FNCSEL = 0x3 - Output disabled value.                               */
  GPIO_CFGF_GPIO40OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : FNCSEL = 0x3 - Output is push-pull value.                      */
  GPIO_CFGF_GPIO40OUTCFG_OD            = 2,     /*!< OD : FNCSEL = 0x3 - Output is open drain value.                           */
  GPIO_CFGF_GPIO40OUTCFG_TS            = 3,     /*!< TS : FNCSEL = 0x3 - Output is tri-state value.                            */
} GPIO_CFGF_GPIO40OUTCFG_Enum;

/* =============================================  GPIO CFGF GPIO40INCFG [0..0]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGF_GPIO40INCFG                                                     */
  GPIO_CFGF_GPIO40INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data value.                                      */
  GPIO_CFGF_GPIO40INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero value.                   */
} GPIO_CFGF_GPIO40INCFG_Enum;

/* =========================================================  CFGG  ========================================================== */
/* ==============================================  GPIO CFGG GPIO49INTD [7..7]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGG_GPIO49INTD                                                      */
  GPIO_CFGG_GPIO49INTD_nCELOW          = 0,     /*!< nCELOW : FNCSEL = 0x1 - nCE polarity active low value.                    */
  GPIO_CFGG_GPIO49INTD_nCEHIGH         = 1,     /*!< nCEHIGH : FNCSEL = 0x1 - nCE polarity active high value.                  */
} GPIO_CFGG_GPIO49INTD_Enum;

/* =============================================  GPIO CFGG GPIO49OUTCFG [5..6]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO49OUTCFG                                                    */
  GPIO_CFGG_GPIO49OUTCFG_DIS           = 0,     /*!< DIS : FNCSEL = 0x3 - Output disabled value.                               */
  GPIO_CFGG_GPIO49OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : FNCSEL = 0x3 - Output is push-pull value.                      */
  GPIO_CFGG_GPIO49OUTCFG_OD            = 2,     /*!< OD : FNCSEL = 0x3 - Output is open drain value.                           */
  GPIO_CFGG_GPIO49OUTCFG_TS            = 3,     /*!< TS : FNCSEL = 0x3 - Output is tri-state value.                            */
} GPIO_CFGG_GPIO49OUTCFG_Enum;

/* =============================================  GPIO CFGG GPIO49INCFG [4..4]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGG_GPIO49INCFG                                                     */
  GPIO_CFGG_GPIO49INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data value.                                      */
  GPIO_CFGG_GPIO49INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero value.                   */
} GPIO_CFGG_GPIO49INCFG_Enum;

/* ==============================================  GPIO CFGG GPIO48INTD [3..3]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGG_GPIO48INTD                                                      */
  GPIO_CFGG_GPIO48INTD_nCELOW          = 0,     /*!< nCELOW : FNCSEL = 0x1 - nCE polarity active low value.                    */
  GPIO_CFGG_GPIO48INTD_nCEHIGH         = 1,     /*!< nCEHIGH : FNCSEL = 0x1 - nCE polarity active high value.                  */
} GPIO_CFGG_GPIO48INTD_Enum;

/* =============================================  GPIO CFGG GPIO48OUTCFG [1..2]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO48OUTCFG                                                    */
  GPIO_CFGG_GPIO48OUTCFG_DIS           = 0,     /*!< DIS : FNCSEL = 0x3 - Output disabled value.                               */
  GPIO_CFGG_GPIO48OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : FNCSEL = 0x3 - Output is push-pull value.                      */
  GPIO_CFGG_GPIO48OUTCFG_OD            = 2,     /*!< OD : FNCSEL = 0x3 - Output is open drain value.                           */
  GPIO_CFGG_GPIO48OUTCFG_TS            = 3,     /*!< TS : FNCSEL = 0x3 - Output is tri-state value.                            */
} GPIO_CFGG_GPIO48OUTCFG_Enum;

/* =============================================  GPIO CFGG GPIO48INCFG [0..0]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGG_GPIO48INCFG                                                     */
  GPIO_CFGG_GPIO48INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data value.                                      */
  GPIO_CFGG_GPIO48INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero value.                   */
} GPIO_CFGG_GPIO48INCFG_Enum;

