tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ==============================================  GPIO CTENCFG EN30 [30..30]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN30                                                         */
  GPIO_CTENCFG_EN30_DIS                = 1,     /*!< DIS : Disable CT30 for output value.                                      */
  GPIO_CTENCFG_EN30_EN                 = 0,     /*!< EN : Enable CT30 for output value.                                        */
} GPIO_CTENCFG_EN30_Enum;

/* ==============================================  GPIO CTENCFG EN29 [29..29]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN29                                                         */
  GPIO_CTENCFG_EN29_DIS                = 1,     /*!< DIS : Disable CT29 for output value.                                      */
  GPIO_CTENCFG_EN29_EN                 = 0,     /*!< EN : Enable CT29 for output value.                                        */
} GPIO_CTENCFG_EN29_Enum;

/* ==============================================  GPIO CTENCFG EN28 [28..28]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN28                                                         */
  GPIO_CTENCFG_EN28_DIS                = 1,     /*!< DIS : Disable CT28 for output value.                                      */
  GPIO_CTENCFG_EN28_EN                 = 0,     /*!< EN : Enable CT28 for output value.                                        */
} GPIO_CTENCFG_EN28_Enum;

/* ==============================================  GPIO CTENCFG EN27 [27..27]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN27                                                         */
  GPIO_CTENCFG_EN27_DIS                = 1,     /*!< DIS : Disable CT27 for output value.                                      */
  GPIO_CTENCFG_EN27_EN                 = 0,     /*!< EN : Enable CT27 for output value.                                        */
} GPIO_CTENCFG_EN27_Enum;

/* ==============================================  GPIO CTENCFG EN26 [26..26]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN26                                                         */
  GPIO_CTENCFG_EN26_DIS                = 1,     /*!< DIS : Disable CT26 for output value.                                      */
  GPIO_CTENCFG_EN26_EN                 = 0,     /*!< EN : Enable CT26 for output value.                                        */
} GPIO_CTENCFG_EN26_Enum;

/* ==============================================  GPIO CTENCFG EN25 [25..25]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN25                                                         */
  GPIO_CTENCFG_EN25_DIS                = 1,     /*!< DIS : Disable CT25 for output value.                                      */
  GPIO_CTENCFG_EN25_EN                 = 0,     /*!< EN : Enable CT25 for output value.                                        */
} GPIO_CTENCFG_EN25_Enum;

/* ==============================================  GPIO CTENCFG EN24 [24..24]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN24                                                         */
  GPIO_CTENCFG_EN24_DIS                = 1,     /*!< DIS : Disable CT24 for output value.                                      */
  GPIO_CTENCFG_EN24_EN                 = 0,     /*!< EN : Enable CT24 for output value.                                        */
} GPIO_CTENCFG_EN24_Enum;

/* ==============================================  GPIO CTENCFG EN23 [23..23]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN23                                                         */
  GPIO_CTENCFG_EN23_DIS                = 1,     /*!< DIS : Disable CT23 for output value.                                      */
  GPIO_CTENCFG_EN23_EN                 = 0,     /*!< EN : Enable CT23 for output value.                                        */
} GPIO_CTENCFG_EN23_Enum;

/* ==============================================  GPIO CTENCFG EN22 [22..22]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN22                                                         */
  GPIO_CTENCFG_EN22_DIS                = 1,     /*!< DIS : Disable CT22 for output value.                                      */
  GPIO_CTENCFG_EN22_EN                 = 0,     /*!< EN : Enable CT22 for output value.                                        */
} GPIO_CTENCFG_EN22_Enum;

/* ==============================================  GPIO CTENCFG EN21 [21..21]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN21                                                         */
  GPIO_CTENCFG_EN21_DIS                = 1,     /*!< DIS : Disable CT21 for output value.                                      */
  GPIO_CTENCFG_EN21_EN                 = 0,     /*!< EN : Enable CT21 for output value.                                        */
} GPIO_CTENCFG_EN21_Enum;

/* ==============================================  GPIO CTENCFG EN20 [20..20]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN20                                                         */
  GPIO_CTENCFG_EN20_DIS                = 1,     /*!< DIS : Disable CT20 for output value.                                      */
  GPIO_CTENCFG_EN20_EN                 = 0,     /*!< EN : Enable CT20 for output value.                                        */
} GPIO_CTENCFG_EN20_Enum;

/* ==============================================  GPIO CTENCFG EN19 [19..19]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN19                                                         */
  GPIO_CTENCFG_EN19_DIS                = 1,     /*!< DIS : Disable CT19 for output value.                                      */
  GPIO_CTENCFG_EN19_EN                 = 0,     /*!< EN : Enable CT19 for output value.                                        */
} GPIO_CTENCFG_EN19_Enum;

/* ==============================================  GPIO CTENCFG EN18 [18..18]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN18                                                         */
  GPIO_CTENCFG_EN18_DIS                = 1,     /*!< DIS : Disable CT18 for output value.                                      */
  GPIO_CTENCFG_EN18_EN                 = 0,     /*!< EN : Enable CT18 for output value.                                        */
} GPIO_CTENCFG_EN18_Enum;

/* ==============================================  GPIO CTENCFG EN17 [17..17]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN17                                                         */
  GPIO_CTENCFG_EN17_DIS                = 1,     /*!< DIS : Disable CT17 for output value.                                      */
  GPIO_CTENCFG_EN17_EN                 = 0,     /*!< EN : Enable CT17 for output value.                                        */
} GPIO_CTENCFG_EN17_Enum;

/* ==============================================  GPIO CTENCFG EN16 [16..16]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN16                                                         */
  GPIO_CTENCFG_EN16_DIS                = 1,     /*!< DIS : Disable CT16 for output value.                                      */
  GPIO_CTENCFG_EN16_EN                 = 0,     /*!< EN : Enable CT16 for output value.                                        */
} GPIO_CTENCFG_EN16_Enum;

/* ==============================================  GPIO CTENCFG EN15 [15..15]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN15                                                         */
  GPIO_CTENCFG_EN15_DIS                = 1,     /*!< DIS : Disable CT15 for output value.                                      */
  GPIO_CTENCFG_EN15_EN                 = 0,     /*!< EN : Enable CT15 for output value.                                        */
} GPIO_CTENCFG_EN15_Enum;

