tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ======================================================  OTAPOINTER  ======================================================= */
/* ======================================================  APBDMACTRL  ======================================================= */
/* =========================================  MCUCTRL APBDMACTRL DECODEABORT [1..1]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_APBDMACTRL_DECODEABORT                                            */
  MCUCTRL_APBDMACTRL_DECODEABORT_DISABLE = 0,   /*!< DISABLE : Bus operations to powered down peripherals are quietly
                                                     discarded value.                                                          */
  MCUCTRL_APBDMACTRL_DECODEABORT_ENABLE = 1,    /*!< ENABLE : Bus operations to powered down peripherals result in
                                                     a bus fault. value.                                                       */
} MCUCTRL_APBDMACTRL_DECODEABORT_Enum;

/* =========================================  MCUCTRL APBDMACTRL DMA_ENABLE [0..0]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_APBDMACTRL_DMA_ENABLE                                             */
  MCUCTRL_APBDMACTRL_DMA_ENABLE_DISABLE = 0,    /*!< DISABLE : DMA operations disabled value.                                  */
  MCUCTRL_APBDMACTRL_DMA_ENABLE_ENABLE = 1,     /*!< ENABLE : DMA operations enabled value.                                    */
} MCUCTRL_APBDMACTRL_DMA_ENABLE_Enum;

/* =======================================================  SRAMMODE  ======================================================== */
/* ======================================================  KEXTCLKSEL  ======================================================= */
/* =========================================  MCUCTRL KEXTCLKSEL KEXTCLKSEL [0..31]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_KEXTCLKSEL_KEXTCLKSEL                                             */
  MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Key    = 83,    /*!< Key : Key value.                                                          */
} MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Enum;

/* =======================================================  SIMOBUCK4  ======================================================= */
/* =======================================================  BLEBUCK2  ======================================================== */
/* ======================================================  FLASHWPROT0  ====================================================== */
/* ======================================================  FLASHWPROT1  ====================================================== */
/* ======================================================  FLASHRPROT0  ====================================================== */
/* ======================================================  FLASHRPROT1  ====================================================== */
/* =================================================  DMASRAMWRITEPROTECT0  ================================================== */
/* =================================================  DMASRAMWRITEPROTECT1  ================================================== */
/* ==================================================  DMASRAMREADPROTECT0  ================================================== */
/* ==================================================  DMASRAMREADPROTECT1  ================================================== */


/* =========================================================================================================================== */
/* ================                                           MSPI                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* ==========================================================  CFG  ========================================================== */
/* ================================================  MSPI CFG CPOL [17..17]  ================================================= */
typedef enum {                                  /*!< MSPI_CFG_CPOL                                                             */
  MSPI_CFG_CPOL_LOW                    = 0,     /*!< LOW : Clock inactive state is low. value.                                 */
  MSPI_CFG_CPOL_HIGH                   = 1,     /*!< HIGH : Clock inactive state is high. value.                               */
} MSPI_CFG_CPOL_Enum;

/* ================================================  MSPI CFG CPHA [16..16]  ================================================= */
typedef enum {                                  /*!< MSPI_CFG_CPHA                                                             */
  MSPI_CFG_CPHA_MIDDLE                 = 0,     /*!< MIDDLE : Clock toggles in middle of data bit. value.                      */
  MSPI_CFG_CPHA_START                  = 1,     /*!< START : Clock toggles at start of data bit. value.                        */
} MSPI_CFG_CPHA_Enum;

/* ================================================  MSPI CFG DEVCFG [0..3]  ================================================= */
typedef enum {                                  /*!< MSPI_CFG_DEVCFG                                                           */
  MSPI_CFG_DEVCFG_SERIAL0              = 1,     /*!< SERIAL0 : Single bit SPI flash on chip select 0 value.                    */
  MSPI_CFG_DEVCFG_SERIAL1              = 2,     /*!< SERIAL1 : Single bit SPI flash on chip select 1 value.                    */
  MSPI_CFG_DEVCFG_DUAL0                = 5,     /*!< DUAL0 : Dual SPI flash on chip select 0 value.                            */
  MSPI_CFG_DEVCFG_DUAL1                = 6,     /*!< DUAL1 : Dual bit SPI flash on chip select 1 value.                        */
  MSPI_CFG_DEVCFG_QUAD0                = 9,     /*!< QUAD0 : Quad SPI flash on chip select 0 value.                            */
  MSPI_CFG_DEVCFG_QUAD1                = 10,    /*!< QUAD1 : Quad SPI flash on chip select 1 value.                            */
  MSPI_CFG_DEVCFG_OCTAL0               = 13,    /*!< OCTAL0 : Octal SPI flash on chip select 0 value.                          */
  MSPI_CFG_DEVCFG_OCTAL1               = 14,    /*!< OCTAL1 : Octal SPI flash on chip select 1 value.                          */
  MSPI_CFG_DEVCFG_QUADPAIRED           = 15,    /*!< QUADPAIRED : Dual Quad SPI flash on chip selects 0/1. value.              */
  MSPI_CFG_DEVCFG_QUADPAIRED_SERIAL    = 3,     /*!< QUADPAIRED_SERIAL : Dual Quad SPI flash on chip selects 0/1,
                                                     but transmit in serial mode for initialization operations
                                                     value.                                                                    */
} MSPI_CFG_DEVCFG_Enum;

/* =========================================================  ADDR  ========================================================== */
/* =========================================================  INSTR  ========================================================= */
/* ========================================================  TXFIFO  ========================================================= */
/* ========================================================  RXFIFO  ========================================================= */
/* =======================================================  TXENTRIES  ======================================================= */
/* =======================================================  RXENTRIES  ======================================================= */
/* =======================================================  THRESHOLD  ======================================================= */
/* ========================================================  MSPICFG  ======================================================== */
/* ==============================================  MSPI MSPICFG CLKDIV [8..13]  ============================================== */
typedef enum {                                  /*!< MSPI_MSPICFG_CLKDIV                                                       */
  MSPI_MSPICFG_CLKDIV_CLK24            = 2,     /*!< CLK24 : 24 MHz MSPI clock value.                                          */
  MSPI_MSPICFG_CLKDIV_CLK12            = 4,     /*!< CLK12 : 12 MHz MSPI clock value.                                          */
  MSPI_MSPICFG_CLKDIV_CLK6             = 8,     /*!< CLK6 : 6 MHz MSPI clock value.                                            */
  MSPI_MSPICFG_CLKDIV_CLK3             = 16,    /*!< CLK3 : 3 MHz MSPI clock value.                                            */
  MSPI_MSPICFG_CLKDIV_CLK1_5           = 32,    /*!< CLK1_5 : 1.5 MHz MSPI clock value.                                        */
} MSPI_MSPICFG_CLKDIV_Enum;

