tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ==============================================  MSPI MSPICFG IOMSEL [4..6]  =============================================== */
typedef enum {                                  /*!< MSPI_MSPICFG_IOMSEL                                                       */
  MSPI_MSPICFG_IOMSEL_IOM0             = 0,     /*!< IOM0 : ERROR: desc VALUE MISSING value.                                   */
  MSPI_MSPICFG_IOMSEL_IOM1             = 1,     /*!< IOM1 : ERROR: desc VALUE MISSING value.                                   */
  MSPI_MSPICFG_IOMSEL_IOM2             = 2,     /*!< IOM2 : ERROR: desc VALUE MISSING value.                                   */
  MSPI_MSPICFG_IOMSEL_IOM3             = 3,     /*!< IOM3 : ERROR: desc VALUE MISSING value.                                   */
  MSPI_MSPICFG_IOMSEL_IOM4             = 4,     /*!< IOM4 : ERROR: desc VALUE MISSING value.                                   */
  MSPI_MSPICFG_IOMSEL_IOM5             = 5,     /*!< IOM5 : ERROR: desc VALUE MISSING value.                                   */
  MSPI_MSPICFG_IOMSEL_DISABLED         = 7,     /*!< DISABLED : No IOM selected. Signals always zero. value.                   */
} MSPI_MSPICFG_IOMSEL_Enum;

/* ===============================================  MSPI MSPICFG TXNEG [3..3]  =============================================== */
typedef enum {                                  /*!< MSPI_MSPICFG_TXNEG                                                        */
  MSPI_MSPICFG_TXNEG_NORMAL            = 0,     /*!< NORMAL : TX launched from posedge internal clock value.                   */
  MSPI_MSPICFG_TXNEG_NEGEDGE           = 1,     /*!< NEGEDGE : TX data launched from negedge of internal clock value.          */
} MSPI_MSPICFG_TXNEG_Enum;

/* ===============================================  MSPI MSPICFG RXNEG [2..2]  =============================================== */
typedef enum {                                  /*!< MSPI_MSPICFG_RXNEG                                                        */
  MSPI_MSPICFG_RXNEG_NORMAL            = 0,     /*!< NORMAL : RX data sampled on posedge of internal clock value.              */
  MSPI_MSPICFG_RXNEG_NEGEDGE           = 1,     /*!< NEGEDGE : RX data sampled on negedge of internal clock value.             */
} MSPI_MSPICFG_RXNEG_Enum;

/* ===============================================  MSPI MSPICFG RXCAP [1..1]  =============================================== */
typedef enum {                                  /*!< MSPI_MSPICFG_RXCAP                                                        */
  MSPI_MSPICFG_RXCAP_NORMAL            = 0,     /*!< NORMAL : RX Capture phase aligns with CPHA setting value.                 */
  MSPI_MSPICFG_RXCAP_DELAY             = 1,     /*!< DELAY : RX Capture phase is delayed from CPHA setting by one
                                                     clock edge value.                                                         */
} MSPI_MSPICFG_RXCAP_Enum;

/* ==============================================  MSPI MSPICFG APBCLK [0..0]  =============================================== */
typedef enum {                                  /*!< MSPI_MSPICFG_APBCLK                                                       */
  MSPI_MSPICFG_APBCLK_DIS              = 0,     /*!< DIS : Disable continuous clock. value.                                    */
  MSPI_MSPICFG_APBCLK_EN               = 1,     /*!< EN : Enable continuous clock. value.                                      */
} MSPI_MSPICFG_APBCLK_Enum;

/* ========================================================  PADCFG  ========================================================= */
/* =======================================================  PADOUTEN  ======================================================== */
/* ==============================================  MSPI PADOUTEN OUTEN [0..8]  =============================================== */
typedef enum {                                  /*!< MSPI_PADOUTEN_OUTEN                                                       */
  MSPI_PADOUTEN_OUTEN_QUAD0            = 271,   /*!< QUAD0 : Quad0 (4 data + 1 clock) value.                                   */
  MSPI_PADOUTEN_OUTEN_QUAD1            = 496,   /*!< QUAD1 : Quad1 (4 data + 1 clock) value.                                   */
  MSPI_PADOUTEN_OUTEN_OCTAL            = 511,   /*!< OCTAL : Octal (8 data + 1 clock) value.                                   */
  MSPI_PADOUTEN_OUTEN_SERIAL0          = 259,   /*!< SERIAL0 : Serial (2 data + 1 clock) value.                                */
} MSPI_PADOUTEN_OUTEN_Enum;

/* =========================================================  FLASH  ========================================================= */
/* ===============================================  MSPI FLASH XIPACK [2..3]  ================================================ */
typedef enum {                                  /*!< MSPI_FLASH_XIPACK                                                         */
  MSPI_FLASH_XIPACK_NOACK              = 0,     /*!< NOACK : No acknowledege sent. Data IOs are tristated the first
                                                     turnaround cycle value.                                                   */
  MSPI_FLASH_XIPACK_ACK                = 2,     /*!< ACK : Positive acknowledege sent. Data IOs are driven to 0 the
                                                     first turnaround cycle to acknowledge XIP mode value.                     */
  MSPI_FLASH_XIPACK_TERMINATE          = 3,     /*!< TERMINATE : Negative acknowledege sent. Data IOs are driven
                                                     to 1 the first turnaround cycle to terminate XIP mode.
                                                     XIPSENDI should be reenabled for the next transfer value.                 */
} MSPI_FLASH_XIPACK_Enum;

/* ======================================================  SCRAMBLING  ======================================================= */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* ========================================================  DMACFG  ========================================================= */
/* ===============================================  MSPI DMACFG DMAPRI [3..4]  =============================================== */
typedef enum {                                  /*!< MSPI_DMACFG_DMAPRI                                                        */
  MSPI_DMACFG_DMAPRI_LOW               = 0,     /*!< LOW : Low Priority (service as best effort) value.                        */
  MSPI_DMACFG_DMAPRI_HIGH              = 1,     /*!< HIGH : High Priority (service immediately) value.                         */
  MSPI_DMACFG_DMAPRI_AUTO              = 2,     /*!< AUTO : Auto Priority (priority raised once TX FIFO empties or
                                                     RX FIFO fills) value.                                                     */
} MSPI_DMACFG_DMAPRI_Enum;

/* ===============================================  MSPI DMACFG DMADIR [2..2]  =============================================== */
typedef enum {                                  /*!< MSPI_DMACFG_DMADIR                                                        */
  MSPI_DMACFG_DMADIR_P2M               = 0,     /*!< P2M : Peripheral to Memory (SRAM) transaction value.                      */
  MSPI_DMACFG_DMADIR_M2P               = 1,     /*!< M2P : Memory to Peripheral transaction value.                             */
} MSPI_DMACFG_DMADIR_Enum;

/* ===============================================  MSPI DMACFG DMAEN [0..1]  ================================================ */
typedef enum {                                  /*!< MSPI_DMACFG_DMAEN                                                         */
  MSPI_DMACFG_DMAEN_DIS                = 0,     /*!< DIS : Disable DMA Function value.                                         */
  MSPI_DMACFG_DMAEN_EN                 = 3,     /*!< EN : Enable HW controlled DMA Function to manage DMA to flash
                                                     devices. HW will automatically handle issuance of instruction/address
                                                     bytes based on settings in the FLASH register. value.                     */
} MSPI_DMACFG_DMAEN_Enum;

/* ========================================================  DMASTAT  ======================================================== */
/* ======================================================  DMATARGADDR  ====================================================== */
/* ======================================================  DMADEVADDR  ======================================================= */
/* ======================================================  DMATOTCOUNT  ====================================================== */
/* =======================================================  DMABCOUNT  ======================================================= */
/* =======================================================  DMATHRESH  ======================================================= */
/* =========================================================  CQCFG  ========================================================= */
/* ================================================  MSPI CQCFG CQPRI [1..1]  ================================================ */
typedef enum {                                  /*!< MSPI_CQCFG_CQPRI                                                          */
  MSPI_CQCFG_CQPRI_LOW                 = 0,     /*!< LOW : Low Priority (service as best effort) value.                        */
  MSPI_CQCFG_CQPRI_HIGH                = 1,     /*!< HIGH : High Priority (service immediately) value.                         */
} MSPI_CQCFG_CQPRI_Enum;

/* ================================================  MSPI CQCFG CQEN [0..0]  ================================================= */
typedef enum {                                  /*!< MSPI_CQCFG_CQEN                                                           */
  MSPI_CQCFG_CQEN_DIS                  = 0,     /*!< DIS : Disable CQ Function value.                                          */
  MSPI_CQCFG_CQEN_EN                   = 1,     /*!< EN : Enable CQ Function value.                                            */
} MSPI_CQCFG_CQEN_Enum;

