tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ========================================================  CQADDR  ========================================================= */
/* ========================================================  CQSTAT  ========================================================= */
/* ========================================================  CQFLAGS  ======================================================== */
/* =============================================  MSPI CQFLAGS CQFLAGS [0..15]  ============================================== */
typedef enum {                                  /*!< MSPI_CQFLAGS_CQFLAGS                                                      */
  MSPI_CQFLAGS_CQFLAGS_STOP            = 32768, /*!< STOP : CQ Stop Flag. When set, CQ processing will complete.
                                                     value.                                                                    */
  MSPI_CQFLAGS_CQFLAGS_CQIDX           = 16384, /*!< CQIDX : CQ Index Pointers (CURIDX/ENDIDX) match. value.                   */
  MSPI_CQFLAGS_CQFLAGS_DMACPL          = 2048,  /*!< DMACPL : DMA Complete Status (hardwired DMACPL bit in DMASTAT)
                                                     value.                                                                    */
  MSPI_CQFLAGS_CQFLAGS_CMDCPL          = 1024,  /*!< CMDCPL : PIO Operation completed (STATUS bit in CTRL register)
                                                     value.                                                                    */
  MSPI_CQFLAGS_CQFLAGS_IOM1READY       = 512,   /*!< IOM1READY : IOM Buffer 1 Ready Status (from selected IOM). This
                                                     status is the result of XOR'ing the IOM0START with the
                                                     incoming status from the IOM. When high, MSPI can send
                                                     to the buffer. value.                                                     */
  MSPI_CQFLAGS_CQFLAGS_IOM0READY       = 256,   /*!< IOM0READY : IOM Buffer 0 Ready Status (from selected IOM). This
                                                     status is the result of XOR'ing the IOM0START with the
                                                     incoming status from the IOM. When high, MSPI can send
                                                     to the buffer. value.                                                     */
  MSPI_CQFLAGS_CQFLAGS_SWFLAG7         = 128,   /*!< SWFLAG7 : Software flag 7. Can be used by software to start/pause
                                                     operations value.                                                         */
  MSPI_CQFLAGS_CQFLAGS_SWFLAG6         = 64,    /*!< SWFLAG6 : Software flag 6. Can be used by software to start/pause
                                                     operatoins value.                                                         */
  MSPI_CQFLAGS_CQFLAGS_SWFLAG5         = 32,    /*!< SWFLAG5 : Software flag 5. Can be used by software to start/pause
                                                     operations value.                                                         */
  MSPI_CQFLAGS_CQFLAGS_SWFLAG4         = 16,    /*!< SWFLAG4 : Software flag 4. Can be used by software to start/pause
                                                     operatoins value.                                                         */
  MSPI_CQFLAGS_CQFLAGS_SWFLAG3         = 8,     /*!< SWFLAG3 : Software flag 3. Can be used by software to start/pause
                                                     operations value.                                                         */
  MSPI_CQFLAGS_CQFLAGS_SWFLAG2         = 4,     /*!< SWFLAG2 : Software flag 2. Can be used by software to start/pause
                                                     operatoins value.                                                         */
  MSPI_CQFLAGS_CQFLAGS_SWFLAG1         = 2,     /*!< SWFLAG1 : Software flag 1. Can be used by software to start/pause
                                                     operations value.                                                         */
  MSPI_CQFLAGS_CQFLAGS_SWFLAG0         = 1,     /*!< SWFLAG0 : Software flag 0. Can be used by software to start/pause
                                                     operatoins value.                                                         */
} MSPI_CQFLAGS_CQFLAGS_Enum;

/* ======================================================  CQSETCLEAR  ======================================================= */
/* ========================================================  CQPAUSE  ======================================================== */
/* ==============================================  MSPI CQPAUSE CQMASK [0..15]  ============================================== */
typedef enum {                                  /*!< MSPI_CQPAUSE_CQMASK                                                       */
  MSPI_CQPAUSE_CQMASK_STOP             = 32768, /*!< STOP : CQ Stop Flag. When set, CQ processing will complete.
                                                     value.                                                                    */
  MSPI_CQPAUSE_CQMASK_CQIDX            = 16384, /*!< CQIDX : CQ Index Pointers (CURIDX/ENDIDX) match. value.                   */
  MSPI_CQPAUSE_CQMASK_DMACPL           = 2048,  /*!< DMACPL : DMA Complete Status (hardwired DMACPL bit in DMASTAT)
                                                     value.                                                                    */
  MSPI_CQPAUSE_CQMASK_CMDCPL           = 1024,  /*!< CMDCPL : PIO Operation completed (STATUS bit in CTRL register)
                                                     value.                                                                    */
  MSPI_CQPAUSE_CQMASK_IOM1READY        = 512,   /*!< IOM1READY : IOM Buffer 1 Ready Status (from selected IOM). This
                                                     status is the result of XOR'ing the IOM0START with the
                                                     incoming status from the IOM. When high, MSPI can send
                                                     to the buffer. value.                                                     */
  MSPI_CQPAUSE_CQMASK_IOM0READY        = 256,   /*!< IOM0READY : IOM Buffer 0 Ready Status (from selected IOM). This
                                                     status is the result of XOR'ing the IOM0START with the
                                                     incoming status from the IOM. When high, MSPI can send
                                                     to the buffer. value.                                                     */
  MSPI_CQPAUSE_CQMASK_SWFLAG7          = 128,   /*!< SWFLAG7 : Software flag 7. Can be used by software to start/pause
                                                     operations value.                                                         */
  MSPI_CQPAUSE_CQMASK_SWFLAG6          = 64,    /*!< SWFLAG6 : Software flag 6. Can be used by software to start/pause
                                                     operatoins value.                                                         */
  MSPI_CQPAUSE_CQMASK_SWFLAG5          = 32,    /*!< SWFLAG5 : Software flag 5. Can be used by software to start/pause
                                                     operations value.                                                         */
  MSPI_CQPAUSE_CQMASK_SWFLAG4          = 16,    /*!< SWFLAG4 : Software flag 4. Can be used by software to start/pause
                                                     operatoins value.                                                         */
  MSPI_CQPAUSE_CQMASK_SWFLAG3          = 8,     /*!< SWFLAG3 : Software flag 3. Can be used by software to start/pause
                                                     operations value.                                                         */
  MSPI_CQPAUSE_CQMASK_SWFLAG2          = 4,     /*!< SWFLAG2 : Software flag 2. Can be used by software to start/pause
                                                     operatoins value.                                                         */
  MSPI_CQPAUSE_CQMASK_SWFLAG1          = 2,     /*!< SWFLAG1 : Software flag 1. Can be used by software to start/pause
                                                     operations value.                                                         */
  MSPI_CQPAUSE_CQMASK_SWFLAG0          = 1,     /*!< SWFLAG0 : Software flag 0. Can be used by software to start/pause
                                                     operatoins value.                                                         */
} MSPI_CQPAUSE_CQMASK_Enum;

