tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* =======================================================  CQCURIDX  ======================================================== */
/* =======================================================  CQENDIDX  ======================================================== */


/* =========================================================================================================================== */
/* ================                                            PDM                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  PCFG  ========================================================== */
/* ===============================================  PDM PCFG LRSWAP [31..31]  ================================================ */
typedef enum {                                  /*!< PDM_PCFG_LRSWAP                                                           */
  PDM_PCFG_LRSWAP_EN                   = 1,     /*!< EN : Swap left and right channels (FIFO Read RIGHT_LEFT). value.          */
  PDM_PCFG_LRSWAP_NOSWAP               = 0,     /*!< NOSWAP : No channel swapping (IFO Read LEFT_RIGHT). value.                */
} PDM_PCFG_LRSWAP_Enum;

/* ==============================================  PDM PCFG PGARIGHT [26..30]  =============================================== */
typedef enum {                                  /*!< PDM_PCFG_PGARIGHT                                                         */
  PDM_PCFG_PGARIGHT_P405DB             = 31,    /*!< P405DB : 40.5 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P390DB             = 30,    /*!< P390DB : 39.0 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P375DB             = 29,    /*!< P375DB : 37.5 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P360DB             = 28,    /*!< P360DB : 36.0 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P345DB             = 27,    /*!< P345DB : 34.5 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P330DB             = 26,    /*!< P330DB : 33.0 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P315DB             = 25,    /*!< P315DB : 31.5 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P300DB             = 24,    /*!< P300DB : 30.0 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P285DB             = 23,    /*!< P285DB : 28.5 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P270DB             = 22,    /*!< P270DB : 27.0 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P255DB             = 21,    /*!< P255DB : 25.5 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P240DB             = 20,    /*!< P240DB : 24.0 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P225DB             = 19,    /*!< P225DB : 22.5 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P210DB             = 18,    /*!< P210DB : 21.0 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P195DB             = 17,    /*!< P195DB : 19.5 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P180DB             = 16,    /*!< P180DB : 18.0 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P165DB             = 15,    /*!< P165DB : 16.5 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P150DB             = 14,    /*!< P150DB : 15.0 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P135DB             = 13,    /*!< P135DB : 13.5 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P120DB             = 12,    /*!< P120DB : 12.0 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P105DB             = 11,    /*!< P105DB : 10.5 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_P90DB              = 10,    /*!< P90DB : 9.0 db gain. value.                                               */
  PDM_PCFG_PGARIGHT_P75DB              = 9,     /*!< P75DB : 7.5 db gain. value.                                               */
  PDM_PCFG_PGARIGHT_P60DB              = 8,     /*!< P60DB : 6.0 db gain. value.                                               */
  PDM_PCFG_PGARIGHT_P45DB              = 7,     /*!< P45DB : 4.5 db gain. value.                                               */
  PDM_PCFG_PGARIGHT_P30DB              = 6,     /*!< P30DB : 3.0 db gain. value.                                               */
  PDM_PCFG_PGARIGHT_P15DB              = 5,     /*!< P15DB : 1.5 db gain. value.                                               */
  PDM_PCFG_PGARIGHT_0DB                = 4,     /*!< 0DB : 0.0 db gain. value.                                                 */
  PDM_PCFG_PGARIGHT_M15DB              = 3,     /*!< M15DB : -1.5 db gain. value.                                              */
  PDM_PCFG_PGARIGHT_M300DB             = 2,     /*!< M300DB : -3.0 db gain. value.                                             */
  PDM_PCFG_PGARIGHT_M45DB              = 1,     /*!< M45DB : -4.5 db gain. value.                                              */
  PDM_PCFG_PGARIGHT_M60DB              = 0,     /*!< M60DB : -6.0 db gain. value.                                              */
} PDM_PCFG_PGARIGHT_Enum;

/* ===============================================  PDM PCFG PGALEFT [21..25]  =============================================== */
typedef enum {                                  /*!< PDM_PCFG_PGALEFT                                                          */
  PDM_PCFG_PGALEFT_P405DB              = 31,    /*!< P405DB : 40.5 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P390DB              = 30,    /*!< P390DB : 39.0 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P375DB              = 29,    /*!< P375DB : 37.5 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P360DB              = 28,    /*!< P360DB : 36.0 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P345DB              = 27,    /*!< P345DB : 34.5 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P330DB              = 26,    /*!< P330DB : 33.0 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P315DB              = 25,    /*!< P315DB : 31.5 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P300DB              = 24,    /*!< P300DB : 30.0 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P285DB              = 23,    /*!< P285DB : 28.5 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P270DB              = 22,    /*!< P270DB : 27.0 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P255DB              = 21,    /*!< P255DB : 25.5 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P240DB              = 20,    /*!< P240DB : 24.0 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P225DB              = 19,    /*!< P225DB : 22.5 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P210DB              = 18,    /*!< P210DB : 21.0 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P195DB              = 17,    /*!< P195DB : 19.5 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P180DB              = 16,    /*!< P180DB : 18.0 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P165DB              = 15,    /*!< P165DB : 16.5 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P150DB              = 14,    /*!< P150DB : 15.0 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P135DB              = 13,    /*!< P135DB : 13.5 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P120DB              = 12,    /*!< P120DB : 12.0 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P105DB              = 11,    /*!< P105DB : 10.5 db gain. value.                                             */
  PDM_PCFG_PGALEFT_P90DB               = 10,    /*!< P90DB : 9.0 db gain. value.                                               */
  PDM_PCFG_PGALEFT_P75DB               = 9,     /*!< P75DB : 7.5 db gain. value.                                               */
  PDM_PCFG_PGALEFT_P60DB               = 8,     /*!< P60DB : 6.0 db gain. value.                                               */
  PDM_PCFG_PGALEFT_P45DB               = 7,     /*!< P45DB : 4.5 db gain. value.                                               */
  PDM_PCFG_PGALEFT_P30DB               = 6,     /*!< P30DB : 3.0 db gain. value.                                               */
  PDM_PCFG_PGALEFT_P15DB               = 5,     /*!< P15DB : 1.5 db gain. value.                                               */
  PDM_PCFG_PGALEFT_0DB                 = 4,     /*!< 0DB : 0.0 db gain. value.                                                 */
  PDM_PCFG_PGALEFT_M15DB               = 3,     /*!< M15DB : -1.5 db gain. value.                                              */
  PDM_PCFG_PGALEFT_M300DB              = 2,     /*!< M300DB : -3.0 db gain. value.                                             */
  PDM_PCFG_PGALEFT_M45DB               = 1,     /*!< M45DB : -4.5 db gain. value.                                              */
  PDM_PCFG_PGALEFT_M60DB               = 0,     /*!< M60DB : -6.0 db gain. value.                                              */
} PDM_PCFG_PGALEFT_Enum;

