tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ================================================  PDM DMACFG DMAEN [0..0]  ================================================ */
typedef enum {                                  /*!< PDM_DMACFG_DMAEN                                                          */
  PDM_DMACFG_DMAEN_DIS                 = 0,     /*!< DIS : Disable DMA Function value.                                         */
  PDM_DMACFG_DMAEN_EN                  = 1,     /*!< EN : Enable DMA Function value.                                           */
} PDM_DMACFG_DMAEN_Enum;

/* ======================================================  DMATOTCOUNT  ====================================================== */
/* ======================================================  DMATARGADDR  ====================================================== */
/* ========================================================  DMASTAT  ======================================================== */


/* =========================================================================================================================== */
/* ================                                          PWRCTRL                                          ================ */
/* =========================================================================================================================== */

/* =======================================================  SUPPLYSRC  ======================================================= */
/* ==========================================  PWRCTRL SUPPLYSRC BLEBUCKEN [0..0]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_SUPPLYSRC_BLEBUCKEN                                               */
  PWRCTRL_SUPPLYSRC_BLEBUCKEN_EN       = 1,     /*!< EN : Enable the BLE Buck. value.                                          */
  PWRCTRL_SUPPLYSRC_BLEBUCKEN_DIS      = 0,     /*!< DIS : Disable the BLE Buck. value.                                        */
} PWRCTRL_SUPPLYSRC_BLEBUCKEN_Enum;

/* =====================================================  SUPPLYSTATUS  ====================================================== */
/* =========================================  PWRCTRL SUPPLYSTATUS BLEBUCKON [1..1]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_SUPPLYSTATUS_BLEBUCKON                                            */
  PWRCTRL_SUPPLYSTATUS_BLEBUCKON_LDO   = 0,     /*!< LDO : Indicates the the LDO is supplying the BLE/Burst power
                                                     domain value.                                                             */
  PWRCTRL_SUPPLYSTATUS_BLEBUCKON_BUCK  = 1,     /*!< BUCK : Indicates the the Buck is supplying the BLE/Burst power
                                                     domain value.                                                             */
} PWRCTRL_SUPPLYSTATUS_BLEBUCKON_Enum;

/* ========================================  PWRCTRL SUPPLYSTATUS SIMOBUCKON [0..0]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_SUPPLYSTATUS_SIMOBUCKON                                           */
  PWRCTRL_SUPPLYSTATUS_SIMOBUCKON_OFF  = 0,     /*!< OFF : Indicates the the SIMO Buck is OFF. value.                          */
  PWRCTRL_SUPPLYSTATUS_SIMOBUCKON_ON   = 1,     /*!< ON : Indicates the the SIMO Buck is ON. value.                            */
} PWRCTRL_SUPPLYSTATUS_SIMOBUCKON_Enum;

/* =======================================================  DEVPWREN  ======================================================== */
/* ===========================================  PWRCTRL DEVPWREN PWRBLEL [13..13]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRBLEL                                                  */
  PWRCTRL_DEVPWREN_PWRBLEL_EN          = 1,     /*!< EN : Power up BLE controller value.                                       */
  PWRCTRL_DEVPWREN_PWRBLEL_DIS         = 0,     /*!< DIS : Power down BLE controller value.                                    */
} PWRCTRL_DEVPWREN_PWRBLEL_Enum;

/* ===========================================  PWRCTRL DEVPWREN PWRPDM [12..12]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRPDM                                                   */
  PWRCTRL_DEVPWREN_PWRPDM_EN           = 1,     /*!< EN : Power up PDM value.                                                  */
  PWRCTRL_DEVPWREN_PWRPDM_DIS          = 0,     /*!< DIS : Power down PDM value.                                               */
} PWRCTRL_DEVPWREN_PWRPDM_Enum;

/* ===========================================  PWRCTRL DEVPWREN PWRMSPI [11..11]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRMSPI                                                  */
  PWRCTRL_DEVPWREN_PWRMSPI_EN          = 1,     /*!< EN : Power up MSPI value.                                                 */
  PWRCTRL_DEVPWREN_PWRMSPI_DIS         = 0,     /*!< DIS : Power down MSPI value.                                              */
} PWRCTRL_DEVPWREN_PWRMSPI_Enum;

/* ==========================================  PWRCTRL DEVPWREN PWRSCARD [10..10]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRSCARD                                                 */
  PWRCTRL_DEVPWREN_PWRSCARD_EN         = 1,     /*!< EN : Power up SCARD value.                                                */
  PWRCTRL_DEVPWREN_PWRSCARD_DIS        = 0,     /*!< DIS : Power down SCARD value.                                             */
} PWRCTRL_DEVPWREN_PWRSCARD_Enum;

/* ============================================  PWRCTRL DEVPWREN PWRADC [9..9]  ============================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRADC                                                   */
  PWRCTRL_DEVPWREN_PWRADC_EN           = 1,     /*!< EN : Power up ADC value.                                                  */
  PWRCTRL_DEVPWREN_PWRADC_DIS          = 0,     /*!< DIS : Power Down ADC value.                                               */
} PWRCTRL_DEVPWREN_PWRADC_Enum;

