tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* ===========================================  PWRCTRL DEVPWREN PWRUART1 [8..8]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRUART1                                                 */
  PWRCTRL_DEVPWREN_PWRUART1_EN         = 1,     /*!< EN : Power up UART 1 value.                                               */
  PWRCTRL_DEVPWREN_PWRUART1_DIS        = 0,     /*!< DIS : Power down UART 1 value.                                            */
} PWRCTRL_DEVPWREN_PWRUART1_Enum;

/* ===========================================  PWRCTRL DEVPWREN PWRUART0 [7..7]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRUART0                                                 */
  PWRCTRL_DEVPWREN_PWRUART0_EN         = 1,     /*!< EN : Power up UART 0 value.                                               */
  PWRCTRL_DEVPWREN_PWRUART0_DIS        = 0,     /*!< DIS : Power down UART 0 value.                                            */
} PWRCTRL_DEVPWREN_PWRUART0_Enum;

/* ============================================  PWRCTRL DEVPWREN PWRIOM5 [6..6]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRIOM5                                                  */
  PWRCTRL_DEVPWREN_PWRIOM5_EN          = 1,     /*!< EN : Power up IO Master 5 value.                                          */
  PWRCTRL_DEVPWREN_PWRIOM5_DIS         = 0,     /*!< DIS : Power down IO Master 5 value.                                       */
} PWRCTRL_DEVPWREN_PWRIOM5_Enum;

/* ============================================  PWRCTRL DEVPWREN PWRIOM4 [5..5]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRIOM4                                                  */
  PWRCTRL_DEVPWREN_PWRIOM4_EN          = 1,     /*!< EN : Power up IO Master 4 value.                                          */
  PWRCTRL_DEVPWREN_PWRIOM4_DIS         = 0,     /*!< DIS : Power down IO Master 4 value.                                       */
} PWRCTRL_DEVPWREN_PWRIOM4_Enum;

/* ============================================  PWRCTRL DEVPWREN PWRIOM3 [4..4]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRIOM3                                                  */
  PWRCTRL_DEVPWREN_PWRIOM3_EN          = 1,     /*!< EN : Power up IO Master 3 value.                                          */
  PWRCTRL_DEVPWREN_PWRIOM3_DIS         = 0,     /*!< DIS : Power down IO Master 3 value.                                       */
} PWRCTRL_DEVPWREN_PWRIOM3_Enum;

/* ============================================  PWRCTRL DEVPWREN PWRIOM2 [3..3]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRIOM2                                                  */
  PWRCTRL_DEVPWREN_PWRIOM2_EN          = 1,     /*!< EN : Power up IO Master 2 value.                                          */
  PWRCTRL_DEVPWREN_PWRIOM2_DIS         = 0,     /*!< DIS : Power down IO Master 2 value.                                       */
} PWRCTRL_DEVPWREN_PWRIOM2_Enum;

/* ============================================  PWRCTRL DEVPWREN PWRIOM1 [2..2]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRIOM1                                                  */
  PWRCTRL_DEVPWREN_PWRIOM1_EN          = 1,     /*!< EN : Power up IO Master 1 value.                                          */
  PWRCTRL_DEVPWREN_PWRIOM1_DIS         = 0,     /*!< DIS : Power down IO Master 1 value.                                       */
} PWRCTRL_DEVPWREN_PWRIOM1_Enum;

/* ============================================  PWRCTRL DEVPWREN PWRIOM0 [1..1]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRIOM0                                                  */
  PWRCTRL_DEVPWREN_PWRIOM0_EN          = 1,     /*!< EN : Power up IO Master 0 value.                                          */
  PWRCTRL_DEVPWREN_PWRIOM0_DIS         = 0,     /*!< DIS : Power down IO Master 0 value.                                       */
} PWRCTRL_DEVPWREN_PWRIOM0_Enum;

/* ============================================  PWRCTRL DEVPWREN PWRIOS [0..0]  ============================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREN_PWRIOS                                                   */
  PWRCTRL_DEVPWREN_PWRIOS_EN           = 1,     /*!< EN : Power up IO slave value.                                             */
  PWRCTRL_DEVPWREN_PWRIOS_DIS          = 0,     /*!< DIS : Power down IO slave value.                                          */
} PWRCTRL_DEVPWREN_PWRIOS_Enum;

/* =====================================================  MEMPWDINSLEEP  ===================================================== */
/* ======================================  PWRCTRL MEMPWDINSLEEP CACHEPWDSLP [31..31]  ======================================= */
typedef enum {                                  /*!< PWRCTRL_MEMPWDINSLEEP_CACHEPWDSLP                                         */
  PWRCTRL_MEMPWDINSLEEP_CACHEPWDSLP_EN = 1,     /*!< EN : Power down cache in deep sleep value.                                */
  PWRCTRL_MEMPWDINSLEEP_CACHEPWDSLP_DIS = 0,    /*!< DIS : Retain cache in deep sleep value.                                   */
} PWRCTRL_MEMPWDINSLEEP_CACHEPWDSLP_Enum;

/* ======================================  PWRCTRL MEMPWDINSLEEP FLASH1PWDSLP [14..14]  ====================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWDINSLEEP_FLASH1PWDSLP                                        */
  PWRCTRL_MEMPWDINSLEEP_FLASH1PWDSLP_EN = 1,    /*!< EN : Flash1 is powered down during deepsleep value.                       */
  PWRCTRL_MEMPWDINSLEEP_FLASH1PWDSLP_DIS = 0,   /*!< DIS : Flash1 is kept powered on during deepsleep value.                   */
} PWRCTRL_MEMPWDINSLEEP_FLASH1PWDSLP_Enum;

/* ======================================  PWRCTRL MEMPWDINSLEEP FLASH0PWDSLP [13..13]  ====================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWDINSLEEP_FLASH0PWDSLP                                        */
  PWRCTRL_MEMPWDINSLEEP_FLASH0PWDSLP_EN = 1,    /*!< EN : Flash0 is powered down during deepsleep value.                       */
  PWRCTRL_MEMPWDINSLEEP_FLASH0PWDSLP_DIS = 0,   /*!< DIS : Flash0 is kept powered on during deepsleep value.                   */
} PWRCTRL_MEMPWDINSLEEP_FLASH0PWDSLP_Enum;

