tensorflow/tensorflow/tensorflow/lite/experimental/micro/examples/micro_speech/apollo3/apollo3.h
/* =======================================  PWRCTRL MEMPWDINSLEEP SRAMPWDSLP [3..12]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP                                          */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_NONE = 0,    /*!< NONE : All banks retained value.                                          */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP0 = 1,  /*!< GROUP0 : SRAM GROUP0 powered down (64KB-96KB) value.                      */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP1 = 2,  /*!< GROUP1 : SRAM GROUP1 powered down (96KB-128KB) value.                     */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP2 = 4,  /*!< GROUP2 : SRAM GROUP2 powered down (128KB-160KB) value.                    */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP3 = 8,  /*!< GROUP3 : SRAM GROUP3 powered down (160KB-192KB) value.                    */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP4 = 16, /*!< GROUP4 : SRAM GROUP4 powered down (192KB-224KB) value.                    */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP5 = 32, /*!< GROUP5 : SRAM GROUP5 powered down (224KB-256KB) value.                    */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP6 = 64, /*!< GROUP6 : SRAM GROUP6 powered down (256KB-288KB) value.                    */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP7 = 128,/*!< GROUP7 : SRAM GROUP7 powered down (288KB-320KB) value.                    */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP8 = 256,/*!< GROUP8 : SRAM GROUP8 powered down (320KB-352KB) value.                    */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_GROUP9 = 512,/*!< GROUP9 : SRAM GROUP9 powered down (352KB-384KB) value.                    */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_SRAM64K = 3, /*!< SRAM64K : Powerdown lower 64k SRAM (64KB-128KB) value.                    */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_SRAM128K = 15,/*!< SRAM128K : Powerdown lower 128k SRAM (64KB-192KB) value.                 */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_ALLBUTLOWER32K = 1022,/*!< ALLBUTLOWER32K : All SRAM banks but lower 32k powered down (96KB-384KB).
                                                     value.                                                                    */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_ALLBUTLOWER64K = 1020,/*!< ALLBUTLOWER64K : All banks but lower 64k powered down. value.    */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_ALLBUTLOWER128K = 1008,/*!< ALLBUTLOWER128K : All banks but lower 128k powered down. value. */
  PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_ALL = 1023,  /*!< ALL : All banks powered down. value.                                      */
} PWRCTRL_MEMPWDINSLEEP_SRAMPWDSLP_Enum;

/* ========================================  PWRCTRL MEMPWDINSLEEP DTCMPWDSLP [0..2]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP                                          */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_NONE = 0,    /*!< NONE : All DTCM retained value.                                           */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_GROUP0DTCM0 = 1,/*!< GROUP0DTCM0 : Group0_DTCM0 powered down in deep sleep (0KB-8KB)
                                                     value.                                                                    */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_GROUP0DTCM1 = 2,/*!< GROUP0DTCM1 : Group0_DTCM1 powered down in deep sleep (8KB-32KB)
                                                     value.                                                                    */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_GROUP0 = 3,  /*!< GROUP0 : Both DTCMs in group0 are powered down in deep sleep
                                                     (0KB-32KB) value.                                                         */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_ALLBUTGROUP0DTCM0 = 6,/*!< ALLBUTGROUP0DTCM0 : Group1 and Group0_DTCM1 are powered down
                                                     in deep sleep (8KB-64KB) value.                                           */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_GROUP1 = 4,  /*!< GROUP1 : Group1 DTCM powered down in deep sleep (32KB-64KB)
                                                     value.                                                                    */
  PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_ALL = 7,     /*!< ALL : All DTCMs powered down in deep sleep (0KB-64KB) value.              */
} PWRCTRL_MEMPWDINSLEEP_DTCMPWDSLP_Enum;

/* =======================================================  MEMPWREN  ======================================================== */
/* ===========================================  PWRCTRL MEMPWREN CACHEB2 [31..31]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_CACHEB2                                                  */
  PWRCTRL_MEMPWREN_CACHEB2_EN          = 1,     /*!< EN : Power up Cache Bank 2 value.                                         */
  PWRCTRL_MEMPWREN_CACHEB2_DIS         = 0,     /*!< DIS : Power down Cache Bank 2 value.                                      */
} PWRCTRL_MEMPWREN_CACHEB2_Enum;

/* ===========================================  PWRCTRL MEMPWREN CACHEB0 [30..30]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_CACHEB0                                                  */
  PWRCTRL_MEMPWREN_CACHEB0_EN          = 1,     /*!< EN : Power up Cache Bank 0 value.                                         */
  PWRCTRL_MEMPWREN_CACHEB0_DIS         = 0,     /*!< DIS : Power down Cache Bank 0 value.                                      */
} PWRCTRL_MEMPWREN_CACHEB0_Enum;

/* ===========================================  PWRCTRL MEMPWREN FLASH1 [14..14]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_FLASH1                                                   */
  PWRCTRL_MEMPWREN_FLASH1_EN           = 1,     /*!< EN : Power up Flash1 value.                                               */
  PWRCTRL_MEMPWREN_FLASH1_DIS          = 0,     /*!< DIS : Power down Flash1 value.                                            */
} PWRCTRL_MEMPWREN_FLASH1_Enum;

/* ===========================================  PWRCTRL MEMPWREN FLASH0 [13..13]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_FLASH0                                                   */
  PWRCTRL_MEMPWREN_FLASH0_EN           = 1,     /*!< EN : Power up Flash0 value.                                               */
  PWRCTRL_MEMPWREN_FLASH0_DIS          = 0,     /*!< DIS : Power down Flash0 value.                                            */
} PWRCTRL_MEMPWREN_FLASH0_Enum;

/* =============================================  PWRCTRL MEMPWREN SRAM [3..12]  ============================================= */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_SRAM                                                     */
  PWRCTRL_MEMPWREN_SRAM_NONE           = 0,     /*!< NONE : Do not power ON any of the SRAM banks value.                       */
  PWRCTRL_MEMPWREN_SRAM_GROUP0         = 1,     /*!< GROUP0 : Power ON only SRAM group0 (0KB-32KB) value.                      */
  PWRCTRL_MEMPWREN_SRAM_GROUP1         = 2,     /*!< GROUP1 : Power ON only SRAM group1 (32KB-64KB) value.                     */
  PWRCTRL_MEMPWREN_SRAM_GROUP2         = 4,     /*!< GROUP2 : Power ON only SRAM group2 (64KB-96KB) value.                     */
  PWRCTRL_MEMPWREN_SRAM_GROUP3         = 8,     /*!< GROUP3 : Power ON only SRAM group3 (96KB-128KB) value.                    */
  PWRCTRL_MEMPWREN_SRAM_GROUP4         = 16,    /*!< GROUP4 : Power ON only SRAM group4 (128KB-160KB) value.                   */
  PWRCTRL_MEMPWREN_SRAM_GROUP5         = 32,    /*!< GROUP5 : Power ON only SRAM group5 (160KB-192KB) value.                   */
  PWRCTRL_MEMPWREN_SRAM_GROUP6         = 64,    /*!< GROUP6 : Power ON only SRAM group6 (192KB-224KB) value.                   */
  PWRCTRL_MEMPWREN_SRAM_GROUP7         = 128,   /*!< GROUP7 : Power ON only SRAM group7 (224KB-256KB) value.                   */
  PWRCTRL_MEMPWREN_SRAM_GROUP8         = 256,   /*!< GROUP8 : Power ON only SRAM group8 (256KB-288KB) value.                   */
  PWRCTRL_MEMPWREN_SRAM_GROUP9         = 512,   /*!< GROUP9 : Power ON only SRAM group9 (288KB-320KB) value.                   */
  PWRCTRL_MEMPWREN_SRAM_SRAM64K        = 3,     /*!< SRAM64K : Power ON only lower 64k value.                                  */
  PWRCTRL_MEMPWREN_SRAM_SRAM128K       = 15,    /*!< SRAM128K : Power ON only lower 128k value.                                */
  PWRCTRL_MEMPWREN_SRAM_SRAM256K       = 255,   /*!< SRAM256K : Power ON only lower 256k value.                                */
  PWRCTRL_MEMPWREN_SRAM_ALL            = 1023,  /*!< ALL : All SRAM banks (320K) powered ON value.                             */
} PWRCTRL_MEMPWREN_SRAM_Enum;

/* =============================================  PWRCTRL MEMPWREN DTCM [0..2]  ============================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_DTCM                                                     */
  PWRCTRL_MEMPWREN_DTCM_NONE           = 0,     /*!< NONE : Do not enable power to any DTCMs value.                            */
  PWRCTRL_MEMPWREN_DTCM_GROUP0DTCM0    = 1,     /*!< GROUP0DTCM0 : Power ON only GROUP0_DTCM0 value.                           */
  PWRCTRL_MEMPWREN_DTCM_GROUP0DTCM1    = 2,     /*!< GROUP0DTCM1 : Power ON only GROUP0_DTCM1 value.                           */
  PWRCTRL_MEMPWREN_DTCM_GROUP0         = 3,     /*!< GROUP0 : Power ON only DTCMs in group0 value.                             */
  PWRCTRL_MEMPWREN_DTCM_GROUP1         = 4,     /*!< GROUP1 : Power ON only DTCMs in group1 value.                             */
  PWRCTRL_MEMPWREN_DTCM_ALL            = 7,     /*!< ALL : Power ON all DTCMs value.                                           */
} PWRCTRL_MEMPWREN_DTCM_Enum;

